
. 
. import delimited using ./output/input_pbc.csv, clear
(94 vars, 1,000 obs)

. 
. * Prepare variables for table 
. replace ethnicity=6 if ethnicity==0
(40 real changes made)

. label define eth5                       1 "White"                            
>            ///
>                             2 "Mixed"                           ///          
>                                    
>                             3 "Asian"                                   ///
>                             4 "Black"                                   ///
>                             5 "Other"                                   ///
>                             6 "Unknown"

.                     
. 
. label values ethnicity eth5

. safetab ethnicity, m
10

  ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |        148       14.80       14.80
      Mixed |        221       22.10       36.90
      Asian |        201       20.10       57.00
      Black |        215       21.50       78.50
      Other |        175       17.50       96.00
    Unknown |         40        4.00      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. *(2) IMD
. replace imd=6 if imd==0
(46 real changes made)

. 
. * Create age categories
. egen age_cat = cut(age), at(18, 40, 60, 80, 120) icodes
(221 missing values generated)

. label define age 0 "18 - 40 years" 1 "41 - 60 years" 2 "61 - 80 years" 3 ">80
>  years"

. label values age_cat age

. bys age_cat: sum age

-------------------------------------------------------------------------------
-> age_cat = 18 - 40 years

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        262          29    6.213321         18         39

-------------------------------------------------------------------------------
-> age_cat = 41 - 60 years

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        286    49.78322    5.697817         40         59

-------------------------------------------------------------------------------
-> age_cat = 61 - 80 years

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        175    68.09714    5.001924         60         79

-------------------------------------------------------------------------------
-> age_cat = >80 years

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |         56    86.01786    4.429205         80         96

-------------------------------------------------------------------------------
-> age_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        221    9.013575    5.145589          0         17


. 
. * BMI categories
. egen bmi_cat = cut(bmi), at(0, 1, 18.5, 24.9, 29.9, 39.9, 100) icodes

. bys bmi_cat: sum bmi

-------------------------------------------------------------------------------
-> bmi_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        199           0           0          0          0

-------------------------------------------------------------------------------
-> bmi_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        111    14.37304     3.12353   5.023962   18.45848

-------------------------------------------------------------------------------
-> bmi_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        194     22.0221    1.741445    18.5722    24.8635

-------------------------------------------------------------------------------
-> bmi_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        189    27.46001     1.40737   24.99605    29.8709

-------------------------------------------------------------------------------
-> bmi_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        259    34.04899    2.632962   29.96433    39.8527

-------------------------------------------------------------------------------
-> bmi_cat = 5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |         48    43.28909    3.092186   39.93234   52.25912


. * add missing . to zero category
. replace bmi_cat = 0 if bmi_cat==. 
(0 real changes made)

. label define bmi 0 "Missing" 1 "Underweight" 2 "Healthy range" 3 "Overweight"
>  4 "Obese" 5 "Morbidly obese"

. label values bmi_cat bmi

. 
. replace oral_steroid_drugs_nhsd=. if oral_steroid_drug_nhsd_3m_count < 2 & or
> al_steroid_drug_nhsd_12m_count < 4
(937 real changes made, 937 to missing)

. gen imid_nhsd=max(oral_steroid_drugs_nhsd, immunosuppresant_drugs_nhsd)

. gen rare_neuro_nhsd = max(multiple_sclerosis_nhsd, motor_neurone_disease_nhsd
> , myasthenia_gravis_nhsd, huntingtons_disease_nhsd)

. gen solid_organ_transplant_bin = solid_organ_transplant_nhsd_new!=""

. gen any_high_risk_condition = max(learning_disability_nhsd_snomed, cancer_ope
> nsafely_snomed_new, haematological_disease_nhsd, ///
> ckd_stage_5_nhsd, imid_nhsd, immunosupression_nhsd_new, hiv_aids_nhsd, solid_
> organ_transplant_bin, rare_neuro_nhsd)

. 
. foreach var in gc budesonide fenofibrate {
  2.     gen `var'_any = (`var'_count>=1 & `var'_count!=.)
  3. }

. gen udca_any = (udca_count_fu>=1 & udca_count_fu!=.)

. 
. * Create tables 
. * Characteristics whole cohort
. preserve

. table1_mc, vars(age_cat cat \ sex cat \ imd cat \ ethnicity cat \ severe_dise
> ase_bl cat \ smoking_status cat \ bmi_cat cat \ has_pbc bin \ ///
> any_high_risk_condition cat) clear

  +---------------------------------------+
  | factor                      N_1   m_1 |
  |---------------------------------------|
  | age_cat                     779   221 |
  |---------------------------------------|
  | sex                       1,000     0 |
  |---------------------------------------|
  | imd                       1,000     0 |
  |---------------------------------------|
  | ethnicity                 1,000     0 |
  |---------------------------------------|
  | severe_disease_bl         1,000     0 |
  |---------------------------------------|
  | smoking_status              500   500 |
  |---------------------------------------|
  | bmi_cat                   1,000     0 |
  |---------------------------------------|
  | has_pbc                   1,000     0 |
  |---------------------------------------|
  | any_high_risk_condition   1,000     0 |
  +---------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +-----------------------------------------------------------+
  |                                            Total          |
  |-----------------------------------------------------------|
  |                                            N=1,000        |
  |-----------------------------------------------------------|
  | age_cat                   18 - 40 years    262 (33.6%)    |
  |                           41 - 60 years    286 (36.7%)    |
  |                           61 - 80 years    175 (22.5%)    |
  |                           >80 years        56 ( 7.2%)     |
  |-----------------------------------------------------------|
  | sex                       F                512 (51.2%)    |
  |                           M                481 (48.1%)    |
  |                           U                7 ( 0.7%)      |
  |-----------------------------------------------------------|
  | imd                       1                196 (19.6%)    |
  |                           2                195 (19.5%)    |
  |                           3                179 (17.9%)    |
  |                           4                209 (20.9%)    |
  |                           5                175 (17.5%)    |
  |                           6                46 ( 4.6%)     |
  |-----------------------------------------------------------|
  | ethnicity                 White            148 (14.8%)    |
  |                           Mixed            221 (22.1%)    |
  |                           Asian            201 (20.1%)    |
  |                           Black            215 (21.5%)    |
  |                           Other            175 (17.5%)    |
  |                           Unknown          40 ( 4.0%)     |
  |-----------------------------------------------------------|
  | severe_disease_bl         0                500 (50.0%)    |
  |                           1                500 (50.0%)    |
  |-----------------------------------------------------------|
  | smoking_status            E                162 (32.4%)    |
  |                           M                45 ( 9.0%)     |
  |                           N                89 (17.8%)     |
  |                           S                204 (40.8%)    |
  |-----------------------------------------------------------|
  | bmi_cat                   Missing          199 (19.9%)    |
  |                           Underweight      111 (11.1%)    |
  |                           Healthy range    194 (19.4%)    |
  |                           Overweight       189 (18.9%)    |
  |                           Obese            259 (25.9%)    |
  |                           Morbidly obese   48 ( 4.8%)     |
  |-----------------------------------------------------------|
  | has_pbc                                    500 (50.0%)    |
  |-----------------------------------------------------------|
  | any_high_risk_condition   1                1,000 (100.0%) |
  +-----------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/baseline_table.csv, replace
(note: file ./output/tables/baseline_table.csv not found)
file ./output/tables/baseline_table.csv saved

. * Rounding numbers in table to nearest 5
. destring _columna_1, gen(n) force
_columna_1: contains nonnumeric characters; n generated as int
(3 missing values generated)

. destring _columnb_1, gen(percent) ignore("-" "%" "(" ")")  force
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent generated as double
(2 missing values generated)

. gen rounded_n = round(n, 5)
(3 missing values generated)

. keep factor level rounded_n percent

. export delimited using ./output/tables/baseline_table_rounded.csv
file ./output/tables/baseline_table_rounded.csv saved

. restore 

. 
. * High risk conditions
. preserve

. table1_mc, vars(learning_disability_nhsd_snomed cat \ cancer_opensafely_snome
> d_new cat \ haematological_disease_nhsd cat \ ///
> ckd_stage_5_nhsd cat \ imid_nhsd cat \ immunosupression_nhsd_new cat \ hiv_ai
> ds_nhsd cat \ solid_organ_transplant_nhsd_new cat \  ///
> rare_neuro_nhsd cat) clear

  +-----------------------------------------------+
  | factor                              N_1   m_1 |
  |-----------------------------------------------|
  | learning_disability_nhsd_snomed   1,000     0 |
  |-----------------------------------------------|
  | cancer_opensafely_snomed_new      1,000     0 |
  |-----------------------------------------------|
  | haematological_disease_nhsd       1,000     0 |
  |-----------------------------------------------|
  | ckd_stage_5_nhsd                  1,000     0 |
  |-----------------------------------------------|
  | imid_nhsd                         1,000     0 |
  |-----------------------------------------------|
  | immunosupression_nhsd_new         1,000     0 |
  |-----------------------------------------------|
  | hiv_aids_nhsd                     1,000     0 |
  |-----------------------------------------------|
  | solid_organ_transplant_nhsd_new     517   483 |
  |-----------------------------------------------|
  | rare_neuro_nhsd                   1,000     0 |
  +-----------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +------------------------------------------------------------+
  |                                                Total       |
  |------------------------------------------------------------|
  |                                                N=1,000     |
  |------------------------------------------------------------|
  | learning_disability_nhsd_snomed   0            500 (50.0%) |
  |                                   1            500 (50.0%) |
  |------------------------------------------------------------|
  | cancer_opensafely_snomed_new      0            500 (50.0%) |
  |                                   1            500 (50.0%) |
  |------------------------------------------------------------|
  | haematological_disease_nhsd       0            12 ( 1.2%)  |
  |                                   1            988 (98.8%) |
  |------------------------------------------------------------|
  | ckd_stage_5_nhsd                  0            260 (26.0%) |
  |                                   1            740 (74.0%) |
  |------------------------------------------------------------|
  | imid_nhsd                         0            482 (48.2%) |
  |                                   1            518 (51.8%) |
  |------------------------------------------------------------|
  | immunosupression_nhsd_new         0            500 (50.0%) |
  |                                   1            500 (50.0%) |
  |------------------------------------------------------------|
  | hiv_aids_nhsd                     0            761 (76.1%) |
  |                                   1            239 (23.9%) |
  |------------------------------------------------------------|
  | solid_organ_transplant_nhsd_new   1900-04-03   1 ( 0.2%)   |
  |                                   1900-05-29   1 ( 0.2%)   |
  |                                   1900-07-12   1 ( 0.2%)   |
  |                                   1900-08-29   1 ( 0.2%)   |
  |                                   1900-10-14   1 ( 0.2%)   |
  |                                   1900-12-12   1 ( 0.2%)   |
  |                                   1900-12-19   1 ( 0.2%)   |
  |                                   1901-04-01   1 ( 0.2%)   |
  |                                   1901-09-04   1 ( 0.2%)   |
  |                                   1902-03-20   1 ( 0.2%)   |
  |                                   1902-03-24   1 ( 0.2%)   |
  |                                   1902-09-06   1 ( 0.2%)   |
  |                                   1902-09-08   1 ( 0.2%)   |
  |                                   1902-10-23   1 ( 0.2%)   |
  |                                   1903-01-25   1 ( 0.2%)   |
  |                                   1903-07-02   1 ( 0.2%)   |
  |                                   1903-08-04   1 ( 0.2%)   |
  |                                   1903-08-28   1 ( 0.2%)   |
  |                                   1904-03-06   1 ( 0.2%)   |
  |                                   1904-03-07   1 ( 0.2%)   |
  |                                   1904-06-16   1 ( 0.2%)   |
  |                                   1904-09-25   1 ( 0.2%)   |
  |                                   1904-10-24   1 ( 0.2%)   |
  |                                   1904-11-20   1 ( 0.2%)   |
  |                                   1905-02-27   1 ( 0.2%)   |
  |                                   1905-05-14   1 ( 0.2%)   |
  |                                   1905-06-21   1 ( 0.2%)   |
  |                                   1905-07-23   1 ( 0.2%)   |
  |                                   1905-08-15   1 ( 0.2%)   |
  |                                   1906-06-01   1 ( 0.2%)   |
  |                                   1907-03-04   1 ( 0.2%)   |
  |                                   1907-07-16   1 ( 0.2%)   |
  |                                   1907-08-17   1 ( 0.2%)   |
  |                                   1907-10-25   1 ( 0.2%)   |
  |                                   1907-11-29   1 ( 0.2%)   |
  |                                   1907-12-12   1 ( 0.2%)   |
  |                                   1907-12-24   1 ( 0.2%)   |
  |                                   1908-01-06   1 ( 0.2%)   |
  |                                   1908-04-01   1 ( 0.2%)   |
  |                                   1908-06-19   1 ( 0.2%)   |
  |                                   1909-02-20   1 ( 0.2%)   |
  |                                   1909-03-17   1 ( 0.2%)   |
  |                                   1909-03-22   1 ( 0.2%)   |
  |                                   1909-04-02   1 ( 0.2%)   |
  |                                   1909-06-29   1 ( 0.2%)   |
  |                                   1909-11-25   1 ( 0.2%)   |
  |                                   1910-03-11   1 ( 0.2%)   |
  |                                   1910-04-28   1 ( 0.2%)   |
  |                                   1910-06-16   1 ( 0.2%)   |
  |                                   1910-06-24   1 ( 0.2%)   |
  |                                   1910-09-15   1 ( 0.2%)   |
  |                                   1910-10-08   1 ( 0.2%)   |
  |                                   1911-01-08   1 ( 0.2%)   |
  |                                   1911-05-16   1 ( 0.2%)   |
  |                                   1911-05-29   1 ( 0.2%)   |
  |                                   1911-06-03   1 ( 0.2%)   |
  |                                   1912-01-04   1 ( 0.2%)   |
  |                                   1912-02-24   1 ( 0.2%)   |
  |                                   1912-03-18   1 ( 0.2%)   |
  |                                   1912-08-22   1 ( 0.2%)   |
  |                                   1912-10-20   1 ( 0.2%)   |
  |                                   1912-12-25   1 ( 0.2%)   |
  |                                   1913-01-10   1 ( 0.2%)   |
  |                                   1913-01-29   1 ( 0.2%)   |
  |                                   1913-03-24   1 ( 0.2%)   |
  |                                   1913-05-13   1 ( 0.2%)   |
  |                                   1914-04-01   1 ( 0.2%)   |
  |                                   1914-08-09   1 ( 0.2%)   |
  |                                   1914-09-23   1 ( 0.2%)   |
  |                                   1914-12-30   1 ( 0.2%)   |
  |                                   1915-01-22   1 ( 0.2%)   |
  |                                   1915-03-11   1 ( 0.2%)   |
  |                                   1915-09-30   1 ( 0.2%)   |
  |                                   1916-04-13   1 ( 0.2%)   |
  |                                   1917-02-08   1 ( 0.2%)   |
  |                                   1917-03-12   1 ( 0.2%)   |
  |                                   1918-01-10   1 ( 0.2%)   |
  |                                   1918-03-06   1 ( 0.2%)   |
  |                                   1918-06-13   1 ( 0.2%)   |
  |                                   1918-07-24   1 ( 0.2%)   |
  |                                   1918-08-03   1 ( 0.2%)   |
  |                                   1918-09-05   1 ( 0.2%)   |
  |                                   1918-10-09   1 ( 0.2%)   |
  |                                   1918-12-27   1 ( 0.2%)   |
  |                                   1919-08-25   1 ( 0.2%)   |
  |                                   1920-01-25   1 ( 0.2%)   |
  |                                   1920-02-12   1 ( 0.2%)   |
  |                                   1920-07-11   1 ( 0.2%)   |
  |                                   1920-09-27   1 ( 0.2%)   |
  |                                   1920-10-06   1 ( 0.2%)   |
  |                                   1920-11-24   1 ( 0.2%)   |
  |                                   1921-03-02   1 ( 0.2%)   |
  |                                   1921-05-05   1 ( 0.2%)   |
  |                                   1921-05-10   1 ( 0.2%)   |
  |                                   1921-09-11   1 ( 0.2%)   |
  |                                   1921-09-28   1 ( 0.2%)   |
  |                                   1921-12-17   1 ( 0.2%)   |
  |                                   1921-12-20   1 ( 0.2%)   |
  |                                   1922-02-16   1 ( 0.2%)   |
  |                                   1922-08-02   1 ( 0.2%)   |
  |                                   1922-09-01   1 ( 0.2%)   |
  |                                   1922-09-24   1 ( 0.2%)   |
  |                                   1922-10-16   1 ( 0.2%)   |
  |                                   1922-12-15   1 ( 0.2%)   |
  |                                   1922-12-20   1 ( 0.2%)   |
  |                                   1923-05-30   1 ( 0.2%)   |
  |                                   1924-02-16   1 ( 0.2%)   |
  |                                   1924-03-24   1 ( 0.2%)   |
  |                                   1924-03-25   1 ( 0.2%)   |
  |                                   1924-06-28   1 ( 0.2%)   |
  |                                   1924-07-06   1 ( 0.2%)   |
  |                                   1925-02-08   1 ( 0.2%)   |
  |                                   1925-08-16   1 ( 0.2%)   |
  |                                   1925-08-22   1 ( 0.2%)   |
  |                                   1925-08-27   1 ( 0.2%)   |
  |                                   1925-10-20   1 ( 0.2%)   |
  |                                   1926-11-21   1 ( 0.2%)   |
  |                                   1926-11-29   1 ( 0.2%)   |
  |                                   1926-12-25   1 ( 0.2%)   |
  |                                   1927-10-19   1 ( 0.2%)   |
  |                                   1928-05-25   1 ( 0.2%)   |
  |                                   1928-07-19   1 ( 0.2%)   |
  |                                   1928-08-12   1 ( 0.2%)   |
  |                                   1928-10-23   1 ( 0.2%)   |
  |                                   1929-09-20   1 ( 0.2%)   |
  |                                   1930-02-18   1 ( 0.2%)   |
  |                                   1930-05-25   1 ( 0.2%)   |
  |                                   1930-07-26   1 ( 0.2%)   |
  |                                   1931-03-02   1 ( 0.2%)   |
  |                                   1931-06-01   1 ( 0.2%)   |
  |                                   1931-10-03   1 ( 0.2%)   |
  |                                   1931-12-22   1 ( 0.2%)   |
  |                                   1932-01-06   1 ( 0.2%)   |
  |                                   1932-01-12   1 ( 0.2%)   |
  |                                   1932-02-19   1 ( 0.2%)   |
  |                                   1932-03-10   1 ( 0.2%)   |
  |                                   1932-04-26   1 ( 0.2%)   |
  |                                   1932-08-02   1 ( 0.2%)   |
  |                                   1932-10-05   1 ( 0.2%)   |
  |                                   1933-02-27   1 ( 0.2%)   |
  |                                   1933-05-24   1 ( 0.2%)   |
  |                                   1933-07-21   1 ( 0.2%)   |
  |                                   1933-09-16   1 ( 0.2%)   |
  |                                   1933-09-27   1 ( 0.2%)   |
  |                                   1933-10-13   1 ( 0.2%)   |
  |                                   1933-10-15   1 ( 0.2%)   |
  |                                   1933-11-20   1 ( 0.2%)   |
  |                                   1933-12-17   1 ( 0.2%)   |
  |                                   1934-04-05   1 ( 0.2%)   |
  |                                   1934-09-11   1 ( 0.2%)   |
  |                                   1934-09-24   1 ( 0.2%)   |
  |                                   1934-12-15   1 ( 0.2%)   |
  |                                   1935-01-20   1 ( 0.2%)   |
  |                                   1935-09-21   1 ( 0.2%)   |
  |                                   1935-10-04   1 ( 0.2%)   |
  |                                   1935-11-17   1 ( 0.2%)   |
  |                                   1936-07-27   1 ( 0.2%)   |
  |                                   1936-11-02   1 ( 0.2%)   |
  |                                   1936-11-09   1 ( 0.2%)   |
  |                                   1937-03-05   1 ( 0.2%)   |
  |                                   1937-09-15   1 ( 0.2%)   |
  |                                   1937-09-16   1 ( 0.2%)   |
  |                                   1937-09-21   1 ( 0.2%)   |
  |                                   1938-02-03   1 ( 0.2%)   |
  |                                   1938-02-15   1 ( 0.2%)   |
  |                                   1938-02-17   1 ( 0.2%)   |
  |                                   1938-07-24   1 ( 0.2%)   |
  |                                   1938-08-05   1 ( 0.2%)   |
  |                                   1938-11-18   1 ( 0.2%)   |
  |                                   1940-01-07   1 ( 0.2%)   |
  |                                   1940-11-07   1 ( 0.2%)   |
  |                                   1940-11-16   1 ( 0.2%)   |
  |                                   1940-11-29   1 ( 0.2%)   |
  |                                   1941-03-31   1 ( 0.2%)   |
  |                                   1941-04-28   1 ( 0.2%)   |
  |                                   1941-07-31   1 ( 0.2%)   |
  |                                   1941-09-04   1 ( 0.2%)   |
  |                                   1942-03-03   1 ( 0.2%)   |
  |                                   1942-04-15   1 ( 0.2%)   |
  |                                   1943-01-19   1 ( 0.2%)   |
  |                                   1943-02-06   1 ( 0.2%)   |
  |                                   1943-02-08   1 ( 0.2%)   |
  |                                   1943-05-26   1 ( 0.2%)   |
  |                                   1944-01-14   1 ( 0.2%)   |
  |                                   1944-01-26   1 ( 0.2%)   |
  |                                   1944-01-31   1 ( 0.2%)   |
  |                                   1944-02-24   1 ( 0.2%)   |
  |                                   1944-07-05   1 ( 0.2%)   |
  |                                   1944-10-15   1 ( 0.2%)   |
  |                                   1945-06-13   1 ( 0.2%)   |
  |                                   1945-07-08   1 ( 0.2%)   |
  |                                   1945-08-05   1 ( 0.2%)   |
  |                                   1946-05-17   1 ( 0.2%)   |
  |                                   1946-10-18   1 ( 0.2%)   |
  |                                   1947-02-12   1 ( 0.2%)   |
  |                                   1947-02-19   1 ( 0.2%)   |
  |                                   1947-03-09   1 ( 0.2%)   |
  |                                   1947-09-21   1 ( 0.2%)   |
  |                                   1948-04-12   1 ( 0.2%)   |
  |                                   1948-06-17   1 ( 0.2%)   |
  |                                   1949-02-02   1 ( 0.2%)   |
  |                                   1949-02-09   1 ( 0.2%)   |
  |                                   1949-02-25   1 ( 0.2%)   |
  |                                   1949-04-21   1 ( 0.2%)   |
  |                                   1949-08-13   1 ( 0.2%)   |
  |                                   1949-11-15   1 ( 0.2%)   |
  |                                   1950-02-05   1 ( 0.2%)   |
  |                                   1950-02-28   1 ( 0.2%)   |
  |                                   1950-08-24   1 ( 0.2%)   |
  |                                   1950-09-13   1 ( 0.2%)   |
  |                                   1951-01-29   1 ( 0.2%)   |
  |                                   1951-03-02   1 ( 0.2%)   |
  |                                   1951-05-01   1 ( 0.2%)   |
  |                                   1951-05-04   1 ( 0.2%)   |
  |                                   1951-05-11   1 ( 0.2%)   |
  |                                   1951-09-30   1 ( 0.2%)   |
  |                                   1952-01-10   1 ( 0.2%)   |
  |                                   1952-01-11   1 ( 0.2%)   |
  |                                   1952-02-21   1 ( 0.2%)   |
  |                                   1952-02-27   1 ( 0.2%)   |
  |                                   1952-04-26   1 ( 0.2%)   |
  |                                   1952-04-27   1 ( 0.2%)   |
  |                                   1952-06-10   1 ( 0.2%)   |
  |                                   1952-09-30   1 ( 0.2%)   |
  |                                   1952-12-01   1 ( 0.2%)   |
  |                                   1953-04-12   1 ( 0.2%)   |
  |                                   1953-06-06   1 ( 0.2%)   |
  |                                   1953-08-09   1 ( 0.2%)   |
  |                                   1953-08-19   1 ( 0.2%)   |
  |                                   1953-11-06   1 ( 0.2%)   |
  |                                   1953-12-05   1 ( 0.2%)   |
  |                                   1954-04-16   1 ( 0.2%)   |
  |                                   1954-07-22   1 ( 0.2%)   |
  |                                   1954-07-28   1 ( 0.2%)   |
  |                                   1954-09-15   1 ( 0.2%)   |
  |                                   1954-09-21   1 ( 0.2%)   |
  |                                   1954-10-05   1 ( 0.2%)   |
  |                                   1955-05-06   1 ( 0.2%)   |
  |                                   1955-06-08   1 ( 0.2%)   |
  |                                   1955-06-29   1 ( 0.2%)   |
  |                                   1955-07-18   1 ( 0.2%)   |
  |                                   1955-08-08   1 ( 0.2%)   |
  |                                   1955-11-25   1 ( 0.2%)   |
  |                                   1956-11-04   1 ( 0.2%)   |
  |                                   1956-12-29   1 ( 0.2%)   |
  |                                   1957-01-08   1 ( 0.2%)   |
  |                                   1957-03-05   1 ( 0.2%)   |
  |                                   1957-06-23   1 ( 0.2%)   |
  |                                   1957-07-16   1 ( 0.2%)   |
  |                                   1958-06-29   1 ( 0.2%)   |
  |                                   1958-09-25   1 ( 0.2%)   |
  |                                   1958-12-16   1 ( 0.2%)   |
  |                                   1959-02-15   1 ( 0.2%)   |
  |                                   1959-02-26   1 ( 0.2%)   |
  |                                   1959-06-08   1 ( 0.2%)   |
  |                                   1959-07-18   1 ( 0.2%)   |
  |                                   1959-10-22   1 ( 0.2%)   |
  |                                   1959-11-28   1 ( 0.2%)   |
  |                                   1960-01-17   1 ( 0.2%)   |
  |                                   1960-04-15   1 ( 0.2%)   |
  |                                   1960-05-05   1 ( 0.2%)   |
  |                                   1960-06-21   1 ( 0.2%)   |
  |                                   1960-08-13   1 ( 0.2%)   |
  |                                   1961-03-29   1 ( 0.2%)   |
  |                                   1961-05-26   1 ( 0.2%)   |
  |                                   1961-08-06   1 ( 0.2%)   |
  |                                   1962-02-07   1 ( 0.2%)   |
  |                                   1962-03-24   1 ( 0.2%)   |
  |                                   1962-09-27   1 ( 0.2%)   |
  |                                   1964-04-30   1 ( 0.2%)   |
  |                                   1965-01-08   1 ( 0.2%)   |
  |                                   1965-10-15   1 ( 0.2%)   |
  |                                   1966-01-27   1 ( 0.2%)   |
  |                                   1966-03-03   1 ( 0.2%)   |
  |                                   1966-05-27   1 ( 0.2%)   |
  |                                   1966-10-31   1 ( 0.2%)   |
  |                                   1966-11-19   1 ( 0.2%)   |
  |                                   1967-01-21   1 ( 0.2%)   |
  |                                   1967-09-02   1 ( 0.2%)   |
  |                                   1967-12-23   1 ( 0.2%)   |
  |                                   1968-01-17   1 ( 0.2%)   |
  |                                   1968-02-27   1 ( 0.2%)   |
  |                                   1968-08-23   1 ( 0.2%)   |
  |                                   1968-08-27   1 ( 0.2%)   |
  |                                   1969-11-27   1 ( 0.2%)   |
  |                                   1969-11-30   1 ( 0.2%)   |
  |                                   1970-01-02   1 ( 0.2%)   |
  |                                   1970-04-29   1 ( 0.2%)   |
  |                                   1970-06-16   1 ( 0.2%)   |
  |                                   1970-09-13   1 ( 0.2%)   |
  |                                   1970-09-22   1 ( 0.2%)   |
  |                                   1971-01-02   1 ( 0.2%)   |
  |                                   1971-06-09   1 ( 0.2%)   |
  |                                   1971-07-23   1 ( 0.2%)   |
  |                                   1971-08-07   1 ( 0.2%)   |
  |                                   1971-10-04   1 ( 0.2%)   |
  |                                   1972-06-25   1 ( 0.2%)   |
  |                                   1972-07-16   1 ( 0.2%)   |
  |                                   1972-07-28   1 ( 0.2%)   |
  |                                   1972-09-02   1 ( 0.2%)   |
  |                                   1972-11-24   1 ( 0.2%)   |
  |                                   1972-12-17   1 ( 0.2%)   |
  |                                   1973-01-22   1 ( 0.2%)   |
  |                                   1973-02-10   1 ( 0.2%)   |
  |                                   1973-05-03   1 ( 0.2%)   |
  |                                   1973-10-18   1 ( 0.2%)   |
  |                                   1973-11-09   1 ( 0.2%)   |
  |                                   1973-11-16   1 ( 0.2%)   |
  |                                   1973-11-20   1 ( 0.2%)   |
  |                                   1974-03-04   1 ( 0.2%)   |
  |                                   1975-03-06   1 ( 0.2%)   |
  |                                   1975-03-16   1 ( 0.2%)   |
  |                                   1975-11-30   1 ( 0.2%)   |
  |                                   1976-01-15   1 ( 0.2%)   |
  |                                   1976-03-06   1 ( 0.2%)   |
  |                                   1976-05-06   1 ( 0.2%)   |
  |                                   1976-08-22   1 ( 0.2%)   |
  |                                   1977-01-02   1 ( 0.2%)   |
  |                                   1977-03-10   1 ( 0.2%)   |
  |                                   1977-06-12   1 ( 0.2%)   |
  |                                   1977-10-05   1 ( 0.2%)   |
  |                                   1977-10-20   1 ( 0.2%)   |
  |                                   1977-11-14   1 ( 0.2%)   |
  |                                   1977-11-18   1 ( 0.2%)   |
  |                                   1978-03-02   1 ( 0.2%)   |
  |                                   1978-05-29   1 ( 0.2%)   |
  |                                   1978-07-30   1 ( 0.2%)   |
  |                                   1978-08-18   1 ( 0.2%)   |
  |                                   1979-02-26   1 ( 0.2%)   |
  |                                   1979-06-17   1 ( 0.2%)   |
  |                                   1979-08-19   1 ( 0.2%)   |
  |                                   1979-09-14   1 ( 0.2%)   |
  |                                   1979-11-19   1 ( 0.2%)   |
  |                                   1980-07-06   1 ( 0.2%)   |
  |                                   1980-10-26   1 ( 0.2%)   |
  |                                   1981-01-17   1 ( 0.2%)   |
  |                                   1981-12-05   1 ( 0.2%)   |
  |                                   1981-12-10   1 ( 0.2%)   |
  |                                   1982-03-20   1 ( 0.2%)   |
  |                                   1982-05-14   1 ( 0.2%)   |
  |                                   1982-12-04   1 ( 0.2%)   |
  |                                   1983-01-14   1 ( 0.2%)   |
  |                                   1983-03-18   1 ( 0.2%)   |
  |                                   1983-05-14   1 ( 0.2%)   |
  |                                   1983-05-26   1 ( 0.2%)   |
  |                                   1983-07-07   1 ( 0.2%)   |
  |                                   1983-07-25   1 ( 0.2%)   |
  |                                   1983-09-29   1 ( 0.2%)   |
  |                                   1983-10-31   1 ( 0.2%)   |
  |                                   1984-03-04   1 ( 0.2%)   |
  |                                   1984-04-30   1 ( 0.2%)   |
  |                                   1985-06-01   1 ( 0.2%)   |
  |                                   1985-10-30   1 ( 0.2%)   |
  |                                   1986-01-10   1 ( 0.2%)   |
  |                                   1986-03-21   1 ( 0.2%)   |
  |                                   1987-03-20   1 ( 0.2%)   |
  |                                   1987-09-18   1 ( 0.2%)   |
  |                                   1987-10-30   1 ( 0.2%)   |
  |                                   1987-12-17   1 ( 0.2%)   |
  |                                   1987-12-20   1 ( 0.2%)   |
  |                                   1988-01-11   1 ( 0.2%)   |
  |                                   1988-01-27   1 ( 0.2%)   |
  |                                   1988-05-06   1 ( 0.2%)   |
  |                                   1989-04-27   1 ( 0.2%)   |
  |                                   1989-08-21   1 ( 0.2%)   |
  |                                   1989-10-07   1 ( 0.2%)   |
  |                                   1989-10-19   1 ( 0.2%)   |
  |                                   1990-03-23   1 ( 0.2%)   |
  |                                   1990-04-09   1 ( 0.2%)   |
  |                                   1990-07-20   1 ( 0.2%)   |
  |                                   1990-11-23   1 ( 0.2%)   |
  |                                   1990-12-07   1 ( 0.2%)   |
  |                                   1990-12-23   1 ( 0.2%)   |
  |                                   1991-01-03   1 ( 0.2%)   |
  |                                   1991-01-24   1 ( 0.2%)   |
  |                                   1991-03-10   1 ( 0.2%)   |
  |                                   1991-06-25   1 ( 0.2%)   |
  |                                   1991-07-08   1 ( 0.2%)   |
  |                                   1991-09-30   1 ( 0.2%)   |
  |                                   1992-01-30   1 ( 0.2%)   |
  |                                   1992-02-02   1 ( 0.2%)   |
  |                                   1992-05-17   1 ( 0.2%)   |
  |                                   1992-10-03   1 ( 0.2%)   |
  |                                   1993-04-09   1 ( 0.2%)   |
  |                                   1993-09-05   1 ( 0.2%)   |
  |                                   1994-04-29   1 ( 0.2%)   |
  |                                   1994-06-10   1 ( 0.2%)   |
  |                                   1994-12-17   1 ( 0.2%)   |
  |                                   1995-07-28   1 ( 0.2%)   |
  |                                   1995-09-03   1 ( 0.2%)   |
  |                                   1995-10-30   1 ( 0.2%)   |
  |                                   1995-12-31   1 ( 0.2%)   |
  |                                   1996-04-27   1 ( 0.2%)   |
  |                                   1996-06-14   1 ( 0.2%)   |
  |                                   1996-07-30   1 ( 0.2%)   |
  |                                   1996-10-08   1 ( 0.2%)   |
  |                                   1996-11-19   1 ( 0.2%)   |
  |                                   1996-12-20   1 ( 0.2%)   |
  |                                   1997-06-01   1 ( 0.2%)   |
  |                                   1997-08-03   1 ( 0.2%)   |
  |                                   1998-04-04   1 ( 0.2%)   |
  |                                   1998-04-29   1 ( 0.2%)   |
  |                                   1998-06-18   1 ( 0.2%)   |
  |                                   1998-11-12   1 ( 0.2%)   |
  |                                   1998-12-27   1 ( 0.2%)   |
  |                                   1999-04-19   1 ( 0.2%)   |
  |                                   1999-06-25   1 ( 0.2%)   |
  |                                   2000-02-17   1 ( 0.2%)   |
  |                                   2000-08-26   1 ( 0.2%)   |
  |                                   2000-11-23   1 ( 0.2%)   |
  |                                   2000-12-15   1 ( 0.2%)   |
  |                                   2001-03-06   1 ( 0.2%)   |
  |                                   2001-03-13   1 ( 0.2%)   |
  |                                   2001-04-11   1 ( 0.2%)   |
  |                                   2001-06-16   1 ( 0.2%)   |
  |                                   2001-09-18   1 ( 0.2%)   |
  |                                   2001-09-23   1 ( 0.2%)   |
  |                                   2001-09-26   1 ( 0.2%)   |
  |                                   2002-02-28   1 ( 0.2%)   |
  |                                   2002-10-17   1 ( 0.2%)   |
  |                                   2003-03-17   1 ( 0.2%)   |
  |                                   2003-04-12   1 ( 0.2%)   |
  |                                   2003-08-26   1 ( 0.2%)   |
  |                                   2004-01-16   1 ( 0.2%)   |
  |                                   2004-04-04   1 ( 0.2%)   |
  |                                   2004-04-21   1 ( 0.2%)   |
  |                                   2004-09-22   1 ( 0.2%)   |
  |                                   2005-01-02   1 ( 0.2%)   |
  |                                   2005-10-24   1 ( 0.2%)   |
  |                                   2006-02-06   1 ( 0.2%)   |
  |                                   2006-02-16   1 ( 0.2%)   |
  |                                   2006-03-26   1 ( 0.2%)   |
  |                                   2006-03-28   1 ( 0.2%)   |
  |                                   2006-04-18   1 ( 0.2%)   |
  |                                   2006-11-14   1 ( 0.2%)   |
  |                                   2006-11-27   1 ( 0.2%)   |
  |                                   2007-03-03   1 ( 0.2%)   |
  |                                   2007-03-07   1 ( 0.2%)   |
  |                                   2007-07-04   1 ( 0.2%)   |
  |                                   2007-07-06   1 ( 0.2%)   |
  |                                   2007-10-24   1 ( 0.2%)   |
  |                                   2008-02-19   1 ( 0.2%)   |
  |                                   2008-07-08   1 ( 0.2%)   |
  |                                   2009-01-04   1 ( 0.2%)   |
  |                                   2009-03-01   1 ( 0.2%)   |
  |                                   2009-07-25   1 ( 0.2%)   |
  |                                   2010-03-30   1 ( 0.2%)   |
  |                                   2010-04-03   1 ( 0.2%)   |
  |                                   2010-04-10   1 ( 0.2%)   |
  |                                   2010-06-20   1 ( 0.2%)   |
  |                                   2010-06-28   1 ( 0.2%)   |
  |                                   2010-12-01   1 ( 0.2%)   |
  |                                   2011-05-17   1 ( 0.2%)   |
  |                                   2011-08-10   1 ( 0.2%)   |
  |                                   2011-09-10   1 ( 0.2%)   |
  |                                   2011-11-04   1 ( 0.2%)   |
  |                                   2011-12-22   1 ( 0.2%)   |
  |                                   2012-02-10   1 ( 0.2%)   |
  |                                   2012-05-12   1 ( 0.2%)   |
  |                                   2012-06-11   1 ( 0.2%)   |
  |                                   2012-11-18   1 ( 0.2%)   |
  |                                   2013-02-11   1 ( 0.2%)   |
  |                                   2013-04-06   1 ( 0.2%)   |
  |                                   2013-10-18   1 ( 0.2%)   |
  |                                   2013-12-13   1 ( 0.2%)   |
  |                                   2013-12-16   1 ( 0.2%)   |
  |                                   2014-04-07   1 ( 0.2%)   |
  |                                   2014-06-16   1 ( 0.2%)   |
  |                                   2014-06-27   1 ( 0.2%)   |
  |                                   2014-10-26   1 ( 0.2%)   |
  |                                   2015-02-09   1 ( 0.2%)   |
  |                                   2015-03-11   1 ( 0.2%)   |
  |                                   2015-08-30   1 ( 0.2%)   |
  |                                   2016-02-05   1 ( 0.2%)   |
  |                                   2016-02-06   1 ( 0.2%)   |
  |                                   2016-02-26   1 ( 0.2%)   |
  |                                   2016-03-01   1 ( 0.2%)   |
  |                                   2016-07-05   1 ( 0.2%)   |
  |                                   2016-07-15   1 ( 0.2%)   |
  |                                   2016-07-22   1 ( 0.2%)   |
  |                                   2016-11-07   1 ( 0.2%)   |
  |                                   2017-07-20   1 ( 0.2%)   |
  |                                   2017-08-26   1 ( 0.2%)   |
  |                                   2017-09-03   1 ( 0.2%)   |
  |                                   2017-10-03   1 ( 0.2%)   |
  |                                   2017-11-24   1 ( 0.2%)   |
  |                                   2017-12-20   1 ( 0.2%)   |
  |                                   2019-03-19   1 ( 0.2%)   |
  |                                   2020-02-05   1 ( 0.2%)   |
  |                                   2022-05-26   1 ( 0.2%)   |
  |                                   2022-08-31   1 ( 0.2%)   |
  |                                   2022-09-27   1 ( 0.2%)   |
  |                                   2022-10-25   1 ( 0.2%)   |
  |                                   2023-01-12   1 ( 0.2%)   |
  |                                   2023-01-14   1 ( 0.2%)   |
  |                                   2023-01-17   2 ( 0.4%)   |
  |                                   2023-01-24   1 ( 0.2%)   |
  |                                   2023-02-02   1 ( 0.2%)   |
  |                                   2023-02-12   1 ( 0.2%)   |
  |                                   2023-02-26   1 ( 0.2%)   |
  |                                   2023-02-27   1 ( 0.2%)   |
  |                                   2023-02-28   1 ( 0.2%)   |
  |                                   2023-03-01   1 ( 0.2%)   |
  |                                   2023-03-02   1 ( 0.2%)   |
  |                                   2023-03-09   1 ( 0.2%)   |
  |                                   2023-03-15   1 ( 0.2%)   |
  |                                   2023-03-20   1 ( 0.2%)   |
  |                                   2023-04-04   1 ( 0.2%)   |
  |                                   2023-04-10   2 ( 0.4%)   |
  |                                   2023-04-22   1 ( 0.2%)   |
  |                                   2023-05-14   2 ( 0.4%)   |
  |                                   2023-05-16   2 ( 0.4%)   |
  |                                   2023-05-20   1 ( 0.2%)   |
  |------------------------------------------------------------|
  | rare_neuro_nhsd                   0            5 ( 0.5%)   |
  |                                   1            995 (99.5%) |
  +------------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/high_risk.csv, replace
(note: file ./output/tables/high_risk.csv not found)
file ./output/tables/high_risk.csv saved

. * Rounding numbers in table to nearest 5
. destring _columna_1, gen(n) force
_columna_1: contains nonnumeric characters; n generated as int
(2 missing values generated)

. destring _columnb_1, gen(percent) ignore("-" "%" "(" ")")  force
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent generated as double
(2 missing values generated)

. gen rounded_n = round(n, 5)
(2 missing values generated)

. keep factor level rounded_n percent

. export delimited using ./output/tables/high_risk_rounded.csv
file ./output/tables/high_risk_rounded.csv saved

. restore 

. 
. * Characteristics by any exposure
. preserve 

. table1_mc, vars(age_cat cat \ sex cat \ imd cat \ ethnicity cat \ severe_dise
> ase_bl cat \ smoking_status cat \ bmi_cat cat \ has_pbc bin) by(udca_any) cle
> ar

  +-------------------------------------------+
  | factor              N_0   N_1   m_0   m_1 |
  |-------------------------------------------|
  | age_cat             575   204   171    50 |
  |-------------------------------------------|
  | sex                 746   254     0     0 |
  |-------------------------------------------|
  | imd                 746   254     0     0 |
  |-------------------------------------------|
  | ethnicity           746   254     0     0 |
  |-------------------------------------------|
  | severe_disease_bl   746   254     0     0 |
  |-------------------------------------------|
  | smoking_status      372   128   374   126 |
  |-------------------------------------------|
  | bmi_cat             746   254     0     0 |
  |-------------------------------------------|
  | has_pbc             746   254     0     0 |
  +-------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> +
  |                                      udca_any = 0   udca_any = 1   p-value 
> |
  |----------------------------------------------------------------------------
> |
  |                                      N=746          N=254                  
> |
  |----------------------------------------------------------------------------
> |
  | age_cat             18 - 40 years    196 (34.1%)    66 (32.4%)      0.60   
> |
  |                     41 - 60 years    208 (36.2%)    78 (38.2%)             
> |
  |                     61 - 80 years    126 (21.9%)    49 (24.0%)             
> |
  |                     >80 years        45 ( 7.8%)     11 ( 5.4%)             
> |
  |----------------------------------------------------------------------------
> |
  | sex                 F                368 (49.3%)    144 (56.7%)     0.12   
> |
  |                     M                373 (50.0%)    108 (42.5%)            
> |
  |                     U                5 ( 0.7%)      2 ( 0.8%)              
> |
  |----------------------------------------------------------------------------
> |
  | imd                 1                145 (19.4%)    51 (20.1%)      0.39   
> |
  |                     2                140 (18.8%)    55 (21.7%)             
> |
  |                     3                141 (18.9%)    38 (15.0%)             
> |
  |                     4                162 (21.7%)    47 (18.5%)             
> |
  |                     5                123 (16.5%)    52 (20.5%)             
> |
  |                     6                35 ( 4.7%)     11 ( 4.3%)             
> |
  |----------------------------------------------------------------------------
> |
  | ethnicity           White            113 (15.1%)    35 (13.8%)      0.92   
> |
  |                     Mixed            165 (22.1%)    56 (22.0%)             
> |
  |                     Asian            150 (20.1%)    51 (20.1%)             
> |
  |                     Black            162 (21.7%)    53 (20.9%)             
> |
  |                     Other            129 (17.3%)    46 (18.1%)             
> |
  |                     Unknown          27 ( 3.6%)     13 ( 5.1%)             
> |
  |----------------------------------------------------------------------------
> |
  | severe_disease_bl   0                366 (49.1%)    134 (52.8%)     0.31   
> |
  |                     1                380 (50.9%)    120 (47.2%)            
> |
  |----------------------------------------------------------------------------
> |
  | smoking_status      E                120 (32.3%)    42 (32.8%)      0.63   
> |
  |                     M                35 ( 9.4%)     10 ( 7.8%)             
> |
  |                     N                70 (18.8%)     19 (14.8%)             
> |
  |                     S                147 (39.5%)    57 (44.5%)             
> |
  |----------------------------------------------------------------------------
> |
  | bmi_cat             Missing          152 (20.4%)    47 (18.5%)      0.18   
> |
  |                     Underweight      83 (11.1%)     28 (11.0%)             
> |
  |                     Healthy range    145 (19.4%)    49 (19.3%)             
> |
  |                     Overweight       127 (17.0%)    62 (24.4%)             
> |
  |                     Obese            201 (26.9%)    58 (22.8%)             
> |
  |                     Morbidly obese   38 ( 5.1%)     10 ( 3.9%)             
> |
  |----------------------------------------------------------------------------
> |
  | has_pbc                              378 (50.7%)    122 (48.0%)     0.47   
> |
  +----------------------------------------------------------------------------
> +
Data are presented as n (%).
 

. export delimited using ./output/tables/baseline_table_udca.csv, replace
(note: file ./output/tables/baseline_table_udca.csv not found)
file ./output/tables/baseline_table_udca.csv saved

. * Rounding numbers in table to nearest 5
. destring _columna_1, gen(n1) force
_columna_1: contains nonnumeric characters; n1 generated as int
(2 missing values generated)

. destring _columna_0, gen(n0) force
_columna_0: contains nonnumeric characters; n0 generated as int
(2 missing values generated)

. destring _columnb_1, gen(percent1) ignore("-" "%" "(" ")")  force
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)

. destring _columnb_0, gen(percent0) ignore("-" "%" "(" ")")  force
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)

. gen rounded_n1 = round(n1, 5)
(2 missing values generated)

. gen rounded_n0 = round(n0, 5)
(2 missing values generated)

. keep factor level rounded_n0 percent0 rounded_n1 percent1

. export delimited using ./output/tables/baseline_table_udca_rounded.csv
file ./output/tables/baseline_table_udca_rounded.csv saved

. restore 

. 
. * Additional medications by any exposure
. preserve 

. table1_mc, vars(budesonide_any bin \ fenofibrate_any bin \ gc_any bin \ oca_b
> l bin \ rituximab_bl bin) by(udca_any) clear

  +-----------------------------------------+
  | factor            N_0   N_1   m_0   m_1 |
  |-----------------------------------------|
  | budesonide_any    746   254     0     0 |
  |-----------------------------------------|
  | fenofibrate_any   746   254     0     0 |
  |-----------------------------------------|
  | gc_any            746   254     0     0 |
  |-----------------------------------------|
  | oca_bl            746   254     0     0 |
  |-----------------------------------------|
  | rituximab_bl      746   254     0     0 |
  +-----------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +---------------------------------------------------------+
  |                   udca_any = 0   udca_any = 1   p-value |
  |---------------------------------------------------------|
  |                   N=746          N=254                  |
  |---------------------------------------------------------|
  | budesonide_any    196 (26.3%)    61 (24.0%)      0.48   |
  |---------------------------------------------------------|
  | fenofibrate_any   189 (25.3%)    66 (26.0%)      0.84   |
  |---------------------------------------------------------|
  | gc_any            199 (26.7%)    64 (25.2%)      0.64   |
  |---------------------------------------------------------|
  | oca_bl            376 (50.4%)    124 (48.8%)     0.66   |
  |---------------------------------------------------------|
  | rituximab_bl      370 (49.6%)    130 (51.2%)     0.66   |
  +---------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/additional_meds_udca.csv, replace
(note: file ./output/tables/additional_meds_udca.csv not found)
file ./output/tables/additional_meds_udca.csv saved

. * Rounding numbers in table to nearest 5
. destring _columna_1, gen(n1) force
_columna_1: contains nonnumeric characters; n1 generated as int
(2 missing values generated)

. destring _columna_0, gen(n0) force
_columna_0: contains nonnumeric characters; n0 generated as int
(2 missing values generated)

. destring _columnb_1, gen(percent1) ignore("-" "%" "(" ")")  force
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)

. destring _columnb_0, gen(percent0) ignore("-" "%" "(" ")")  force
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)

. gen rounded_n1 = round(n1, 5)
(2 missing values generated)

. gen rounded_n0 = round(n0, 5)
(2 missing values generated)

. keep factor level rounded_n0 percent0 rounded_n1 percent1
variable level not found
r(111);

end of do-file
r(111);

end of do-file

r(111);


