
. 
. import delimited using ./output/input_pbc.csv, clear
(109 vars, 1,000 obs)

. 
. * Prepare variables for table 
. replace ethnicity=6 if ethnicity==0
(46 real changes made)

. label define eth5                       1 "White"                            
>            ///
>                             2 "Mixed"                           ///          
>                                    
>                             3 "Asian"                                   ///
>                             4 "Black"                                   ///
>                             5 "Other"                                   ///
>                             6 "Unknown"

.                     
. 
. label values ethnicity eth5

. safetab ethnicity, m
10

  ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |        148       14.80       14.80
      Mixed |        227       22.70       37.50
      Asian |        198       19.80       57.30
      Black |        202       20.20       77.50
      Other |        179       17.90       95.40
    Unknown |         46        4.60      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. *(2) IMD
. replace imd=6 if imd==0
(48 real changes made)

. 
. * Create age categories
. egen age_cat = cut(age), at(18, 40, 60, 80, 120) icodes
(216 missing values generated)

. label define age 0 "18 - 40 years" 1 "41 - 60 years" 2 "61 - 80 years" 3 ">80
>  years"

. label values age_cat age

. bys age_cat: sum age

-------------------------------------------------------------------------------
-> age_cat = 18 - 40 years

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        267    28.94757    6.223671         18         39

-------------------------------------------------------------------------------
-> age_cat = 41 - 60 years

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        275    49.73818    5.581888         40         59

-------------------------------------------------------------------------------
-> age_cat = 61 - 80 years

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        190    68.42105    5.316599         60         79

-------------------------------------------------------------------------------
-> age_cat = >80 years

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |         52    85.94231    6.043676         80        109

-------------------------------------------------------------------------------
-> age_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        216    7.800926    5.166277          0         17


. 
. * BMI categories
. * assume BMI's less than 10 are incorrect and set to missing 
. sum bmi, d

                             bmi
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,000
25%      15.4891              0       Sum of Wgt.       1,000

50%     25.43214                      Mean           22.40135
                        Largest       Std. Dev.      13.42107
75%     31.69942       50.25244
90%     37.29521       50.35303       Variance       180.1252
95%     41.18578       51.49513       Skewness      -.4851032
99%     47.01512       53.41359       Kurtosis       2.249944

. replace bmi = . if bmi<10
(215 real changes made, 215 to missing)

. egen bmi_cat = cut(bmi), at(0, 1, 18.5, 24.9, 29.9, 39.9, 100) icodes
(215 missing values generated)

. bys bmi_cat: sum bmi

-------------------------------------------------------------------------------
-> bmi_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |         86    15.44256    2.318497   10.12581   18.46173

-------------------------------------------------------------------------------
-> bmi_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        176     22.0555     1.77011   18.53902   24.89156

-------------------------------------------------------------------------------
-> bmi_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        196     27.4264    1.535379   24.91004   29.87786

-------------------------------------------------------------------------------
-> bmi_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        261    33.74903    2.795805   29.92882   39.85234

-------------------------------------------------------------------------------
-> bmi_cat = 5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |         66    43.64735    3.044821   40.09995   53.41359

-------------------------------------------------------------------------------
-> bmi_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |          0


. * add missing . to zero category
. replace bmi_cat = 0 if bmi_cat==. 
(215 real changes made)

. label define bmi 0 "Missing" 1 "Underweight" 2 "Healthy range" 3 "Overweight"
>  4 "Obese" 5 "Morbidly obese"

. label values bmi_cat bmi

. 
. * Smoking status
. gen smoking = 0 if smoking_status=="N"
(887 missing values generated)

. replace smoking = 1 if smoking_status=="S"
(198 real changes made)

. replace smoking = 2 if smoking_status=="E"
(138 real changes made)

. replace smoking = 3 if smoking==.
(551 real changes made)

. 
. label define smok 1 "Current smoker" 2 "Ex-smoker" 0 "Never smoked" 3 "Unknow
> n"

. label values smoking smok

. 
. replace oral_steroid_drugs_nhsd=. if oral_steroid_drug_nhsd_3m_count < 2 & or
> al_steroid_drug_nhsd_12m_count < 4
(935 real changes made, 935 to missing)

. gen imid_nhsd=max(oral_steroid_drugs_nhsd, immunosuppresant_drugs_nhsd)

. gen rare_neuro_nhsd = max(multiple_sclerosis_nhsd, motor_neurone_disease_nhsd
> , myasthenia_gravis_nhsd, huntingtons_disease_nhsd)

. gen solid_organ_transplant_bin = solid_organ_transplant_nhsd_new!=""

. gen any_high_risk_condition = max(learning_disability_nhsd_snomed, cancer_ope
> nsafely_snomed_new, haematological_disease_nhsd, ///
> ckd_stage_5_nhsd, imid_nhsd, immunosupression_nhsd_new, hiv_aids_nhsd, solid_
> organ_transplant_bin, rare_neuro_nhsd)

. 
. foreach var in udca gc budesonide fenofibrate {
  2.     sum `var'_count_bl, d
  3.     sum `var'_count_fu, d 
  4.     gen `var'_any = (`var'_count_fu>=1 & `var'_count_fu!=.)
  5.     gen `var'_bl = (`var'_count_bl>=1 & `var'_count_bl!=.)
  6.     tab `var'_any, m 
  7.     tab `var'_bl, m
  8. }

                        udca_count_bl
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -1
 5%            0             -1
10%            0             -1       Obs               1,000
25%            0              0       Sum of Wgt.       1,000

50%            0                      Mean               .807
                        Largest       Std. Dev.      1.572967
75%            1              7
90%            3              7       Variance       2.474225
95%            4              7       Skewness       1.889156
99%            6              8       Kurtosis       5.623767

                        udca_count_fu
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -.5             -2
 5%            0             -1
10%            0             -1       Obs               1,000
25%            0             -1       Sum of Wgt.       1,000

50%            0                      Mean                .78
                        Largest       Std. Dev.      1.584333
75%            1              7
90%            3              7       Variance        2.51011
95%            4              8       Skewness       2.023142
99%            6             10       Kurtosis       6.590123

   udca_any |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        743       74.30       74.30
          1 |        257       25.70      100.00
------------+-----------------------------------
      Total |      1,000      100.00

    udca_bl |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        741       74.10       74.10
          1 |        259       25.90      100.00
------------+-----------------------------------
      Total |      1,000      100.00

                         gc_count_bl
-------------------------------------------------------------
      Percentiles      Smallest
 1%           -1             -2
 5%            0             -2
10%            0             -2       Obs               1,000
25%            0             -1       Sum of Wgt.       1,000

50%            0                      Mean                .76
                        Largest       Std. Dev.      1.607166
75%            0              8
90%            3              8       Variance       2.582983
95%            5              8       Skewness       2.111843
99%            6              8       Kurtosis       6.907067

                         gc_count_fu
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -2
 5%            0             -2
10%            0             -1       Obs               1,000
25%            0             -1       Sum of Wgt.       1,000

50%            0                      Mean               .762
                        Largest       Std. Dev.      1.532875
75%            0              7
90%            3              7       Variance       2.349706
95%            4              7       Skewness       1.910101
99%            6              8       Kurtosis       5.744157

     gc_any |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        751       75.10       75.10
          1 |        249       24.90      100.00
------------+-----------------------------------
      Total |      1,000      100.00

      gc_bl |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        753       75.30       75.30
          1 |        247       24.70      100.00
------------+-----------------------------------
      Total |      1,000      100.00

                     budesonide_count_bl
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -.5             -2
 5%            0             -1
10%            0             -1       Obs               1,000
25%            0             -1       Sum of Wgt.       1,000

50%            0                      Mean               .797
                        Largest       Std. Dev.      1.593842
75%            1              7
90%            3              7       Variance       2.540331
95%            5              7       Skewness       1.922146
99%            6              7       Kurtosis       5.825085

                     budesonide_count_fu
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -2
 5%            0             -2
10%            0             -2       Obs               1,000
25%            0             -1       Sum of Wgt.       1,000

50%            0                      Mean                 .8
                        Largest       Std. Dev.      1.618215
75%            1              7
90%            3              7       Variance       2.618619
95%            5              7       Skewness       1.956356
99%            6              9       Kurtosis        6.11747

budesonide_ |
        any |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        749       74.90       74.90
          1 |        251       25.10      100.00
------------+-----------------------------------
      Total |      1,000      100.00

budesonide_ |
         bl |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        741       74.10       74.10
          1 |        259       25.90      100.00
------------+-----------------------------------
      Total |      1,000      100.00

                    fenofibrate_count_bl
-------------------------------------------------------------
      Percentiles      Smallest
 1%           -1             -2
 5%            0             -2
10%            0             -2       Obs               1,000
25%            0             -2       Sum of Wgt.       1,000

50%            0                      Mean               .784
                        Largest       Std. Dev.      1.579823
75%            1              6
90%            3              7       Variance        2.49584
95%          4.5              7       Skewness       1.868334
99%            6              8       Kurtosis       5.670993

                    fenofibrate_count_fu
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -.5             -2
 5%            0             -2
10%            0             -2       Obs               1,000
25%            0             -2       Sum of Wgt.       1,000

50%            0                      Mean               .745
                        Largest       Std. Dev.      1.564104
75%           .5              7
90%            3              7       Variance       2.446421
95%            4              8       Skewness        2.09469
99%            6              9       Kurtosis       6.970441

fenofibrate |
       _any |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        750       75.00       75.00
          1 |        250       25.00      100.00
------------+-----------------------------------
      Total |      1,000      100.00

fenofibrate |
        _bl |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        743       74.30       74.30
          1 |        257       25.70      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. 
. * Generate variable with number of vaccinations 
. foreach var in covid_vacc_first covid_vacc_second covid_vacc_third covid_vacc
> _fourth covid_vacc_fifth {
  2.     gen `var'= (`var'_date!="")    
  3. }

. 
. egen vacc_any = rowmax(covid_vacc_first covid_vacc_second covid_vacc_third co
> vid_vacc_fourth covid_vacc_fifth)

. egen total_vaccs = rowtotal(covid_vacc_first covid_vacc_second covid_vacc_thi
> rd covid_vacc_fourth covid_vacc_fifth)

. tab total_vaccs 

total_vaccs |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         10        1.00        1.00
          1 |         71        7.10        8.10
          2 |        277       27.70       35.80
          3 |        408       40.80       76.60
          4 |        217       21.70       98.30
          5 |         17        1.70      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. 
. gen severe_disease_fu = severe_disease_fu_date!=""

. 
. * Time from most recent vaccination on 1st March 2021
. gen date_most_recent_cov_vacA = date(date_most_recent_cov_vac, "YMD")
(941 missing values generated)

. gen time_vacc = date("01Mar2021", "DMY") - date_most_recent_cov_vacA
(941 missing values generated)

. sum time_vacc, d

                          time_vacc
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            6              1       Obs                  59
25%           21              3       Sum of Wgt.          59

50%           52                      Mean            47.0678
                        Largest       Std. Dev.      26.69681
75%           69             86
90%           83             86       Variance       712.7195
95%           86             88       Skewness      -.3075835
99%           89             89       Kurtosis       1.888884

. xtile time_vacc_cat = time_vacc, nq(4)

. bys time_vacc_cat: sum time_vacc 

-------------------------------------------------------------------------------
-> time_vacc_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   time_vacc |         15    9.933333    7.685484          1         21

-------------------------------------------------------------------------------
-> time_vacc_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   time_vacc |         15        40.4    9.424891         22         52

-------------------------------------------------------------------------------
-> time_vacc_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   time_vacc |         15        61.6    4.532423         54         69

-------------------------------------------------------------------------------
-> time_vacc_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   time_vacc |         14    78.42857    7.292929         71         89

-------------------------------------------------------------------------------
-> time_vacc_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   time_vacc |          0


. 
. * Create tables 
. * Characteristics whole cohort
. preserve

. table1_mc, vars(age_cat cat \ sex cat \ imd cat \ ethnicity cat \ severe_dise
> ase_bl cat \ smoking cat \ bmi_cat cat \ has_pbc bin \ ///
> any_high_risk_condition cat) clear

  +---------------------------------------+
  | factor                      N_1   m_1 |
  |---------------------------------------|
  | age_cat                     784   216 |
  |---------------------------------------|
  | sex                       1,000     0 |
  |---------------------------------------|
  | imd                       1,000     0 |
  |---------------------------------------|
  | ethnicity                 1,000     0 |
  |---------------------------------------|
  | severe_disease_bl         1,000     0 |
  |---------------------------------------|
  | smoking                   1,000     0 |
  |---------------------------------------|
  | bmi_cat                   1,000     0 |
  |---------------------------------------|
  | has_pbc                   1,000     0 |
  |---------------------------------------|
  | any_high_risk_condition   1,000     0 |
  +---------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +-----------------------------------------------------------+
  |                                            Total          |
  |-----------------------------------------------------------|
  |                                            N=1,000        |
  |-----------------------------------------------------------|
  | age_cat                   18 - 40 years    267 (34.1%)    |
  |                           41 - 60 years    275 (35.1%)    |
  |                           61 - 80 years    190 (24.2%)    |
  |                           >80 years        52 ( 6.6%)     |
  |-----------------------------------------------------------|
  | sex                       F                521 (52.1%)    |
  |                           M                471 (47.1%)    |
  |                           U                8 ( 0.8%)      |
  |-----------------------------------------------------------|
  | imd                       1                195 (19.5%)    |
  |                           2                206 (20.6%)    |
  |                           3                173 (17.3%)    |
  |                           4                210 (21.0%)    |
  |                           5                168 (16.8%)    |
  |                           6                48 ( 4.8%)     |
  |-----------------------------------------------------------|
  | ethnicity                 White            148 (14.8%)    |
  |                           Mixed            227 (22.7%)    |
  |                           Asian            198 (19.8%)    |
  |                           Black            202 (20.2%)    |
  |                           Other            179 (17.9%)    |
  |                           Unknown          46 ( 4.6%)     |
  |-----------------------------------------------------------|
  | severe_disease_bl         0                500 (50.0%)    |
  |                           1                500 (50.0%)    |
  |-----------------------------------------------------------|
  | smoking                   Never smoked     113 (11.3%)    |
  |                           Current smoker   198 (19.8%)    |
  |                           Ex-smoker        138 (13.8%)    |
  |                           Unknown          551 (55.1%)    |
  |-----------------------------------------------------------|
  | bmi_cat                   Missing          215 (21.5%)    |
  |                           Underweight      86 ( 8.6%)     |
  |                           Healthy range    176 (17.6%)    |
  |                           Overweight       196 (19.6%)    |
  |                           Obese            261 (26.1%)    |
  |                           Morbidly obese   66 ( 6.6%)     |
  |-----------------------------------------------------------|
  | has_pbc                                    500 (50.0%)    |
  |-----------------------------------------------------------|
  | any_high_risk_condition   1                1,000 (100.0%) |
  +-----------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/baseline_table.csv, replace
(note: file ./output/tables/baseline_table.csv not found)
file ./output/tables/baseline_table.csv saved

. * Rounding numbers in table to nearest 5
. destring _columna_1, gen(n) ignore(",") force
_columna_1: contains nonnumeric characters not specified in ignore()
_columna_1: character , removed; n generated as int
(2 missing values generated)

. destring _columnb_1, gen(percent) ignore("-" "%" "(" ")")  force
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent generated as double
(2 missing values generated)

. gen rounded_n = round(n, 5)
(2 missing values generated)

. tostring rounded_n, gen(n_rounded)
n_rounded generated as str4

. replace n_rounded = "redacted" if (rounded_n<=5)
(0 real changes made)

. keep factor level n_rounded percent

. export delimited using ./output/tables/baseline_table_rounded.csv
file ./output/tables/baseline_table_rounded.csv saved

. restore 

. 
. * High risk conditions
. preserve

. table1_mc, vars(learning_disability_nhsd_snomed cat \ cancer_opensafely_snome
> d_new cat \ haematological_disease_nhsd cat \ ///
> ckd_stage_5_nhsd cat \ imid_nhsd cat \ immunosupression_nhsd_new cat \ hiv_ai
> ds_nhsd cat \ solid_organ_transplant_bin cat \  ///
> rare_neuro_nhsd cat) clear

  +-----------------------------------------------+
  | factor                              N_1   m_1 |
  |-----------------------------------------------|
  | learning_disability_nhsd_snomed   1,000     0 |
  |-----------------------------------------------|
  | cancer_opensafely_snomed_new      1,000     0 |
  |-----------------------------------------------|
  | haematological_disease_nhsd       1,000     0 |
  |-----------------------------------------------|
  | ckd_stage_5_nhsd                  1,000     0 |
  |-----------------------------------------------|
  | imid_nhsd                         1,000     0 |
  |-----------------------------------------------|
  | immunosupression_nhsd_new         1,000     0 |
  |-----------------------------------------------|
  | hiv_aids_nhsd                     1,000     0 |
  |-----------------------------------------------|
  | solid_organ_transplant_bin        1,000     0 |
  |-----------------------------------------------|
  | rare_neuro_nhsd                   1,000     0 |
  +-----------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +-------------------------------------------------------+
  |                                           Total       |
  |-------------------------------------------------------|
  |                                           N=1,000     |
  |-------------------------------------------------------|
  | learning_disability_nhsd_snomed   0       500 (50.0%) |
  |                                   1       500 (50.0%) |
  |-------------------------------------------------------|
  | cancer_opensafely_snomed_new      0       500 (50.0%) |
  |                                   1       500 (50.0%) |
  |-------------------------------------------------------|
  | haematological_disease_nhsd       0       15 ( 1.5%)  |
  |                                   1       985 (98.5%) |
  |-------------------------------------------------------|
  | ckd_stage_5_nhsd                  0       247 (24.7%) |
  |                                   1       753 (75.3%) |
  |-------------------------------------------------------|
  | imid_nhsd                         0       487 (48.7%) |
  |                                   1       513 (51.3%) |
  |-------------------------------------------------------|
  | immunosupression_nhsd_new         0       500 (50.0%) |
  |                                   1       500 (50.0%) |
  |-------------------------------------------------------|
  | hiv_aids_nhsd                     0       749 (74.9%) |
  |                                   1       251 (25.1%) |
  |-------------------------------------------------------|
  | solid_organ_transplant_bin        0       493 (49.3%) |
  |                                   1       507 (50.7%) |
  |-------------------------------------------------------|
  | rare_neuro_nhsd                   0       6 ( 0.6%)   |
  |                                   1       994 (99.4%) |
  +-------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/high_risk.csv, replace
(note: file ./output/tables/high_risk.csv not found)
file ./output/tables/high_risk.csv saved

. * Rounding numbers in table to nearest 5
. destring _columna_1, gen(n) ignore(",") force
_columna_1: contains nonnumeric characters not specified in ignore(); n generat
> ed as int
(2 missing values generated)

. destring _columnb_1, gen(percent) ignore("-" "%" "(" ")")  force
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent generated as double
(2 missing values generated)

. gen rounded_n = round(n, 5)
(2 missing values generated)

. tostring rounded_n, gen(n_rounded)
n_rounded generated as str3

. replace n_rounded = "redacted" if (rounded_n<=5)
variable n_rounded was str3 now str8
(1 real change made)

. keep factor level n_rounded percent

. export delimited using ./output/tables/high_risk_rounded.csv
file ./output/tables/high_risk_rounded.csv saved

. restore 

. 
. * Characteristics by exposure status at baseline 
. preserve 

. table1_mc, vars(age_cat cat \ sex cat \ imd cat \ ethnicity cat \ severe_dise
> ase_bl cat \ smoking cat \ bmi_cat cat \ has_pbc bin \ any_high_risk_conditio
> n cat) by(udca_bl) clear

  +-------------------------------------------------+
  | factor                    N_0   N_1   m_0   m_1 |
  |-------------------------------------------------|
  | age_cat                   586   198   155    61 |
  |-------------------------------------------------|
  | sex                       741   259     0     0 |
  |-------------------------------------------------|
  | imd                       741   259     0     0 |
  |-------------------------------------------------|
  | ethnicity                 741   259     0     0 |
  |-------------------------------------------------|
  | severe_disease_bl         741   259     0     0 |
  |-------------------------------------------------|
  | smoking                   741   259     0     0 |
  |-------------------------------------------------|
  | bmi_cat                   741   259     0     0 |
  |-------------------------------------------------|
  | has_pbc                   741   259     0     0 |
  |-------------------------------------------------|
  | any_high_risk_condition   741   259     0     0 |
  +-------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> ------+
  |                                            udca_bl = 0    udca_bl = 1    p-
> value |
  |----------------------------------------------------------------------------
> ------|
  |                                            N=741          N=259            
>       |
  |----------------------------------------------------------------------------
> ------|
  | age_cat                   18 - 40 years    204 (34.8%)    63 (31.8%)      0
> .67   |
  |                           41 - 60 years    199 (34.0%)    76 (38.4%)       
>       |
  |                           61 - 80 years    145 (24.7%)    45 (22.7%)       
>       |
  |                           >80 years        38 ( 6.5%)     14 ( 7.1%)       
>       |
  |----------------------------------------------------------------------------
> ------|
  | sex                       F                388 (52.4%)    133 (51.4%)     0
> .96   |
  |                           M                347 (46.8%)    124 (47.9%)      
>       |
  |                           U                6 ( 0.8%)      2 ( 0.8%)        
>       |
  |----------------------------------------------------------------------------
> ------|
  | imd                       1                154 (20.8%)    41 (15.8%)      0
> .075  |
  |                           2                149 (20.1%)    57 (22.0%)       
>       |
  |                           3                133 (17.9%)    40 (15.4%)       
>       |
  |                           4                144 (19.4%)    66 (25.5%)       
>       |
  |                           5                130 (17.5%)    38 (14.7%)       
>       |
  |                           6                31 ( 4.2%)     17 ( 6.6%)       
>       |
  |----------------------------------------------------------------------------
> ------|
  | ethnicity                 White            111 (15.0%)    37 (14.3%)      0
> .12   |
  |                           Mixed            172 (23.2%)    55 (21.2%)       
>       |
  |                           Asian            135 (18.2%)    63 (24.3%)       
>       |
  |                           Black            162 (21.9%)    40 (15.4%)       
>       |
  |                           Other            127 (17.1%)    52 (20.1%)       
>       |
  |                           Unknown          34 ( 4.6%)     12 ( 4.6%)       
>       |
  |----------------------------------------------------------------------------
> ------|
  | severe_disease_bl         0                371 (50.1%)    129 (49.8%)     0
> .94   |
  |                           1                370 (49.9%)    130 (50.2%)      
>       |
  |----------------------------------------------------------------------------
> ------|
  | smoking                   Never smoked     86 (11.6%)     27 (10.4%)      0
> .27   |
  |                           Current smoker   156 (21.1%)    42 (16.2%)       
>       |
  |                           Ex-smoker        103 (13.9%)    35 (13.5%)       
>       |
  |                           Unknown          396 (53.4%)    155 (59.8%)      
>       |
  |----------------------------------------------------------------------------
> ------|
  | bmi_cat                   Missing          162 (21.9%)    53 (20.5%)      0
> .82   |
  |                           Underweight      63 ( 8.5%)     23 ( 8.9%)       
>       |
  |                           Healthy range    130 (17.5%)    46 (17.8%)       
>       |
  |                           Overweight       138 (18.6%)    58 (22.4%)       
>       |
  |                           Obese            197 (26.6%)    64 (24.7%)       
>       |
  |                           Morbidly obese   51 ( 6.9%)     15 ( 5.8%)       
>       |
  |----------------------------------------------------------------------------
> ------|
  | has_pbc                                    385 (52.0%)    115 (44.4%)     0
> .036  |
  |----------------------------------------------------------------------------
> ------|
  | any_high_risk_condition   1                741 (100.0%)   259 (100.0%)     
>       |
  +----------------------------------------------------------------------------
> ------+
Data are presented as n (%).
 

. export delimited using ./output/tables/baseline_table_udca.csv, replace
(note: file ./output/tables/baseline_table_udca.csv not found)
file ./output/tables/baseline_table_udca.csv saved

. * Rounding numbers in table to nearest 5
. forvalues i=0/1 {   
  2.     destring _columna_`i', gen(n`i') ignore(",") force
  3.     destring _columnb_`i', gen(percent`i') ignore("-" "%" "(" ")")  force
  4.     gen rounded_n`i' = round(n`i', 5)
  5.     tostring percent`i', gen(percent_`i')
  6.     tostring rounded_n`i', gen(n`i'_rounded)
  7.     replace n`i'_rounded = "redacted" if (rounded_n`i'<=5)
  8.     replace percent_`i' = "redacted" if (rounded_n`i'<=5)
  9. }
_columna_0: contains nonnumeric characters not specified in ignore(); n0 genera
> ted as int
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
(2 missing values generated)
percent_0 generated as str4
n0_rounded generated as str3
variable n0_rounded was str3 now str8
(1 real change made)
variable percent_0 was str4 now str8
(1 real change made)
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as int
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)
(2 missing values generated)
percent_1 generated as str4
n1_rounded generated as str3
variable n1_rounded was str3 now str8
(1 real change made)
variable percent_1 was str4 now str8
(1 real change made)

. keep factor level n0_rounded percent_0 n1_rounded percent_1

. export delimited using ./output/tables/baseline_table_udca_rounded.csv
file ./output/tables/baseline_table_udca_rounded.csv saved

. restore 

. 
. * Additional medications by any exposure
. preserve 

. table1_mc, vars(budesonide_bl bin \ fenofibrate_bl bin \ gc_bl bin \ oca_bl b
> in \ rituximab_bl bin \ severe_disease_fu bin \ vacc_any bin  \ total_vaccs c
> at \ time_vacc_cat cat) by(udca_bl) clear

  +--------------------------------------------------+
  | factor                     N_0   N_1   m_0   m_1 |
  |--------------------------------------------------|
  | budesonide_bl              741   259     0     0 |
  |--------------------------------------------------|
  | fenofibrate_bl             741   259     0     0 |
  |--------------------------------------------------|
  | gc_bl                      741   259     0     0 |
  |--------------------------------------------------|
  | oca_bl                     741   259     0     0 |
  |--------------------------------------------------|
  | rituximab_bl               741   259     0     0 |
  |--------------------------------------------------|
  | severe_disease_fu          741   259     0     0 |
  |--------------------------------------------------|
  | vacc_any                   741   259     0     0 |
  |--------------------------------------------------|
  | total_vaccs                741   259     0     0 |
  |--------------------------------------------------|
  | 4 quantiles of time_vacc    45    14   696   245 |
  +--------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +------------------------------------------------------------------------+
  |                                    udca_bl = 0   udca_bl = 1   p-value |
  |------------------------------------------------------------------------|
  |                                    N=741         N=259                 |
  |------------------------------------------------------------------------|
  | budesonide_bl                      200 (27.0%)   59 (22.8%)     0.18   |
  |------------------------------------------------------------------------|
  | fenofibrate_bl                     193 (26.0%)   64 (24.7%)     0.67   |
  |------------------------------------------------------------------------|
  | gc_bl                              173 (23.3%)   74 (28.6%)     0.093  |
  |------------------------------------------------------------------------|
  | oca_bl                             367 (49.5%)   133 (51.4%)    0.61   |
  |------------------------------------------------------------------------|
  | rituximab_bl                       369 (49.8%)   131 (50.6%)    0.83   |
  |------------------------------------------------------------------------|
  | severe_disease_fu                  559 (75.4%)   199 (76.8%)    0.65   |
  |------------------------------------------------------------------------|
  | vacc_any                           732 (98.8%)   258 (99.6%)    0.25   |
  |------------------------------------------------------------------------|
  | total_vaccs                0       9 ( 1.2%)     1 ( 0.4%)      0.082  |
  |                            1       56 ( 7.6%)    15 ( 5.8%)            |
  |                            2       216 (29.1%)   61 (23.6%)            |
  |                            3       297 (40.1%)   111 (42.9%)           |
  |                            4       154 (20.8%)   63 (24.3%)            |
  |                            5       9 ( 1.2%)     8 ( 3.1%)             |
  |------------------------------------------------------------------------|
  | 4 quantiles of time_vacc   1       13 (29%)      2 (14%)        0.58   |
  |                            2       10 (22%)      5 (36%)               |
  |                            3       12 (27%)      3 (21%)               |
  |                            4       10 (22%)      4 (29%)               |
  +------------------------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/additional_meds_udca.csv, replace
(note: file ./output/tables/additional_meds_udca.csv not found)
file ./output/tables/additional_meds_udca.csv saved

. * Rounding numbers in table to nearest 5
. forvalues i=0/1 {   
  2.     destring _columna_`i', gen(n`i') ignore(",") force
  3.     destring _columnb_`i', gen(percent`i') ignore("-" "%" "(" ")")  force
  4.     gen rounded_n`i' = round(n`i', 5)
  5.     tostring rounded_n`i', gen(n`i'_rounded)
  6.     tostring percent`i', gen(percent_`i')
  7.     replace n`i'_rounded = "redacted" if (rounded_n`i'<=5)
  8.     replace percent_`i' = "redacted" if (rounded_n`i'<=5)
  9. }
_columna_0: contains nonnumeric characters not specified in ignore(); n0 genera
> ted as int
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
(2 missing values generated)
n0_rounded generated as str3
percent_0 generated as str4
(0 real changes made)
(0 real changes made)
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as int
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)
(2 missing values generated)
n1_rounded generated as str3
percent_1 generated as str4
variable n1_rounded was str3 now str8
(5 real changes made)
variable percent_1 was str4 now str8
(5 real changes made)

. keep factor n0_rounded percent_0 n1_rounded percent_1

. export delimited using ./output/tables/additional_meds_udca_rounded.csv
file ./output/tables/additional_meds_udca_rounded.csv saved

. restore 

. 
. * Checking outcomes 
. foreach var in died_date_ons hosp_covid_primary hosp_covid_any dereg_date liv
> er_transplant_fu_date {
  2.     gen `var'A = date(`var', "YMD")
  3.     format `var'A %dD/N/CY
  4.     drop `var'
  5.     gen yr_`var' = year(`var'A)
  6.     tab yr_`var'
  7.     replace `var'A=. if yr_`var'==2023
  8. }
(500 missing values generated)
(500 missing values generated)

yr_died_dat |
      e_ons |      Freq.     Percent        Cum.
------------+-----------------------------------
       2020 |        129       25.80       25.80
       2021 |        144       28.80       54.60
       2022 |        136       27.20       81.80
       2023 |         91       18.20      100.00
------------+-----------------------------------
      Total |        500      100.00
(91 real changes made, 91 to missing)
(900 missing values generated)
(900 missing values generated)

yr_hosp_cov |
 id_primary |      Freq.     Percent        Cum.
------------+-----------------------------------
       2020 |         30       30.00       30.00
       2021 |         25       25.00       55.00
       2022 |         23       23.00       78.00
       2023 |         22       22.00      100.00
------------+-----------------------------------
      Total |        100      100.00
(22 real changes made, 22 to missing)
(900 missing values generated)
(900 missing values generated)

yr_hosp_cov |
     id_any |      Freq.     Percent        Cum.
------------+-----------------------------------
       2020 |         22       22.00       22.00
       2021 |         32       32.00       54.00
       2022 |         28       28.00       82.00
       2023 |         18       18.00      100.00
------------+-----------------------------------
      Total |        100      100.00
(18 real changes made, 18 to missing)
(500 missing values generated)
(500 missing values generated)

yr_dereg_da |
         te |      Freq.     Percent        Cum.
------------+-----------------------------------
       2020 |        134       26.80       26.80
       2021 |        141       28.20       55.00
       2022 |        136       27.20       82.20
       2023 |         89       17.80      100.00
------------+-----------------------------------
      Total |        500      100.00
(89 real changes made, 89 to missing)
(977 missing values generated)
(977 missing values generated)

yr_liver_tr |
ansplant_fu |
      _date |      Freq.     Percent        Cum.
------------+-----------------------------------
       2020 |          6       26.09       26.09
       2021 |          3       13.04       39.13
       2022 |          9       39.13       78.26
       2023 |          5       21.74      100.00
------------+-----------------------------------
      Total |         23      100.00
(5 real changes made, 5 to missing)

. gen end_study = date("31/12/2022", "DMY")

. egen end_date = rowmin(dereg_dateA end_study died_date_onsA)

. replace died_date_onsA=. if end_date<died_date_onsA
(65 real changes made, 65 to missing)

. replace died_ons_covid_flag_any=0 if end_date<died_date_onsA & died_ons_covid
> _flag_any==1
(332 real changes made)

. replace hosp_covid_anyA=. if end_date<hosp_covid_anyA
(38 real changes made, 38 to missing)

. 
. 
. * Flag if died
. gen died_flag = died_date_onsA!=.

. * Generate date if died of covid
. gen died_date_ons_covid = died_date_onsA if died_ons_covid_flag_any == 1
(832 missing values generated)

. 
. * Flag hospitalised with covid 
. gen hosp_any_flag = hosp_covid_anyA!=.

. 
. * Composite outcome 
. gen hosp_died = (died_ons_covid_flag_any==1 | hosp_any_flag==1)

. tab hosp_died

  hosp_died |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        796       79.60       79.60
          1 |        204       20.40      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. egen hosp_died_dateA = rowmin(died_date_onsA hosp_covid_anyA)
(625 missing values generated)

. replace hosp_died_dateA=. if hosp_died==0
(171 real changes made, 171 to missing)

. sum hosp_died_dateA

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hosp_died_~A |        204    22422.65    283.5597      21976      22995

. * Generate flag of how met composite outcome 
. di "Number where died before hospitalisation date - should be zero"
Number where died before hospitalisation date - should be zero

. count if died_date_onsA<hosp_covid_anyA & hosp_covid_anyA!=.
  0

. di "Number where have both hospitalisation and death date" 
Number where have both hospitalisation and death date

. count if died_date_onsA!=. & hosp_covid_anyA!=.
  13

. 
. gen composite_make_up = hosp_died 

. replace composite_make_up = 2 if died_ons_covid_flag_any==1 & hosp_any_flag==
> 0
(160 real changes made)

. label define comp 0 "No outcome" 1 "Hospitalised" 2 "Died"

. label values composite_make_up comp 

. * Check 
. count if composite_make_up==1 & hosp_covid_anyA==. 
  0

. count if composite_make_up==1 & hosp_died_dateA!=hosp_covid_anyA
  0

. count if composite_make_up==2 & died_date_onsA==. 
  0

. count if composite_make_up==2 & hosp_died_dateA!=died_date_onsA
  0

. tab composite_make_up died_ons_covid_flag_any

             | died_ons_covid_flag_a
composite_ma |          ny
       ke_up |         0          1 |     Total
-------------+----------------------+----------
  No outcome |       796          0 |       796 
Hospitalised |        36          8 |        44 
        Died |         0        160 |       160 
-------------+----------------------+----------
       Total |       832        168 |     1,000 

. tab composite_make_up hosp_any_flag

composite_ma |     hosp_any_flag
       ke_up |         0          1 |     Total
-------------+----------------------+----------
  No outcome |       796          0 |       796 
Hospitalised |         0         44 |        44 
        Died |       160          0 |       160 
-------------+----------------------+----------
       Total |       956         44 |     1,000 

. tab udca_bl died_ons_covid_flag_any

           | died_ons_covid_flag_a
           |          ny
   udca_bl |         0          1 |     Total
-----------+----------------------+----------
         0 |       615        126 |       741 
         1 |       217         42 |       259 
-----------+----------------------+----------
     Total |       832        168 |     1,000 

. tab udca_bl hosp_any_flag

           |     hosp_any_flag
   udca_bl |         0          1 |     Total
-----------+----------------------+----------
         0 |       709         32 |       741 
         1 |       247         12 |       259 
-----------+----------------------+----------
     Total |       956         44 |     1,000 

. 
. * check number of outcomes per ethnicity group 
. tab ethnicity died_ons_covid_flag_any

           | died_ons_covid_flag_a
           |          ny
 ethnicity |         0          1 |     Total
-----------+----------------------+----------
     White |       123         25 |       148 
     Mixed |       192         35 |       227 
     Asian |       167         31 |       198 
     Black |       169         33 |       202 
     Other |       145         34 |       179 
   Unknown |        36         10 |        46 
-----------+----------------------+----------
     Total |       832        168 |     1,000 

. tab ethnicity hosp_any_flag

           |     hosp_any_flag
 ethnicity |         0          1 |     Total
-----------+----------------------+----------
     White |       142          6 |       148 
     Mixed |       217         10 |       227 
     Asian |       191          7 |       198 
     Black |       195          7 |       202 
     Other |       168         11 |       179 
   Unknown |        43          3 |        46 
-----------+----------------------+----------
     Total |       956         44 |     1,000 

. 
. * Number of outcomes within each time period: pre-vaccination of most populat
> ion - prior to 1st March 2021 and after
. 
. gen composite_pre = hosp_died_dateA < date("01Mar2021", "DMY")

. replace composite_pre = 0 if hosp_died_dateA==. 
(0 real changes made)

. tab hosp_died composite_pre 

           |     composite_pre
 hosp_died |         0          1 |     Total
-----------+----------------------+----------
         0 |       796          0 |       796 
         1 |       115         89 |       204 
-----------+----------------------+----------
     Total |       911         89 |     1,000 

. 
. gen died_pre = died_date_onsA < date("01Mar2021", "DMY")

. replace died_pre = . if died_date_onsA==. | died_ons_covid_flag_any==0
(832 real changes made, 832 to missing)

. tab died_ons_covid_flag_any died_pre 

died_ons_c |
ovid_flag_ |       died_pre
       any |         0          1 |     Total
-----------+----------------------+----------
         1 |       101         67 |       168 
-----------+----------------------+----------
     Total |       101         67 |       168 

. 
. gen hosp_pre = hosp_covid_anyA < date("01Mar2021", "DMY")

. replace hosp_pre = . if hosp_covid_anyA==.
(956 real changes made, 956 to missing)

. tab hosp_any_flag hosp_pre 

hosp_any_f |       hosp_pre
       lag |         0          1 |     Total
-----------+----------------------+----------
         1 |        21         23 |        44 
-----------+----------------------+----------
     Total |        21         23 |        44 

. 
. gen composite_post = hosp_died_dateA >= date("01Mar2021", "DMY") & hosp_died_
> dateA!=.

. replace composite_post = 0 if hosp_died_dateA==.
(0 real changes made)

. tab hosp_died composite_post 

           |    composite_post
 hosp_died |         0          1 |     Total
-----------+----------------------+----------
         0 |       796          0 |       796 
         1 |        89        115 |       204 
-----------+----------------------+----------
     Total |       885        115 |     1,000 

. 
. gen died_post = died_date_onsA >= date("01Mar2021", "DMY") & died_date_onsA!=
> .

. replace died_post = . if died_date_onsA==. | died_ons_covid_flag_any==0
(832 real changes made, 832 to missing)

. tab died_ons_covid_flag_any died_post 

died_ons_c |
ovid_flag_ |       died_post
       any |         0          1 |     Total
-----------+----------------------+----------
         1 |        67        101 |       168 
-----------+----------------------+----------
     Total |        67        101 |       168 

. 
. gen hosp_post = hosp_covid_anyA >= date("01Mar2021", "DMY") & hosp_covid_anyA
> !=.

. replace hosp_post = . if hosp_covid_anyA==.
(956 real changes made, 956 to missing)

. tab hosp_any_flag hosp_post

hosp_any_f |       hosp_post
       lag |         0          1 |     Total
-----------+----------------------+----------
         1 |        23         21 |        44 
-----------+----------------------+----------
     Total |        23         21 |        44 

. 
. * Exploring death by liver disease 
. gen died_liver_any = died_ons_liver_flag_any==1 & died_ons_covid_flag_any!=1

. gen died_liver_underlying = died_ons_liver_flag_underlying==1 & died_ons_covi
> d_flag_any!=1

. 
. * Exploring liver transplants during follow-update
. gen liver_transplant_fu = liver_transplant_fu_dateA!=.

. 
. * Check 
. count if died_liver_any==1 & died_ons_covid_flag_any==1
  0

. count if died_liver_underlying==1 & died_ons_covid_flag_any==1
  0

. 
. * Outcomes by baseline exposure stataus
. preserve

. table1_mc, by(udca_bl) vars(died_ons_covid_flag_any bin \ hosp_any_flag bin \
>  hosp_died bin \ composite_make_up cat \ composite_pre bin \ ///
> died_pre bin \ hosp_pre bin \ composite_post bin \ died_post bin \ hosp_post 
> bin \ died_liver_any bin \ died_liver_underlying bin \ liver_transplant_fu bi
> n) clear

  +-------------------------------------------------+
  | factor                    N_0   N_1   m_0   m_1 |
  |-------------------------------------------------|
  | died_ons_covid_flag_any   741   259     0     0 |
  |-------------------------------------------------|
  | hosp_any_flag             741   259     0     0 |
  |-------------------------------------------------|
  | hosp_died                 741   259     0     0 |
  |-------------------------------------------------|
  | composite_make_up         741   259     0     0 |
  |-------------------------------------------------|
  | composite_pre             741   259     0     0 |
  |-------------------------------------------------|
  | died_pre                  126    42   615   217 |
  |-------------------------------------------------|
  | hosp_pre                   32    12   709   247 |
  |-------------------------------------------------|
  | composite_post            741   259     0     0 |
  |-------------------------------------------------|
  | died_post                 126    42   615   217 |
  |-------------------------------------------------|
  | hosp_post                  32    12   709   247 |
  |-------------------------------------------------|
  | died_liver_any            741   259     0     0 |
  |-------------------------------------------------|
  | died_liver_underlying     741   259     0     0 |
  |-------------------------------------------------|
  | liver_transplant_fu       741   259     0     0 |
  +-------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --+
  |                                          udca_bl = 0   udca_bl = 1   p-valu
> e |
  |----------------------------------------------------------------------------
> --|
  |                                          N=741         N=259               
>   |
  |----------------------------------------------------------------------------
> --|
  | died_ons_covid_flag_any                  126 (17.0%)   42 (16.2%)     0.77 
>   |
  |----------------------------------------------------------------------------
> --|
  | hosp_any_flag                            32 ( 4.3%)    12 ( 4.6%)     0.83 
>   |
  |----------------------------------------------------------------------------
> --|
  | hosp_died                                151 (20.4%)   53 (20.5%)     0.98 
>   |
  |----------------------------------------------------------------------------
> --|
  | composite_make_up         No outcome     590 (79.6%)   206 (79.5%)    0.98 
>   |
  |                           Hospitalised   32 ( 4.3%)    12 ( 4.6%)          
>   |
  |                           Died           119 (16.1%)   41 (15.8%)          
>   |
  |----------------------------------------------------------------------------
> --|
  | composite_pre                            63 ( 8.5%)    26 (10.0%)     0.45 
>   |
  |----------------------------------------------------------------------------
> --|
  | died_pre                                 47 (37.3%)    20 (47.6%)     0.24 
>   |
  |----------------------------------------------------------------------------
> --|
  | hosp_pre                                 16 (50%)      7 (58%)        0.62 
>   |
  |----------------------------------------------------------------------------
> --|
  | composite_post                           88 (11.9%)    27 (10.4%)     0.53 
>   |
  |----------------------------------------------------------------------------
> --|
  | died_post                                79 (62.7%)    22 (52.4%)     0.24 
>   |
  |----------------------------------------------------------------------------
> --|
  | hosp_post                                16 (50%)      5 (42%)        0.62 
>   |
  |----------------------------------------------------------------------------
> --|
  | died_liver_any                           318 (42.9%)   98 (37.8%)     0.15 
>   |
  |----------------------------------------------------------------------------
> --|
  | died_liver_underlying                    300 (40.5%)   116 (44.8%)    0.23 
>   |
  |----------------------------------------------------------------------------
> --|
  | liver_transplant_fu                      12 ( 1.6%)    6 ( 2.3%)      0.47 
>   |
  +----------------------------------------------------------------------------
> --+
Data are presented as n (%).
 

. export delimited using ./output/tables/baseline_outcomes.csv
file ./output/tables/baseline_outcomes.csv saved

. forvalues i=0/1 {   
  2.     destring _columna_`i', gen(n`i') ignore(",") force
  3.     destring _columnb_`i', gen(percent`i') ignore("-" "%" "(" ")")  force
  4.     gen rounded_n`i' = round(n`i', 5)
  5.     tostring rounded_n`i', gen(n`i'_rounded)
  6.     tostring percent`i', gen(percent_`i')
  7.     replace n`i'_rounded = "redacted" if (rounded_n`i'<=5)
  8.     replace percent_`i' = "redacted" if (rounded_n`i'<=5)
  9. }
_columna_0: contains nonnumeric characters not specified in ignore(); n0 genera
> ted as int
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
(2 missing values generated)
n0_rounded generated as str3
percent_0 generated as str4
(0 real changes made)
(0 real changes made)
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as int
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)
(2 missing values generated)
n1_rounded generated as str3
percent_1 generated as str4
variable n1_rounded was str3 now str8
(3 real changes made)
variable percent_1 was str4 now str8
(3 real changes made)

. keep factor rounded_n0 percent0 rounded_n1 percent1

. export delimited using ./output/tables/baseline_outcomes_rounded.csv
file ./output/tables/baseline_outcomes_rounded.csv saved

. restore

. 
. preserve

. table1_mc, by(died_ons_covid_flag_any) vars(died_ons_liver_flag_any bin \ die
> d_ons_liver_flag_underlying bin) clear

  +--------------------------------------------------------+
  | factor                           N_0   N_1   m_0   m_1 |
  |--------------------------------------------------------|
  | died_ons_liver_flag_any          832   168     0     0 |
  |--------------------------------------------------------|
  | died_ons_liver_flag_underlying   832   168     0     0 |
  +--------------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --------------------------+
  |                                  died_ons_covid_flag_any = 0   died_ons_cov
> id_flag_any = 1   p-value |
  |----------------------------------------------------------------------------
> --------------------------|
  |                                  N=832                         N=168       
>                           |
  |----------------------------------------------------------------------------
> --------------------------|
  | died_ons_liver_flag_any          416 (50.0%)                   84 (50.0%)  
>                    1.00   |
  |----------------------------------------------------------------------------
> --------------------------|
  | died_ons_liver_flag_underlying   416 (50.0%)                   84 (50.0%)  
>                    1.00   |
  +----------------------------------------------------------------------------
> --------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/baseline_liver_covid_any.csv
file ./output/tables/baseline_liver_covid_any.csv saved

. forvalues i=0/1 {   
  2.     destring _columna_`i', gen(n`i') ignore(",") force
  3.     destring _columnb_`i', gen(percent`i') ignore("-" "%" "(" ")")  force
  4.     gen rounded_n`i' = round(n`i', 5)
  5.     tostring rounded_n`i', gen(n`i'_rounded)
  6.     tostring percent`i', gen(percent_`i')
  7.     replace n`i'_rounded = "redacted" if (rounded_n`i'<=5)
  8.     replace percent_`i' = "redacted" if (rounded_n`i'<=5)
  9. }
_columna_0: contains nonnumeric characters not specified in ignore(); n0 genera
> ted as int
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as byte
(2 missing values generated)
(2 missing values generated)
n0_rounded generated as str3
percent_0 generated as str2
(0 real changes made)
(0 real changes made)
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as byte
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as byte
(2 missing values generated)
(2 missing values generated)
n1_rounded generated as str2
percent_1 generated as str2
(0 real changes made)
(0 real changes made)

. keep factor rounded_n0 percent0 rounded_n1 percent1

. export delimited using ./output/tables/baseline_liver_covid_any_rounded.csv
file ./output/tables/baseline_liver_covid_any_rounded.csv saved

. restore 

. 
. preserve

. table1_mc, by(died_ons_covid_flag_underlying) vars(died_ons_liver_flag_any bi
> n \ died_ons_liver_flag_underlying bin) clear

  +--------------------------------------------------------+
  | factor                           N_0   N_1   m_0   m_1 |
  |--------------------------------------------------------|
  | died_ons_liver_flag_any          500   500     0     0 |
  |--------------------------------------------------------|
  | died_ons_liver_flag_underlying   500   500     0     0 |
  +--------------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> ----------------------------------------+
  |                                  died_ons_covid_flag_underlying = 0   died_
> ons_covid_flag_underlying = 1   p-value |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  |                                  N=500                                N=500
>                                         |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | died_ons_liver_flag_any          268 (53.6%)                          232 (
> 46.4%)                           0.023  |
  |----------------------------------------------------------------------------
> ----------------------------------------|
  | died_ons_liver_flag_underlying   267 (53.4%)                          233 (
> 46.6%)                           0.032  |
  +----------------------------------------------------------------------------
> ----------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/baseline_liver_covid_underlying.csv
file ./output/tables/baseline_liver_covid_underlying.csv saved

. forvalues i=0/1 {   
  2.     destring _columna_`i', gen(n`i') ignore(",") force
  3.     destring _columnb_`i', gen(percent`i') ignore("-" "%" "(" ")")  force
  4.     gen rounded_n`i' = round(n`i', 5)
  5.     tostring rounded_n`i', gen(n`i'_rounded)
  6.     tostring percent`i', gen(percent_`i')
  7.     replace n`i'_rounded = "redacted" if (rounded_n`i'<=5)
  8.     replace percent_`i' = "redacted" if (rounded_n`i'<=5)
  9. }
_columna_0: contains nonnumeric characters not specified in ignore(); n0 genera
> ted as int
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
(2 missing values generated)
n0_rounded generated as str3
percent_0 generated as str4
(0 real changes made)
(0 real changes made)
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as int
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)
(2 missing values generated)
n1_rounded generated as str3
percent_1 generated as str4
(0 real changes made)
(0 real changes made)

. keep factor rounded_n0 percent0 rounded_n1 percent1

. export delimited using ./output/tables/baseline_liver_covid_underlying_rounde
> d.csv
file ./output/tables/baseline_liver_covid_underlying_rounded.csv saved

. restore

. 
. * Sensitivity analysis March 2021 cohort - vaccinations 
. 
. import delimited using ./output/input_vacc.csv, clear
(109 vars, 1,000 obs)

. 
. * Prepare variables for table 
. replace ethnicity=6 if ethnicity==0
(41 real changes made)

. label define eth5                       1 "White"                            
>            ///
>                             2 "Mixed"                           ///          
>                                    
>                             3 "Asian"                                   ///
>                             4 "Black"                                   ///
>                             5 "Other"                                   ///
>                             6 "Unknown"

.                     
. 
. label values ethnicity eth5

. safetab ethnicity, m
10

  ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |        148       14.80       14.80
      Mixed |        180       18.00       32.80
      Asian |        200       20.00       52.80
      Black |        219       21.90       74.70
      Other |        212       21.20       95.90
    Unknown |         41        4.10      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. *(2) IMD
. replace imd=6 if imd==0
(54 real changes made)

. 
. * Create age categories
. egen age_cat = cut(age), at(18, 40, 60, 80, 120) icodes
(230 missing values generated)

. label define age 0 "18 - 40 years" 1 "41 - 60 years" 2 "61 - 80 years" 3 ">80
>  years"

. label values age_cat age

. bys age_cat: sum age

-------------------------------------------------------------------------------
-> age_cat = 18 - 40 years

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        276    29.06522     6.45173         18         39

-------------------------------------------------------------------------------
-> age_cat = 41 - 60 years

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        253    49.32806    5.498113         40         59

-------------------------------------------------------------------------------
-> age_cat = 61 - 80 years

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        199    67.92965    5.568225         60         79

-------------------------------------------------------------------------------
-> age_cat = >80 years

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |         42    87.47619    4.855161         80         99

-------------------------------------------------------------------------------
-> age_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        230    7.669565    5.082244          0         17


. 
. * BMI categories
. * assume BMI's less than 10 are incorrect and set to missing 
. sum bmi, d

                             bmi
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,000
25%     15.32269              0       Sum of Wgt.       1,000

50%     25.21698                      Mean           22.23855
                        Largest       Std. Dev.      13.17616
75%     31.40919       49.45975
90%        37.22       50.03633       Variance       173.6111
95%     40.20988       55.25287       Skewness      -.5297197
99%     45.08481        55.6831       Kurtosis       2.286155

. replace bmi = . if bmi<10
(210 real changes made, 210 to missing)

. egen bmi_cat = cut(bmi), at(0, 1, 18.5, 24.9, 29.9, 39.9, 100) icodes
(210 missing values generated)

. bys bmi_cat: sum bmi

-------------------------------------------------------------------------------
-> bmi_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |         82    15.13333    2.549967   10.32012   18.48942

-------------------------------------------------------------------------------
-> bmi_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        198    22.08599    1.767085    18.5205   24.85654

-------------------------------------------------------------------------------
-> bmi_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        191    27.55734    1.523472   24.92576   29.88753

-------------------------------------------------------------------------------
-> bmi_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        268    33.80841    2.839721   29.95342   39.77732

-------------------------------------------------------------------------------
-> bmi_cat = 5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |         51    43.44489     3.39261   40.04372    55.6831

-------------------------------------------------------------------------------
-> bmi_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |          0


. * add missing . to zero category
. replace bmi_cat = 0 if bmi_cat==. 
(210 real changes made)

. label define bmi 0 "Missing" 1 "Underweight" 2 "Healthy range" 3 "Overweight"
>  4 "Obese" 5 "Morbidly obese"

. label values bmi_cat bmi

. 
. * Smoking status
. gen smoking = 0 if smoking_status=="N"
(912 missing values generated)

. replace smoking = 1 if smoking_status=="S"
(208 real changes made)

. replace smoking = 2 if smoking_status=="E"
(162 real changes made)

. replace smoking = 3 if smoking==.
(542 real changes made)

. 
. label define smok 1 "Current smoker" 2 "Ex-smoker" 0 "Never smoked" 3 "Unknow
> n"

. label values smoking smok

. 
. replace oral_steroid_drugs_nhsd=. if oral_steroid_drug_nhsd_3m_count < 2 & or
> al_steroid_drug_nhsd_12m_count < 4
(937 real changes made, 937 to missing)

. gen imid_nhsd=max(oral_steroid_drugs_nhsd, immunosuppresant_drugs_nhsd)

. gen rare_neuro_nhsd = max(multiple_sclerosis_nhsd, motor_neurone_disease_nhsd
> , myasthenia_gravis_nhsd, huntingtons_disease_nhsd)

. gen solid_organ_transplant_bin = solid_organ_transplant_nhsd_new!=""

. gen any_high_risk_condition = max(learning_disability_nhsd_snomed, cancer_ope
> nsafely_snomed_new, haematological_disease_nhsd, ///
> ckd_stage_5_nhsd, imid_nhsd, immunosupression_nhsd_new, hiv_aids_nhsd, solid_
> organ_transplant_bin, rare_neuro_nhsd)

. 
. foreach var in udca gc budesonide fenofibrate {
  2.     sum `var'_count_bl, d
  3.     sum `var'_count_fu, d 
  4.     gen `var'_any = (`var'_count_fu>=1 & `var'_count_fu!=.)
  5.     gen `var'_bl = (`var'_count_bl>=1 & `var'_count_bl!=.)
  6.     tab `var'_any, m 
  7.     tab `var'_bl, m
  8. }

                        udca_count_bl
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -2
 5%            0             -2
10%            0             -1       Obs               1,000
25%            0             -1       Sum of Wgt.       1,000

50%            0                      Mean               .769
                        Largest       Std. Dev.      1.538182
75%            1              7
90%            3              7       Variance       2.366005
95%            4              7       Skewness       2.008682
99%            6              8       Kurtosis        6.38828

                        udca_count_fu
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -3
 5%            0             -1
10%            0             -1       Obs               1,000
25%            0             -1       Sum of Wgt.       1,000

50%            0                      Mean               .793
                        Largest       Std. Dev.      1.612064
75%            0              7
90%            3              7       Variance        2.59875
95%          4.5              7       Skewness       1.967474
99%            6              8       Kurtosis       6.028519

   udca_any |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        752       75.20       75.20
          1 |        248       24.80      100.00
------------+-----------------------------------
      Total |      1,000      100.00

    udca_bl |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        742       74.20       74.20
          1 |        258       25.80      100.00
------------+-----------------------------------
      Total |      1,000      100.00

                         gc_count_bl
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -2
 5%            0             -1
10%            0             -1       Obs               1,000
25%            0              0       Sum of Wgt.       1,000

50%            0                      Mean               .791
                        Largest       Std. Dev.      1.578547
75%            1              7
90%            4              7       Variance       2.491811
95%            4              7       Skewness        1.96126
99%            6              9       Kurtosis       6.011308

                         gc_count_fu
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -1
 5%            0             -1
10%            0             -1       Obs               1,000
25%            0             -1       Sum of Wgt.       1,000

50%            0                      Mean               .777
                        Largest       Std. Dev.      1.577263
75%            1              7
90%            3              8       Variance       2.487759
95%            4              8       Skewness       2.102299
99%            6              9       Kurtosis       6.866941

     gc_any |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        747       74.70       74.70
          1 |        253       25.30      100.00
------------+-----------------------------------
      Total |      1,000      100.00

      gc_bl |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        745       74.50       74.50
          1 |        255       25.50      100.00
------------+-----------------------------------
      Total |      1,000      100.00

                     budesonide_count_bl
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -2
 5%            0             -2
10%            0             -1       Obs               1,000
25%            0             -1       Sum of Wgt.       1,000

50%            0                      Mean               .758
                        Largest       Std. Dev.      1.596868
75%            1              8
90%            3              8       Variance       2.549986
95%            4              8       Skewness       2.208035
99%            7              9       Kurtosis       7.575052

                     budesonide_count_fu
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -5
 5%            0             -1
10%            0             -1       Obs               1,000
25%            0             -1       Sum of Wgt.       1,000

50%            0                      Mean               .812
                        Largest       Std. Dev.      1.609735
75%            1              7
90%            4              7       Variance       2.591247
95%            5              7       Skewness       1.790806
99%            6              7       Kurtosis       5.505137

budesonide_ |
        any |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        740       74.00       74.00
          1 |        260       26.00      100.00
------------+-----------------------------------
      Total |      1,000      100.00

budesonide_ |
         bl |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        748       74.80       74.80
          1 |        252       25.20      100.00
------------+-----------------------------------
      Total |      1,000      100.00

                    fenofibrate_count_bl
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -2
 5%            0             -2
10%            0             -1       Obs               1,000
25%            0             -1       Sum of Wgt.       1,000

50%            0                      Mean                .78
                        Largest       Std. Dev.      1.588119
75%            0              7
90%            3              7       Variance       2.522122
95%          4.5              8       Skewness       1.997184
99%            6              8       Kurtosis       6.274831

                    fenofibrate_count_fu
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -1
 5%            0             -1
10%            0             -1       Obs               1,000
25%            0             -1       Sum of Wgt.       1,000

50%            0                      Mean                .76
                        Largest       Std. Dev.      1.512841
75%           .5              7
90%            3              7       Variance       2.288689
95%            4              7       Skewness       1.917151
99%            6              7       Kurtosis       5.755848

fenofibrate |
       _any |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        750       75.00       75.00
          1 |        250       25.00      100.00
------------+-----------------------------------
      Total |      1,000      100.00

fenofibrate |
        _bl |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        751       75.10       75.10
          1 |        249       24.90      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. 
. * Generate variable with number of vaccinations 
. foreach var in covid_vacc_first covid_vacc_second covid_vacc_third covid_vacc
> _fourth covid_vacc_fifth {
  2.     gen `var'= (`var'_date!="")    
  3. }

. 
. egen vacc_any = rowmax(covid_vacc_first covid_vacc_second covid_vacc_third co
> vid_vacc_fourth covid_vacc_fifth)

. egen total_vaccs = rowtotal(covid_vacc_first covid_vacc_second covid_vacc_thi
> rd covid_vacc_fourth covid_vacc_fifth)

. tab total_vaccs 

total_vaccs |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         10        1.00        1.00
          1 |        212       21.20       22.20
          2 |        573       57.30       79.50
          3 |        178       17.80       97.30
          4 |         25        2.50       99.80
          5 |          2        0.20      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. 
. gen severe_disease_fu = severe_disease_fu_date!=""

. 
. * Time from most recent vaccination on 1st March 2021
. gen date_most_recent_cov_vacA = date(date_most_recent_cov_vac, "YMD")
(500 missing values generated)

. gen time_vacc = date("01Mar2021", "DMY") - date_most_recent_cov_vacA
(500 missing values generated)

. sum time_vacc, d

                          time_vacc
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            4              1
10%           10              1       Obs                 500
25%           24              1       Sum of Wgt.         500

50%           44                      Mean             44.566
                        Largest       Std. Dev.      25.07011
75%           66             89
90%           79             89       Variance       628.5107
95%           84             89       Skewness      -.0154158
99%         88.5             89       Kurtosis       1.852281

. xtile time_vacc_cat = time_vacc, nq(4)

. bys time_vacc_cat: sum time_vacc 

-------------------------------------------------------------------------------
-> time_vacc_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   time_vacc |        126     11.8254    6.770618          1         24

-------------------------------------------------------------------------------
-> time_vacc_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   time_vacc |        126    34.55556    5.649149         25         44

-------------------------------------------------------------------------------
-> time_vacc_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   time_vacc |        126    55.65873     6.53258         45         66

-------------------------------------------------------------------------------
-> time_vacc_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   time_vacc |        122     77.2623    6.398351         67         89

-------------------------------------------------------------------------------
-> time_vacc_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   time_vacc |          0


. 
. * Create tables 
. * Characteristics whole cohort
. preserve

. table1_mc, vars(age_cat cat \ sex cat \ imd cat \ ethnicity cat \ severe_dise
> ase_bl cat \ smoking cat \ bmi_cat cat \ has_pbc bin \ ///
> any_high_risk_condition cat) clear

  +---------------------------------------+
  | factor                      N_1   m_1 |
  |---------------------------------------|
  | age_cat                     770   230 |
  |---------------------------------------|
  | sex                       1,000     0 |
  |---------------------------------------|
  | imd                       1,000     0 |
  |---------------------------------------|
  | ethnicity                 1,000     0 |
  |---------------------------------------|
  | severe_disease_bl         1,000     0 |
  |---------------------------------------|
  | smoking                   1,000     0 |
  |---------------------------------------|
  | bmi_cat                   1,000     0 |
  |---------------------------------------|
  | has_pbc                   1,000     0 |
  |---------------------------------------|
  | any_high_risk_condition   1,000     0 |
  +---------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +-----------------------------------------------------------+
  |                                            Total          |
  |-----------------------------------------------------------|
  |                                            N=1,000        |
  |-----------------------------------------------------------|
  | age_cat                   18 - 40 years    276 (35.8%)    |
  |                           41 - 60 years    253 (32.9%)    |
  |                           61 - 80 years    199 (25.8%)    |
  |                           >80 years        42 ( 5.5%)     |
  |-----------------------------------------------------------|
  | sex                       F                531 (53.1%)    |
  |                           M                456 (45.6%)    |
  |                           U                13 ( 1.3%)     |
  |-----------------------------------------------------------|
  | imd                       1                187 (18.7%)    |
  |                           2                190 (19.0%)    |
  |                           3                192 (19.2%)    |
  |                           4                192 (19.2%)    |
  |                           5                185 (18.5%)    |
  |                           6                54 ( 5.4%)     |
  |-----------------------------------------------------------|
  | ethnicity                 White            148 (14.8%)    |
  |                           Mixed            180 (18.0%)    |
  |                           Asian            200 (20.0%)    |
  |                           Black            219 (21.9%)    |
  |                           Other            212 (21.2%)    |
  |                           Unknown          41 ( 4.1%)     |
  |-----------------------------------------------------------|
  | severe_disease_bl         0                500 (50.0%)    |
  |                           1                500 (50.0%)    |
  |-----------------------------------------------------------|
  | smoking                   Never smoked     88 ( 8.8%)     |
  |                           Current smoker   208 (20.8%)    |
  |                           Ex-smoker        162 (16.2%)    |
  |                           Unknown          542 (54.2%)    |
  |-----------------------------------------------------------|
  | bmi_cat                   Missing          210 (21.0%)    |
  |                           Underweight      82 ( 8.2%)     |
  |                           Healthy range    198 (19.8%)    |
  |                           Overweight       191 (19.1%)    |
  |                           Obese            268 (26.8%)    |
  |                           Morbidly obese   51 ( 5.1%)     |
  |-----------------------------------------------------------|
  | has_pbc                                    500 (50.0%)    |
  |-----------------------------------------------------------|
  | any_high_risk_condition   1                1,000 (100.0%) |
  +-----------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/baseline_table_vacc.csv, replace
(note: file ./output/tables/baseline_table_vacc.csv not found)
file ./output/tables/baseline_table_vacc.csv saved

. * Rounding numbers in table to nearest 5
. destring _columna_1, gen(n) ignore(",") force
_columna_1: contains nonnumeric characters not specified in ignore()
_columna_1: character , removed; n generated as int
(2 missing values generated)

. destring _columnb_1, gen(percent) ignore("-" "%" "(" ")")  force
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent generated as double
(2 missing values generated)

. gen rounded_n = round(n, 5)
(2 missing values generated)

. tostring rounded_n, gen(n_rounded)
n_rounded generated as str4

. replace n_rounded = "redacted" if (rounded_n<=5)
(0 real changes made)

. keep factor level n_rounded percent

. export delimited using ./output/tables/baseline_table_vacc_rounded.csv
file ./output/tables/baseline_table_vacc_rounded.csv saved

. restore 

. 
. * Characteristics by exposure status at baseline 
. preserve 

. table1_mc, vars(age_cat cat \ sex cat \ imd cat \ ethnicity cat \ severe_dise
> ase_bl cat \ smoking cat \ bmi_cat cat \ has_pbc bin \ any_high_risk_conditio
> n cat) by(udca_bl) clear

  +-------------------------------------------------+
  | factor                    N_0   N_1   m_0   m_1 |
  |-------------------------------------------------|
  | age_cat                   570   200   172    58 |
  |-------------------------------------------------|
  | sex                       742   258     0     0 |
  |-------------------------------------------------|
  | imd                       742   258     0     0 |
  |-------------------------------------------------|
  | ethnicity                 742   258     0     0 |
  |-------------------------------------------------|
  | severe_disease_bl         742   258     0     0 |
  |-------------------------------------------------|
  | smoking                   742   258     0     0 |
  |-------------------------------------------------|
  | bmi_cat                   742   258     0     0 |
  |-------------------------------------------------|
  | has_pbc                   742   258     0     0 |
  |-------------------------------------------------|
  | any_high_risk_condition   742   258     0     0 |
  +-------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> ------+
  |                                            udca_bl = 0    udca_bl = 1    p-
> value |
  |----------------------------------------------------------------------------
> ------|
  |                                            N=742          N=258            
>       |
  |----------------------------------------------------------------------------
> ------|
  | age_cat                   18 - 40 years    198 (34.7%)    78 (39.0%)      0
> .75   |
  |                           41 - 60 years    191 (33.5%)    62 (31.0%)       
>       |
  |                           61 - 80 years    150 (26.3%)    49 (24.5%)       
>       |
  |                           >80 years        31 ( 5.4%)     11 ( 5.5%)       
>       |
  |----------------------------------------------------------------------------
> ------|
  | sex                       F                412 (55.5%)    119 (46.1%)     0
> .016  |
  |                           M                319 (43.0%)    137 (53.1%)      
>       |
  |                           U                11 ( 1.5%)     2 ( 0.8%)        
>       |
  |----------------------------------------------------------------------------
> ------|
  | imd                       1                135 (18.2%)    52 (20.2%)      0
> .64   |
  |                           2                140 (18.9%)    50 (19.4%)       
>       |
  |                           3                147 (19.8%)    45 (17.4%)       
>       |
  |                           4                137 (18.5%)    55 (21.3%)       
>       |
  |                           5                139 (18.7%)    46 (17.8%)       
>       |
  |                           6                44 ( 5.9%)     10 ( 3.9%)       
>       |
  |----------------------------------------------------------------------------
> ------|
  | ethnicity                 White            114 (15.4%)    34 (13.2%)      0
> .45   |
  |                           Mixed            128 (17.3%)    52 (20.2%)       
>       |
  |                           Asian            144 (19.4%)    56 (21.7%)       
>       |
  |                           Black            163 (22.0%)    56 (21.7%)       
>       |
  |                           Other            158 (21.3%)    54 (20.9%)       
>       |
  |                           Unknown          35 ( 4.7%)     6 ( 2.3%)        
>       |
  |----------------------------------------------------------------------------
> ------|
  | severe_disease_bl         0                367 (49.5%)    133 (51.6%)     0
> .56   |
  |                           1                375 (50.5%)    125 (48.4%)      
>       |
  |----------------------------------------------------------------------------
> ------|
  | smoking                   Never smoked     61 ( 8.2%)     27 (10.5%)      0
> .51   |
  |                           Current smoker   160 (21.6%)    48 (18.6%)       
>       |
  |                           Ex-smoker        123 (16.6%)    39 (15.1%)       
>       |
  |                           Unknown          398 (53.6%)    144 (55.8%)      
>       |
  |----------------------------------------------------------------------------
> ------|
  | bmi_cat                   Missing          152 (20.5%)    58 (22.5%)      0
> .36   |
  |                           Underweight      61 ( 8.2%)     21 ( 8.1%)       
>       |
  |                           Healthy range    146 (19.7%)    52 (20.2%)       
>       |
  |                           Overweight       136 (18.3%)    55 (21.3%)       
>       |
  |                           Obese            212 (28.6%)    56 (21.7%)       
>       |
  |                           Morbidly obese   35 ( 4.7%)     16 ( 6.2%)       
>       |
  |----------------------------------------------------------------------------
> ------|
  | has_pbc                                    371 (50.0%)    129 (50.0%)     1
> .00   |
  |----------------------------------------------------------------------------
> ------|
  | any_high_risk_condition   1                742 (100.0%)   258 (100.0%)     
>       |
  +----------------------------------------------------------------------------
> ------+
Data are presented as n (%).
 

. export delimited using ./output/tables/baseline_table_udca_vacc.csv, replace
(note: file ./output/tables/baseline_table_udca_vacc.csv not found)
file ./output/tables/baseline_table_udca_vacc.csv saved

. * Rounding numbers in table to nearest 5
. forvalues i=0/1 {   
  2.     destring _columna_`i', gen(n`i') ignore(",") force
  3.     destring _columnb_`i', gen(percent`i') ignore("-" "%" "(" ")")  force
  4.     gen rounded_n`i' = round(n`i', 5)
  5.     tostring percent`i', gen(percent_`i')
  6.     tostring rounded_n`i', gen(n`i'_rounded)
  7.     replace n`i'_rounded = "redacted" if (rounded_n`i'<=5)
  8.     replace percent_`i' = "redacted" if (rounded_n`i'<=5)
  9. }
_columna_0: contains nonnumeric characters not specified in ignore(); n0 genera
> ted as int
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
(2 missing values generated)
percent_0 generated as str4
n0_rounded generated as str3
(0 real changes made)
(0 real changes made)
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as int
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)
(2 missing values generated)
percent_1 generated as str4
n1_rounded generated as str3
variable n1_rounded was str3 now str8
(2 real changes made)
variable percent_1 was str4 now str8
(2 real changes made)

. keep factor level n0_rounded percent_0 n1_rounded percent_1

. export delimited using ./output/tables/baseline_table_udca_vacc_rounded.csv
file ./output/tables/baseline_table_udca_vacc_rounded.csv saved

. restore 

. 
. use ./output/an_dataset_composite_any, clear 

. tab udca, m 

       udca |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,589       90.33       90.33
          1 |        277        9.67      100.00
------------+-----------------------------------
      Total |      2,866      100.00

. 
end of do-file

. . file open output using "/tmp/104_baseline_tables.do.L06E.out", write text r
> eplace

. . file write output "success" 

. . file close output

. 
end of do-file


