
. 
. import delimited using ./output/input_pbc.csv, clear
(94 vars, 1,000 obs)

. 
. * Prepare variables for table 
. replace ethnicity=6 if ethnicity==0
(50 real changes made)

. label define eth5                       1 "White"                            
>            ///
>                             2 "Mixed"                           ///          
>                                    
>                             3 "Asian"                                   ///
>                             4 "Black"                                   ///
>                             5 "Other"                                   ///
>                             6 "Unknown"

.                     
. 
. label values ethnicity eth5

. safetab ethnicity, m
10

  ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |        155       15.50       15.50
      Mixed |        201       20.10       35.60
      Asian |        205       20.50       56.10
      Black |        184       18.40       74.50
      Other |        205       20.50       95.00
    Unknown |         50        5.00      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. *(2) IMD
. replace imd=6 if imd==0
(45 real changes made)

. 
. * Create age categories
. egen age_cat = cut(age), at(18, 40, 60, 80, 120) icodes
(224 missing values generated)

. label define age 0 "18 - 40 years" 1 "41 - 60 years" 2 "61 - 80 years" 3 ">80
>  years"

. label values age_cat age

. bys age_cat: sum age

-------------------------------------------------------------------------------
-> age_cat = 18 - 40 years

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        286    28.61888    6.081741         18         39

-------------------------------------------------------------------------------
-> age_cat = 41 - 60 years

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        264    49.73864    5.734614         40         59

-------------------------------------------------------------------------------
-> age_cat = 61 - 80 years

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        176    68.59659      5.2592         60         79

-------------------------------------------------------------------------------
-> age_cat = >80 years

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |         50        85.1      4.9125         80         99

-------------------------------------------------------------------------------
-> age_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        224    8.397321    5.261604          0         17


. 
. * BMI categories
. egen bmi_cat = cut(bmi), at(0, 1, 18.5, 24.9, 29.9, 39.9, 100) icodes

. bys bmi_cat: sum bmi

-------------------------------------------------------------------------------
-> bmi_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        199           0           0          0          0

-------------------------------------------------------------------------------
-> bmi_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        101    14.98098    3.079703   3.680509   18.48587

-------------------------------------------------------------------------------
-> bmi_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        195    21.96323    1.900942   18.50175   24.88129

-------------------------------------------------------------------------------
-> bmi_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        220    27.49285    1.402351   24.91694   29.88228

-------------------------------------------------------------------------------
-> bmi_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        235    34.06861      2.8385   29.92394   39.86493

-------------------------------------------------------------------------------
-> bmi_cat = 5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |         50    43.07174    2.709472   39.91786   52.87654


. * add missing . to zero category
. replace bmi_cat = 0 if bmi_cat==. 
(0 real changes made)

. label define bmi 0 "Missing" 1 "Underweight" 2 "Healthy range" 3 "Overweight"
>  4 "Obese" 5 "Morbidly obese"

. label values bmi_cat bmi

. 
. replace oral_steroid_drugs_nhsd=. if oral_steroid_drug_nhsd_3m_count < 2 & or
> al_steroid_drug_nhsd_12m_count < 4
(938 real changes made, 938 to missing)

. gen imid_nhsd=max(oral_steroid_drugs_nhsd, immunosuppresant_drugs_nhsd)

. gen rare_neuro_nhsd = max(multiple_sclerosis_nhsd, motor_neurone_disease_nhsd
> , myasthenia_gravis_nhsd, huntingtons_disease_nhsd)

. gen solid_organ_transplant_bin = solid_organ_transplant_nhsd_new!=""

. gen any_high_risk_condition = max(learning_disability_nhsd_snomed, cancer_ope
> nsafely_snomed_new, haematological_disease_nhsd, ///
> ckd_stage_5_nhsd, imid_nhsd, immunosupression_nhsd_new, hiv_aids_nhsd, solid_
> organ_transplant_bin, rare_neuro_nhsd)

. 
. foreach var in gc budesonide fenofibrate {
  2.     gen `var'_any = (`var'_count>=1 & `var'_count!=.)
  3. }

. gen udca_any = (udca_count_fu>=1 & udca_count_fu!=.)

. 
. * Create tables 
. * Characteristics whole cohort
. preserve

. table1_mc, vars(age_cat cat \ sex cat \ imd cat \ ethnicity cat \ severe_dise
> ase_bl cat \ smoking_status cat \ bmi_cat cat \ has_pbc bin \ ///
> any_high_risk_condition cat) clear

  +---------------------------------------+
  | factor                      N_1   m_1 |
  |---------------------------------------|
  | age_cat                     776   224 |
  |---------------------------------------|
  | sex                       1,000     0 |
  |---------------------------------------|
  | imd                       1,000     0 |
  |---------------------------------------|
  | ethnicity                 1,000     0 |
  |---------------------------------------|
  | severe_disease_bl         1,000     0 |
  |---------------------------------------|
  | smoking_status              500   500 |
  |---------------------------------------|
  | bmi_cat                   1,000     0 |
  |---------------------------------------|
  | has_pbc                   1,000     0 |
  |---------------------------------------|
  | any_high_risk_condition   1,000     0 |
  +---------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +-----------------------------------------------------------+
  |                                            Total          |
  |-----------------------------------------------------------|
  |                                            N=1,000        |
  |-----------------------------------------------------------|
  | age_cat                   18 - 40 years    286 (36.9%)    |
  |                           41 - 60 years    264 (34.0%)    |
  |                           61 - 80 years    176 (22.7%)    |
  |                           >80 years        50 ( 6.4%)     |
  |-----------------------------------------------------------|
  | sex                       F                513 (51.3%)    |
  |                           M                478 (47.8%)    |
  |                           U                9 ( 0.9%)      |
  |-----------------------------------------------------------|
  | imd                       1                192 (19.2%)    |
  |                           2                197 (19.7%)    |
  |                           3                175 (17.5%)    |
  |                           4                186 (18.6%)    |
  |                           5                205 (20.5%)    |
  |                           6                45 ( 4.5%)     |
  |-----------------------------------------------------------|
  | ethnicity                 White            155 (15.5%)    |
  |                           Mixed            201 (20.1%)    |
  |                           Asian            205 (20.5%)    |
  |                           Black            184 (18.4%)    |
  |                           Other            205 (20.5%)    |
  |                           Unknown          50 ( 5.0%)     |
  |-----------------------------------------------------------|
  | severe_disease_bl         0                500 (50.0%)    |
  |                           1                500 (50.0%)    |
  |-----------------------------------------------------------|
  | smoking_status            E                165 (33.0%)    |
  |                           M                48 ( 9.6%)     |
  |                           N                97 (19.4%)     |
  |                           S                190 (38.0%)    |
  |-----------------------------------------------------------|
  | bmi_cat                   Missing          199 (19.9%)    |
  |                           Underweight      101 (10.1%)    |
  |                           Healthy range    195 (19.5%)    |
  |                           Overweight       220 (22.0%)    |
  |                           Obese            235 (23.5%)    |
  |                           Morbidly obese   50 ( 5.0%)     |
  |-----------------------------------------------------------|
  | has_pbc                                    500 (50.0%)    |
  |-----------------------------------------------------------|
  | any_high_risk_condition   1                1,000 (100.0%) |
  +-----------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/baseline_table.csv, replace
(note: file ./output/tables/baseline_table.csv not found)
file ./output/tables/baseline_table.csv saved

. * Rounding numbers in table to nearest 5
. destring _columna_1, gen(n) force
_columna_1: contains nonnumeric characters; n generated as int
(3 missing values generated)

. destring _columnb_1, gen(percent) ignore("-" "%" "(" ")")  force
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent generated as double
(2 missing values generated)

. gen rounded_n = round(n, 5)
(3 missing values generated)

. keep factor level rounded_n percent

. export delimited using ./output/tables/baseline_table_rounded.csv
file ./output/tables/baseline_table_rounded.csv saved

. restore 

. 
. * High risk conditions
. preserve

. table1_mc, vars(learning_disability_nhsd_snomed cat \ cancer_opensafely_snome
> d_new cat \ haematological_disease_nhsd cat \ ///
> ckd_stage_5_nhsd cat \ imid_nhsd cat \ immunosupression_nhsd_new cat \ hiv_ai
> ds_nhsd cat \ solid_organ_transplant_bin cat \  ///
> rare_neuro_nhsd cat) clear

  +-----------------------------------------------+
  | factor                              N_1   m_1 |
  |-----------------------------------------------|
  | learning_disability_nhsd_snomed   1,000     0 |
  |-----------------------------------------------|
  | cancer_opensafely_snomed_new      1,000     0 |
  |-----------------------------------------------|
  | haematological_disease_nhsd       1,000     0 |
  |-----------------------------------------------|
  | ckd_stage_5_nhsd                  1,000     0 |
  |-----------------------------------------------|
  | imid_nhsd                         1,000     0 |
  |-----------------------------------------------|
  | immunosupression_nhsd_new         1,000     0 |
  |-----------------------------------------------|
  | hiv_aids_nhsd                     1,000     0 |
  |-----------------------------------------------|
  | solid_organ_transplant_bin        1,000     0 |
  |-----------------------------------------------|
  | rare_neuro_nhsd                   1,000     0 |
  +-----------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +-------------------------------------------------------+
  |                                           Total       |
  |-------------------------------------------------------|
  |                                           N=1,000     |
  |-------------------------------------------------------|
  | learning_disability_nhsd_snomed   0       500 (50.0%) |
  |                                   1       500 (50.0%) |
  |-------------------------------------------------------|
  | cancer_opensafely_snomed_new      0       500 (50.0%) |
  |                                   1       500 (50.0%) |
  |-------------------------------------------------------|
  | haematological_disease_nhsd       0       10 ( 1.0%)  |
  |                                   1       990 (99.0%) |
  |-------------------------------------------------------|
  | ckd_stage_5_nhsd                  0       248 (24.8%) |
  |                                   1       752 (75.2%) |
  |-------------------------------------------------------|
  | imid_nhsd                         0       481 (48.1%) |
  |                                   1       519 (51.9%) |
  |-------------------------------------------------------|
  | immunosupression_nhsd_new         0       500 (50.0%) |
  |                                   1       500 (50.0%) |
  |-------------------------------------------------------|
  | hiv_aids_nhsd                     0       755 (75.5%) |
  |                                   1       245 (24.5%) |
  |-------------------------------------------------------|
  | solid_organ_transplant_bin        0       485 (48.5%) |
  |                                   1       515 (51.5%) |
  |-------------------------------------------------------|
  | rare_neuro_nhsd                   0       7 ( 0.7%)   |
  |                                   1       993 (99.3%) |
  +-------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/high_risk.csv, replace
(note: file ./output/tables/high_risk.csv not found)
file ./output/tables/high_risk.csv saved

. * Rounding numbers in table to nearest 5
. destring _columna_1, gen(n) force
_columna_1: contains nonnumeric characters; n generated as int
(2 missing values generated)

. destring _columnb_1, gen(percent) ignore("-" "%" "(" ")")  force
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent generated as double
(2 missing values generated)

. gen rounded_n = round(n, 5)
(2 missing values generated)

. keep factor level rounded_n percent

. export delimited using ./output/tables/high_risk_rounded.csv
file ./output/tables/high_risk_rounded.csv saved

. restore 

. 
. * Characteristics by any exposure
. preserve 

. table1_mc, vars(age_cat cat \ sex cat \ imd cat \ ethnicity cat \ severe_dise
> ase_bl cat \ smoking_status cat \ bmi_cat cat \ has_pbc bin) by(udca_any) cle
> ar

  +-------------------------------------------+
  | factor              N_0   N_1   m_0   m_1 |
  |-------------------------------------------|
  | age_cat             573   203   174    50 |
  |-------------------------------------------|
  | sex                 747   253     0     0 |
  |-------------------------------------------|
  | imd                 747   253     0     0 |
  |-------------------------------------------|
  | ethnicity           747   253     0     0 |
  |-------------------------------------------|
  | severe_disease_bl   747   253     0     0 |
  |-------------------------------------------|
  | smoking_status      367   133   380   120 |
  |-------------------------------------------|
  | bmi_cat             747   253     0     0 |
  |-------------------------------------------|
  | has_pbc             747   253     0     0 |
  +-------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> +
  |                                      udca_any = 0   udca_any = 1   p-value 
> |
  |----------------------------------------------------------------------------
> |
  |                                      N=747          N=253                  
> |
  |----------------------------------------------------------------------------
> |
  | age_cat             18 - 40 years    211 (36.8%)    75 (36.9%)      0.69   
> |
  |                     41 - 60 years    196 (34.2%)    68 (33.5%)             
> |
  |                     61 - 80 years    126 (22.0%)    50 (24.6%)             
> |
  |                     >80 years        40 ( 7.0%)     10 ( 4.9%)             
> |
  |----------------------------------------------------------------------------
> |
  | sex                 F                385 (51.5%)    128 (50.6%)     0.84   
> |
  |                     M                356 (47.7%)    122 (48.2%)            
> |
  |                     U                6 ( 0.8%)      3 ( 1.2%)              
> |
  |----------------------------------------------------------------------------
> |
  | imd                 1                150 (20.1%)    42 (16.6%)      0.50   
> |
  |                     2                148 (19.8%)    49 (19.4%)             
> |
  |                     3                121 (16.2%)    54 (21.3%)             
> |
  |                     4                142 (19.0%)    44 (17.4%)             
> |
  |                     5                152 (20.3%)    53 (20.9%)             
> |
  |                     6                34 ( 4.6%)     11 ( 4.3%)             
> |
  |----------------------------------------------------------------------------
> |
  | ethnicity           White            112 (15.0%)    43 (17.0%)      0.18   
> |
  |                     Mixed            154 (20.6%)    47 (18.6%)             
> |
  |                     Asian            157 (21.0%)    48 (19.0%)             
> |
  |                     Black            147 (19.7%)    37 (14.6%)             
> |
  |                     Other            142 (19.0%)    63 (24.9%)             
> |
  |                     Unknown          35 ( 4.7%)     15 ( 5.9%)             
> |
  |----------------------------------------------------------------------------
> |
  | severe_disease_bl   0                369 (49.4%)    131 (51.8%)     0.51   
> |
  |                     1                378 (50.6%)    122 (48.2%)            
> |
  |----------------------------------------------------------------------------
> |
  | smoking_status      E                126 (34.3%)    39 (29.3%)      0.69   
> |
  |                     M                34 ( 9.3%)     14 (10.5%)             
> |
  |                     N                68 (18.5%)     29 (21.8%)             
> |
  |                     S                139 (37.9%)    51 (38.3%)             
> |
  |----------------------------------------------------------------------------
> |
  | bmi_cat             Missing          144 (19.3%)    55 (21.7%)      0.96   
> |
  |                     Underweight      76 (10.2%)     25 ( 9.9%)             
> |
  |                     Healthy range    146 (19.5%)    49 (19.4%)             
> |
  |                     Overweight       164 (22.0%)    56 (22.1%)             
> |
  |                     Obese            180 (24.1%)    55 (21.7%)             
> |
  |                     Morbidly obese   37 ( 5.0%)     13 ( 5.1%)             
> |
  |----------------------------------------------------------------------------
> |
  | has_pbc                              383 (51.3%)    117 (46.2%)     0.17   
> |
  +----------------------------------------------------------------------------
> +
Data are presented as n (%).
 

. export delimited using ./output/tables/baseline_table_udca.csv, replace
(note: file ./output/tables/baseline_table_udca.csv not found)
file ./output/tables/baseline_table_udca.csv saved

. * Rounding numbers in table to nearest 5
. destring _columna_1, gen(n1) force
_columna_1: contains nonnumeric characters; n1 generated as int
(2 missing values generated)

. destring _columna_0, gen(n0) force
_columna_0: contains nonnumeric characters; n0 generated as int
(2 missing values generated)

. destring _columnb_1, gen(percent1) ignore("-" "%" "(" ")")  force
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)

. destring _columnb_0, gen(percent0) ignore("-" "%" "(" ")")  force
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)

. gen rounded_n1 = round(n1, 5)
(2 missing values generated)

. gen rounded_n0 = round(n0, 5)
(2 missing values generated)

. keep factor level rounded_n0 percent0 rounded_n1 percent1

. export delimited using ./output/tables/baseline_table_udca_rounded.csv
file ./output/tables/baseline_table_udca_rounded.csv saved

. restore 

. 
. * Additional medications by any exposure
. preserve 

. table1_mc, vars(budesonide_any bin \ fenofibrate_any bin \ gc_any bin \ oca_b
> l bin \ rituximab_bl bin) by(udca_any) clear

  +-----------------------------------------+
  | factor            N_0   N_1   m_0   m_1 |
  |-----------------------------------------|
  | budesonide_any    747   253     0     0 |
  |-----------------------------------------|
  | fenofibrate_any   747   253     0     0 |
  |-----------------------------------------|
  | gc_any            747   253     0     0 |
  |-----------------------------------------|
  | oca_bl            747   253     0     0 |
  |-----------------------------------------|
  | rituximab_bl      747   253     0     0 |
  +-----------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +---------------------------------------------------------+
  |                   udca_any = 0   udca_any = 1   p-value |
  |---------------------------------------------------------|
  |                   N=747          N=253                  |
  |---------------------------------------------------------|
  | budesonide_any    176 (23.6%)    63 (24.9%)      0.67   |
  |---------------------------------------------------------|
  | fenofibrate_any   190 (25.4%)    65 (25.7%)      0.94   |
  |---------------------------------------------------------|
  | gc_any            200 (26.8%)    61 (24.1%)      0.40   |
  |---------------------------------------------------------|
  | oca_bl            378 (50.6%)    122 (48.2%)     0.51   |
  |---------------------------------------------------------|
  | rituximab_bl      377 (50.5%)    123 (48.6%)     0.61   |
  +---------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/additional_meds_udca.csv, replace
(note: file ./output/tables/additional_meds_udca.csv not found)
file ./output/tables/additional_meds_udca.csv saved

. * Rounding numbers in table to nearest 5
. destring _columna_1, gen(n1) force
_columna_1: contains nonnumeric characters; n1 generated as int
(2 missing values generated)

. destring _columna_0, gen(n0) force
_columna_0: contains nonnumeric characters; n0 generated as int
(2 missing values generated)

. destring _columnb_1, gen(percent1) ignore("-" "%" "(" ")")  force
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)

. destring _columnb_0, gen(percent0) ignore("-" "%" "(" ")")  force
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)

. gen rounded_n1 = round(n1, 5)
(2 missing values generated)

. gen rounded_n0 = round(n0, 5)
(2 missing values generated)

. keep factor rounded_n0 percent0 rounded_n1 percent1

. export delimited using ./output/tables/additional_meds_udca_rounded.csv
file ./output/tables/additional_meds_udca_rounded.csv saved

. restore 

. 
. 
. 
. 
end of do-file

. . file open output using "/tmp/103_baseline_tables.do.b8iP.out", write text r
> eplace

. . file write output "success" 

. . file close output

. 
end of do-file


