
. 
. import delimited using ./output/input_pbc.csv, clear
(109 vars, 1,000 obs)

. 
. * Prepare variables for table 
. replace ethnicity=6 if ethnicity==0
(55 real changes made)

. label define eth5                       1 "White"                            
>            ///
>                             2 "Mixed"                           ///          
>                                    
>                             3 "Asian"                                   ///
>                             4 "Black"                                   ///
>                             5 "Other"                                   ///
>                             6 "Unknown"

.                     
. 
. label values ethnicity eth5

. safetab ethnicity, m
10

  ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |        137       13.70       13.70
      Mixed |        206       20.60       34.30
      Asian |        225       22.50       56.80
      Black |        177       17.70       74.50
      Other |        200       20.00       94.50
    Unknown |         55        5.50      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. *(2) IMD
. replace imd=6 if imd==0
(47 real changes made)

. 
. * Create age categories
. egen age_cat = cut(age), at(18, 40, 60, 80, 120) icodes
(230 missing values generated)

. label define age 0 "18 - 40 years" 1 "41 - 60 years" 2 "61 - 80 years" 3 ">80
>  years"

. label values age_cat age

. bys age_cat: sum age

-------------------------------------------------------------------------------
-> age_cat = 18 - 40 years

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        294    29.39456    6.219048         18         39

-------------------------------------------------------------------------------
-> age_cat = 41 - 60 years

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        232    49.61207    5.473702         40         59

-------------------------------------------------------------------------------
-> age_cat = 61 - 80 years

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        192    68.14583    5.715743         60         79

-------------------------------------------------------------------------------
-> age_cat = >80 years

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |         52    84.86538    4.077816         80         95

-------------------------------------------------------------------------------
-> age_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        230    8.308696    4.895004          0         17


. 
. * BMI categories
. * assume BMI's less than 10 are incorrect and set to missing 
. sum bmi, d

                             bmi
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,000
25%     16.60778              0       Sum of Wgt.       1,000

50%      25.6845                      Mean           22.72443
                        Largest       Std. Dev.      13.42281
75%     32.45396       49.63896
90%      37.5406       50.48814       Variance       180.1718
95%     41.11365       50.64924       Skewness      -.5297416
99%     47.62017       52.83505       Kurtosis       2.287056

. replace bmi = . if bmi<10
(206 real changes made, 206 to missing)

. egen bmi_cat = cut(bmi), at(0, 1, 18.5, 24.9, 29.9, 39.9, 100) icodes
(206 missing values generated)

. bys bmi_cat: sum bmi

-------------------------------------------------------------------------------
-> bmi_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |         82    15.64375    2.288443   10.31201   18.47222

-------------------------------------------------------------------------------
-> bmi_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        189    22.07299    1.754937   18.53326   24.89909

-------------------------------------------------------------------------------
-> bmi_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        195     27.6185     1.43103   24.92195   29.88546

-------------------------------------------------------------------------------
-> bmi_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        264    34.23555    2.686642   29.91033    39.8931

-------------------------------------------------------------------------------
-> bmi_cat = 5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |         64    43.61569    3.053526   39.94916   52.83505

-------------------------------------------------------------------------------
-> bmi_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |          0


. * add missing . to zero category
. replace bmi_cat = 0 if bmi_cat==. 
(206 real changes made)

. label define bmi 0 "Missing" 1 "Underweight" 2 "Healthy range" 3 "Overweight"
>  4 "Obese" 5 "Morbidly obese"

. label values bmi_cat bmi

. 
. * Smoking status
. gen smoking = 0 if smoking_status=="N"
(886 missing values generated)

. replace smoking = 1 if smoking_status=="S"
(187 real changes made)

. replace smoking = 2 if smoking_status=="E"
(155 real changes made)

. replace smoking = 3 if smoking==.
(544 real changes made)

. 
. label define smok 1 "Current smoker" 2 "Ex-smoker" 0 "Never smoked" 3 "Unknow
> n"

. label values smoking smok

. 
. replace oral_steroid_drugs_nhsd=. if oral_steroid_drug_nhsd_3m_count < 2 & or
> al_steroid_drug_nhsd_12m_count < 4
(935 real changes made, 935 to missing)

. gen imid_nhsd=max(oral_steroid_drugs_nhsd, immunosuppresant_drugs_nhsd)

. gen rare_neuro_nhsd = max(multiple_sclerosis_nhsd, motor_neurone_disease_nhsd
> , myasthenia_gravis_nhsd, huntingtons_disease_nhsd)

. gen solid_organ_transplant_bin = solid_organ_transplant_nhsd_new!=""

. gen any_high_risk_condition = max(learning_disability_nhsd_snomed, cancer_ope
> nsafely_snomed_new, haematological_disease_nhsd, ///
> ckd_stage_5_nhsd, imid_nhsd, immunosupression_nhsd_new, hiv_aids_nhsd, solid_
> organ_transplant_bin, rare_neuro_nhsd)

. 
. foreach var in udca gc budesonide fenofibrate {
  2.     sum `var'_count_bl, d
  3.     sum `var'_count_fu, d 
  4.     gen `var'_any = (`var'_count_fu>=1 & `var'_count_fu!=.)
  5.     gen `var'_bl = (`var'_count_bl>=1 & `var'_count_bl!=.)
  6.     tab `var'_any, m 
  7.     tab `var'_bl, m
  8. }

                        udca_count_bl
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -.5             -2
 5%            0             -1
10%            0             -1       Obs               1,000
25%            0             -1       Sum of Wgt.       1,000

50%            0                      Mean               .775
                        Largest       Std. Dev.      1.578248
75%            1              7
90%            3              7       Variance       2.490866
95%            5              7       Skewness        1.97234
99%            6              8       Kurtosis       6.064013

                        udca_count_fu
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -2
 5%            0             -2
10%            0             -1       Obs               1,000
25%            0             -1       Sum of Wgt.       1,000

50%            0                      Mean               .767
                        Largest       Std. Dev.      1.526775
75%            1              7
90%            3              7       Variance       2.331042
95%            4              7       Skewness       1.890292
99%            6              7       Kurtosis        5.70436

   udca_any |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        744       74.40       74.40
          1 |        256       25.60      100.00
------------+-----------------------------------
      Total |      1,000      100.00

    udca_bl |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        749       74.90       74.90
          1 |        251       25.10      100.00
------------+-----------------------------------
      Total |      1,000      100.00

                         gc_count_bl
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -2
 5%            0             -1
10%            0             -1       Obs               1,000
25%            0             -1       Sum of Wgt.       1,000

50%            0                      Mean               .728
                        Largest       Std. Dev.      1.516679
75%            0              7
90%            3              7       Variance       2.300316
95%            4              8       Skewness       2.086716
99%            6              8       Kurtosis        6.79952

                         gc_count_fu
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -3
 5%            0             -1
10%            0             -1       Obs               1,000
25%            0             -1       Sum of Wgt.       1,000

50%            0                      Mean               .808
                        Largest       Std. Dev.      1.633341
75%            1              7
90%            3              7       Variance       2.667804
95%            5              8       Skewness       1.989978
99%          6.5              8       Kurtosis       6.186817

     gc_any |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        745       74.50       74.50
          1 |        255       25.50      100.00
------------+-----------------------------------
      Total |      1,000      100.00

      gc_bl |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        758       75.80       75.80
          1 |        242       24.20      100.00
------------+-----------------------------------
      Total |      1,000      100.00

                     budesonide_count_bl
-------------------------------------------------------------
      Percentiles      Smallest
 1%           -1             -2
 5%            0             -2
10%            0             -2       Obs               1,000
25%            0             -2       Sum of Wgt.       1,000

50%            0                      Mean               .776
                        Largest       Std. Dev.       1.65365
75%            0              8
90%            3              8       Variance       2.734559
95%            5              9       Skewness       2.150731
99%            7              9       Kurtosis       7.284354

                     budesonide_count_fu
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -1
 5%            0             -1
10%            0             -1       Obs               1,000
25%            0             -1       Sum of Wgt.       1,000

50%            0                      Mean               .779
                        Largest       Std. Dev.      1.569274
75%           .5              7
90%            3              7       Variance       2.462622
95%            5              7       Skewness       1.941798
99%            6              7       Kurtosis       5.763248

budesonide_ |
        any |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        750       75.00       75.00
          1 |        250       25.00      100.00
------------+-----------------------------------
      Total |      1,000      100.00

budesonide_ |
         bl |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        751       75.10       75.10
          1 |        249       24.90      100.00
------------+-----------------------------------
      Total |      1,000      100.00

                    fenofibrate_count_bl
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -3
 5%            0             -2
10%            0             -1       Obs               1,000
25%            0             -1       Sum of Wgt.       1,000

50%            0                      Mean               .791
                        Largest       Std. Dev.      1.586769
75%            1              7
90%            3              8       Variance       2.517837
95%            4              8       Skewness          1.929
99%            6              8       Kurtosis        6.04522

                    fenofibrate_count_fu
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -1
 5%            0              0
10%            0              0       Obs               1,000
25%            0              0       Sum of Wgt.       1,000

50%            0                      Mean               .841
                        Largest       Std. Dev.       1.64573
75%            1              7
90%            3              8       Variance       2.708427
95%            5              8       Skewness       1.972664
99%            6              8       Kurtosis       6.069159

fenofibrate |
       _any |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        738       73.80       73.80
          1 |        262       26.20      100.00
------------+-----------------------------------
      Total |      1,000      100.00

fenofibrate |
        _bl |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        745       74.50       74.50
          1 |        255       25.50      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. 
. * Generate variable with number of vaccinations 
. foreach var in covid_vacc_first covid_vacc_second covid_vacc_third covid_vacc
> _fourth covid_vacc_fifth {
  2.     gen `var'= (`var'_date!="")    
  3. }

. 
. egen vacc_any = rowmax(covid_vacc_first covid_vacc_second covid_vacc_third co
> vid_vacc_fourth covid_vacc_fifth)

. egen total_vaccs = rowtotal(covid_vacc_first covid_vacc_second covid_vacc_thi
> rd covid_vacc_fourth covid_vacc_fifth)

. tab total_vaccs 

total_vaccs |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          5        0.50        0.50
          1 |         70        7.00        7.50
          2 |        294       29.40       36.90
          3 |        404       40.40       77.30
          4 |        203       20.30       97.60
          5 |         24        2.40      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. 
. gen severe_disease_fu = severe_disease_fu_date!=""

. 
. * Time from most recent vaccination on 1st March 2021
. gen date_most_recent_cov_vacA = date(date_most_recent_cov_vac, "YMD")
(961 missing values generated)

. gen time_vacc = date("01Mar2021", "DMY") - date_most_recent_cov_vacA
(961 missing values generated)

. sum time_vacc, d

                          time_vacc
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            2              2
10%            6              4       Obs                  39
25%           17              6       Sum of Wgt.          39

50%           33                      Mean           29.92308
                        Largest       Std. Dev.      17.07473
75%           42             56
90%           56             57       Variance       291.5466
95%           59             59       Skewness       .0906015
99%           61             61       Kurtosis        1.94112

. xtile time_vacc_cat = time_vacc, nq(4)

. bys time_vacc_cat: sum time_vacc 

-------------------------------------------------------------------------------
-> time_vacc_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   time_vacc |         11    10.18182    6.242086          1         17

-------------------------------------------------------------------------------
-> time_vacc_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   time_vacc |         12    25.08333    6.542981         18         33

-------------------------------------------------------------------------------
-> time_vacc_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   time_vacc |          7    40.42857    1.718249         38         42

-------------------------------------------------------------------------------
-> time_vacc_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   time_vacc |          9    52.33333    6.519202         44         61

-------------------------------------------------------------------------------
-> time_vacc_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   time_vacc |          0


. 
. * Create tables 
. * Characteristics whole cohort
. preserve

. table1_mc, vars(age_cat cat \ sex cat \ imd cat \ ethnicity cat \ severe_dise
> ase_bl cat \ smoking cat \ bmi_cat cat \ has_pbc bin \ ///
> any_high_risk_condition cat) clear

  +---------------------------------------+
  | factor                      N_1   m_1 |
  |---------------------------------------|
  | age_cat                     770   230 |
  |---------------------------------------|
  | sex                       1,000     0 |
  |---------------------------------------|
  | imd                       1,000     0 |
  |---------------------------------------|
  | ethnicity                 1,000     0 |
  |---------------------------------------|
  | severe_disease_bl         1,000     0 |
  |---------------------------------------|
  | smoking                   1,000     0 |
  |---------------------------------------|
  | bmi_cat                   1,000     0 |
  |---------------------------------------|
  | has_pbc                   1,000     0 |
  |---------------------------------------|
  | any_high_risk_condition   1,000     0 |
  +---------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +-----------------------------------------------------------+
  |                                            Total          |
  |-----------------------------------------------------------|
  |                                            N=1,000        |
  |-----------------------------------------------------------|
  | age_cat                   18 - 40 years    294 (38.2%)    |
  |                           41 - 60 years    232 (30.1%)    |
  |                           61 - 80 years    192 (24.9%)    |
  |                           >80 years        52 ( 6.8%)     |
  |-----------------------------------------------------------|
  | sex                       F                502 (50.2%)    |
  |                           M                489 (48.9%)    |
  |                           U                9 ( 0.9%)      |
  |-----------------------------------------------------------|
  | imd                       1                200 (20.0%)    |
  |                           2                203 (20.3%)    |
  |                           3                207 (20.7%)    |
  |                           4                169 (16.9%)    |
  |                           5                174 (17.4%)    |
  |                           6                47 ( 4.7%)     |
  |-----------------------------------------------------------|
  | ethnicity                 White            137 (13.7%)    |
  |                           Mixed            206 (20.6%)    |
  |                           Asian            225 (22.5%)    |
  |                           Black            177 (17.7%)    |
  |                           Other            200 (20.0%)    |
  |                           Unknown          55 ( 5.5%)     |
  |-----------------------------------------------------------|
  | severe_disease_bl         0                500 (50.0%)    |
  |                           1                500 (50.0%)    |
  |-----------------------------------------------------------|
  | smoking                   Never smoked     114 (11.4%)    |
  |                           Current smoker   187 (18.7%)    |
  |                           Ex-smoker        155 (15.5%)    |
  |                           Unknown          544 (54.4%)    |
  |-----------------------------------------------------------|
  | bmi_cat                   Missing          206 (20.6%)    |
  |                           Underweight      82 ( 8.2%)     |
  |                           Healthy range    189 (18.9%)    |
  |                           Overweight       195 (19.5%)    |
  |                           Obese            264 (26.4%)    |
  |                           Morbidly obese   64 ( 6.4%)     |
  |-----------------------------------------------------------|
  | has_pbc                                    500 (50.0%)    |
  |-----------------------------------------------------------|
  | any_high_risk_condition   1                1,000 (100.0%) |
  +-----------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/baseline_table.csv, replace
(note: file ./output/tables/baseline_table.csv not found)
file ./output/tables/baseline_table.csv saved

. * Rounding numbers in table to nearest 5
. destring _columna_1, gen(n) ignore(",") force
_columna_1: contains nonnumeric characters not specified in ignore()
_columna_1: character , removed; n generated as int
(2 missing values generated)

. destring _columnb_1, gen(percent) ignore("-" "%" "(" ")")  force
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent generated as double
(2 missing values generated)

. gen rounded_n = round(n, 5)
(2 missing values generated)

. tostring rounded_n, gen(n_rounded)
n_rounded generated as str4

. replace n_rounded = "redacted" if (rounded_n<=5)
(0 real changes made)

. keep factor level n_rounded percent

. export delimited using ./output/tables/baseline_table_rounded.csv
file ./output/tables/baseline_table_rounded.csv saved

. restore 

. 
. * High risk conditions
. preserve

. table1_mc, vars(learning_disability_nhsd_snomed cat \ cancer_opensafely_snome
> d_new cat \ haematological_disease_nhsd cat \ ///
> ckd_stage_5_nhsd cat \ imid_nhsd cat \ immunosupression_nhsd_new cat \ hiv_ai
> ds_nhsd cat \ solid_organ_transplant_bin cat \  ///
> rare_neuro_nhsd cat) clear

  +-----------------------------------------------+
  | factor                              N_1   m_1 |
  |-----------------------------------------------|
  | learning_disability_nhsd_snomed   1,000     0 |
  |-----------------------------------------------|
  | cancer_opensafely_snomed_new      1,000     0 |
  |-----------------------------------------------|
  | haematological_disease_nhsd       1,000     0 |
  |-----------------------------------------------|
  | ckd_stage_5_nhsd                  1,000     0 |
  |-----------------------------------------------|
  | imid_nhsd                         1,000     0 |
  |-----------------------------------------------|
  | immunosupression_nhsd_new         1,000     0 |
  |-----------------------------------------------|
  | hiv_aids_nhsd                     1,000     0 |
  |-----------------------------------------------|
  | solid_organ_transplant_bin        1,000     0 |
  |-----------------------------------------------|
  | rare_neuro_nhsd                   1,000     0 |
  +-----------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +-------------------------------------------------------+
  |                                           Total       |
  |-------------------------------------------------------|
  |                                           N=1,000     |
  |-------------------------------------------------------|
  | learning_disability_nhsd_snomed   0       500 (50.0%) |
  |                                   1       500 (50.0%) |
  |-------------------------------------------------------|
  | cancer_opensafely_snomed_new      0       500 (50.0%) |
  |                                   1       500 (50.0%) |
  |-------------------------------------------------------|
  | haematological_disease_nhsd       0       17 ( 1.7%)  |
  |                                   1       983 (98.3%) |
  |-------------------------------------------------------|
  | ckd_stage_5_nhsd                  0       242 (24.2%) |
  |                                   1       758 (75.8%) |
  |-------------------------------------------------------|
  | imid_nhsd                         0       485 (48.5%) |
  |                                   1       515 (51.5%) |
  |-------------------------------------------------------|
  | immunosupression_nhsd_new         0       500 (50.0%) |
  |                                   1       500 (50.0%) |
  |-------------------------------------------------------|
  | hiv_aids_nhsd                     0       762 (76.2%) |
  |                                   1       238 (23.8%) |
  |-------------------------------------------------------|
  | solid_organ_transplant_bin        0       485 (48.5%) |
  |                                   1       515 (51.5%) |
  |-------------------------------------------------------|
  | rare_neuro_nhsd                   0       3 ( 0.3%)   |
  |                                   1       997 (99.7%) |
  +-------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/high_risk.csv, replace
(note: file ./output/tables/high_risk.csv not found)
file ./output/tables/high_risk.csv saved

. * Rounding numbers in table to nearest 5
. destring _columna_1, gen(n) ignore(",") force
_columna_1: contains nonnumeric characters not specified in ignore(); n generat
> ed as int
(2 missing values generated)

. destring _columnb_1, gen(percent) ignore("-" "%" "(" ")")  force
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent generated as double
(2 missing values generated)

. gen rounded_n = round(n, 5)
(2 missing values generated)

. tostring rounded_n, gen(n_rounded)
n_rounded generated as str3

. replace n_rounded = "redacted" if (rounded_n<=5)
variable n_rounded was str3 now str8
(1 real change made)

. keep factor level n_rounded percent

. export delimited using ./output/tables/high_risk_rounded.csv
file ./output/tables/high_risk_rounded.csv saved

. restore 

. 
. * Characteristics by exposure status at baseline 
. preserve 

. table1_mc, vars(age_cat cat \ sex cat \ imd cat \ ethnicity cat \ severe_dise
> ase_bl cat \ smoking cat \ bmi_cat cat \ has_pbc bin \ any_high_risk_conditio
> n cat) by(udca_bl) clear

  +-------------------------------------------------+
  | factor                    N_0   N_1   m_0   m_1 |
  |-------------------------------------------------|
  | age_cat                   577   193   172    58 |
  |-------------------------------------------------|
  | sex                       749   251     0     0 |
  |-------------------------------------------------|
  | imd                       749   251     0     0 |
  |-------------------------------------------------|
  | ethnicity                 749   251     0     0 |
  |-------------------------------------------------|
  | severe_disease_bl         749   251     0     0 |
  |-------------------------------------------------|
  | smoking                   749   251     0     0 |
  |-------------------------------------------------|
  | bmi_cat                   749   251     0     0 |
  |-------------------------------------------------|
  | has_pbc                   749   251     0     0 |
  |-------------------------------------------------|
  | any_high_risk_condition   749   251     0     0 |
  +-------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> ------+
  |                                            udca_bl = 0    udca_bl = 1    p-
> value |
  |----------------------------------------------------------------------------
> ------|
  |                                            N=749          N=251            
>       |
  |----------------------------------------------------------------------------
> ------|
  | age_cat                   18 - 40 years    228 (39.5%)    66 (34.2%)      0
> .48   |
  |                           41 - 60 years    174 (30.2%)    58 (30.1%)       
>       |
  |                           61 - 80 years    137 (23.7%)    55 (28.5%)       
>       |
  |                           >80 years        38 ( 6.6%)     14 ( 7.3%)       
>       |
  |----------------------------------------------------------------------------
> ------|
  | sex                       F                364 (48.6%)    138 (55.0%)     0
> .16   |
  |                           M                377 (50.3%)    112 (44.6%)      
>       |
  |                           U                8 ( 1.1%)      1 ( 0.4%)        
>       |
  |----------------------------------------------------------------------------
> ------|
  | imd                       1                153 (20.4%)    47 (18.7%)      0
> .38   |
  |                           2                140 (18.7%)    63 (25.1%)       
>       |
  |                           3                158 (21.1%)    49 (19.5%)       
>       |
  |                           4                131 (17.5%)    38 (15.1%)       
>       |
  |                           5                133 (17.8%)    41 (16.3%)       
>       |
  |                           6                34 ( 4.5%)     13 ( 5.2%)       
>       |
  |----------------------------------------------------------------------------
> ------|
  | ethnicity                 White            100 (13.4%)    37 (14.7%)      0
> .22   |
  |                           Mixed            150 (20.0%)    56 (22.3%)       
>       |
  |                           Asian            162 (21.6%)    63 (25.1%)       
>       |
  |                           Black            134 (17.9%)    43 (17.1%)       
>       |
  |                           Other            155 (20.7%)    45 (17.9%)       
>       |
  |                           Unknown          48 ( 6.4%)     7 ( 2.8%)        
>       |
  |----------------------------------------------------------------------------
> ------|
  | severe_disease_bl         0                370 (49.4%)    130 (51.8%)     0
> .51   |
  |                           1                379 (50.6%)    121 (48.2%)      
>       |
  |----------------------------------------------------------------------------
> ------|
  | smoking                   Never smoked     82 (10.9%)     32 (12.7%)      0
> .47   |
  |                           Current smoker   135 (18.0%)    52 (20.7%)       
>       |
  |                           Ex-smoker        114 (15.2%)    41 (16.3%)       
>       |
  |                           Unknown          418 (55.8%)    126 (50.2%)      
>       |
  |----------------------------------------------------------------------------
> ------|
  | bmi_cat                   Missing          152 (20.3%)    54 (21.5%)      0
> .27   |
  |                           Underweight      67 ( 8.9%)     15 ( 6.0%)       
>       |
  |                           Healthy range    147 (19.6%)    42 (16.7%)       
>       |
  |                           Overweight       139 (18.6%)    56 (22.3%)       
>       |
  |                           Obese            192 (25.6%)    72 (28.7%)       
>       |
  |                           Morbidly obese   52 ( 6.9%)     12 ( 4.8%)       
>       |
  |----------------------------------------------------------------------------
> ------|
  | has_pbc                                    388 (51.8%)    112 (44.6%)     0
> .049  |
  |----------------------------------------------------------------------------
> ------|
  | any_high_risk_condition   1                749 (100.0%)   251 (100.0%)     
>       |
  +----------------------------------------------------------------------------
> ------+
Data are presented as n (%).
 

. export delimited using ./output/tables/baseline_table_udca.csv, replace
(note: file ./output/tables/baseline_table_udca.csv not found)
file ./output/tables/baseline_table_udca.csv saved

. * Rounding numbers in table to nearest 5
. forvalues i=0/1 {   
  2.     destring _columna_`i', gen(n`i') ignore(",") force
  3.     destring _columnb_`i', gen(percent`i') ignore("-" "%" "(" ")")  force
  4.     gen rounded_n`i' = round(n`i', 5)
  5.     tostring percent`i', gen(percent_`i')
  6.     tostring rounded_n`i', gen(n`i'_rounded)
  7.     replace n`i'_rounded = "redacted" if (rounded_n`i'<=5)
  8.     replace percent_`i' = "redacted" if (rounded_n`i'<=5)
  9. }
_columna_0: contains nonnumeric characters not specified in ignore(); n0 genera
> ted as int
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
(2 missing values generated)
percent_0 generated as str4
n0_rounded generated as str3
(0 real changes made)
(0 real changes made)
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as int
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)
(2 missing values generated)
percent_1 generated as str4
n1_rounded generated as str3
variable n1_rounded was str3 now str8
(2 real changes made)
variable percent_1 was str4 now str8
(2 real changes made)

. keep factor level n0_rounded percent_0 n1_rounded percent_1

. export delimited using ./output/tables/baseline_table_udca_rounded.csv
file ./output/tables/baseline_table_udca_rounded.csv saved

. restore 

. 
. * Additional medications by any exposure
. preserve 

. table1_mc, vars(budesonide_bl bin \ fenofibrate_bl bin \ gc_bl bin \ oca_bl b
> in \ rituximab_bl bin \ severe_disease_fu bin \ vacc_any bin  \ total_vaccs c
> at \ time_vacc_cat cat) by(udca_bl) clear

  +--------------------------------------------------+
  | factor                     N_0   N_1   m_0   m_1 |
  |--------------------------------------------------|
  | budesonide_bl              749   251     0     0 |
  |--------------------------------------------------|
  | fenofibrate_bl             749   251     0     0 |
  |--------------------------------------------------|
  | gc_bl                      749   251     0     0 |
  |--------------------------------------------------|
  | oca_bl                     749   251     0     0 |
  |--------------------------------------------------|
  | rituximab_bl               749   251     0     0 |
  |--------------------------------------------------|
  | severe_disease_fu          749   251     0     0 |
  |--------------------------------------------------|
  | vacc_any                   749   251     0     0 |
  |--------------------------------------------------|
  | total_vaccs                749   251     0     0 |
  |--------------------------------------------------|
  | 4 quantiles of time_vacc    32     7   717   244 |
  +--------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +------------------------------------------------------------------------+
  |                                    udca_bl = 0   udca_bl = 1   p-value |
  |------------------------------------------------------------------------|
  |                                    N=749         N=251                 |
  |------------------------------------------------------------------------|
  | budesonide_bl                      184 (24.6%)   65 (25.9%)     0.67   |
  |------------------------------------------------------------------------|
  | fenofibrate_bl                     190 (25.4%)   65 (25.9%)     0.87   |
  |------------------------------------------------------------------------|
  | gc_bl                              181 (24.2%)   61 (24.3%)     0.96   |
  |------------------------------------------------------------------------|
  | oca_bl                             378 (50.5%)   122 (48.6%)    0.61   |
  |------------------------------------------------------------------------|
  | rituximab_bl                       392 (52.3%)   108 (43.0%)    0.011  |
  |------------------------------------------------------------------------|
  | severe_disease_fu                  563 (75.2%)   182 (72.5%)    0.40   |
  |------------------------------------------------------------------------|
  | vacc_any                           745 (99.5%)   250 (99.6%)    0.79   |
  |------------------------------------------------------------------------|
  | total_vaccs                0       4 ( 0.5%)     1 ( 0.4%)      0.72   |
  |                            1       57 ( 7.6%)    13 ( 5.2%)            |
  |                            2       223 (29.8%)   71 (28.3%)            |
  |                            3       299 (39.9%)   105 (41.8%)           |
  |                            4       147 (19.6%)   56 (22.3%)            |
  |                            5       19 ( 2.5%)    5 ( 2.0%)             |
  |------------------------------------------------------------------------|
  | 4 quantiles of time_vacc   1       9 (28%)       2 (29%)        0.84   |
  |                            2       10 (31%)      2 (29%)               |
  |                            3       5 (16%)       2 (29%)               |
  |                            4       8 (25%)       1 (14%)               |
  +------------------------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/additional_meds_udca.csv, replace
(note: file ./output/tables/additional_meds_udca.csv not found)
file ./output/tables/additional_meds_udca.csv saved

. * Rounding numbers in table to nearest 5
. forvalues i=0/1 {   
  2.     destring _columna_`i', gen(n`i') ignore(",") force
  3.     destring _columnb_`i', gen(percent`i') ignore("-" "%" "(" ")")  force
  4.     gen rounded_n`i' = round(n`i', 5)
  5.     tostring rounded_n`i', gen(n`i'_rounded)
  6.     tostring percent`i', gen(percent_`i')
  7.     replace n`i'_rounded = "redacted" if (rounded_n`i'<=5)
  8.     replace percent_`i' = "redacted" if (rounded_n`i'<=5)
  9. }
_columna_0: contains nonnumeric characters not specified in ignore(); n0 genera
> ted as int
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
(2 missing values generated)
n0_rounded generated as str3
percent_0 generated as str4
variable n0_rounded was str3 now str8
(2 real changes made)
variable percent_0 was str4 now str8
(2 real changes made)
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as int
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)
(2 missing values generated)
n1_rounded generated as str3
percent_1 generated as str4
variable n1_rounded was str3 now str8
(6 real changes made)
variable percent_1 was str4 now str8
(6 real changes made)

. keep factor n0_rounded percent_0 n1_rounded percent_1

. export delimited using ./output/tables/additional_meds_udca_rounded.csv
file ./output/tables/additional_meds_udca_rounded.csv saved

. restore 

. 
. * Checking outcomes 
. foreach var in died_date_ons hosp_covid_primary hosp_covid_any dereg_date liv
> er_transplant_fu_date {
  2.     gen `var'A = date(`var', "YMD")
  3.     format `var'A %dD/N/CY
  4.     drop `var'
  5.     gen yr_`var' = year(`var'A)
  6.     tab yr_`var'
  7.     replace `var'A=. if yr_`var'==2023
  8. }
(500 missing values generated)
(500 missing values generated)

yr_died_dat |
      e_ons |      Freq.     Percent        Cum.
------------+-----------------------------------
       2020 |        116       23.20       23.20
       2021 |        148       29.60       52.80
       2022 |        134       26.80       79.60
       2023 |        102       20.40      100.00
------------+-----------------------------------
      Total |        500      100.00
(102 real changes made, 102 to missing)
(900 missing values generated)
(900 missing values generated)

yr_hosp_cov |
 id_primary |      Freq.     Percent        Cum.
------------+-----------------------------------
       2020 |         18       18.00       18.00
       2021 |         32       32.00       50.00
       2022 |         36       36.00       86.00
       2023 |         14       14.00      100.00
------------+-----------------------------------
      Total |        100      100.00
(14 real changes made, 14 to missing)
(900 missing values generated)
(900 missing values generated)

yr_hosp_cov |
     id_any |      Freq.     Percent        Cum.
------------+-----------------------------------
       2020 |         24       24.00       24.00
       2021 |         22       22.00       46.00
       2022 |         30       30.00       76.00
       2023 |         24       24.00      100.00
------------+-----------------------------------
      Total |        100      100.00
(24 real changes made, 24 to missing)
(500 missing values generated)
(500 missing values generated)

yr_dereg_da |
         te |      Freq.     Percent        Cum.
------------+-----------------------------------
       2020 |        123       24.60       24.60
       2021 |        133       26.60       51.20
       2022 |        134       26.80       78.00
       2023 |        110       22.00      100.00
------------+-----------------------------------
      Total |        500      100.00
(110 real changes made, 110 to missing)
(984 missing values generated)
(984 missing values generated)

yr_liver_tr |
ansplant_fu |
      _date |      Freq.     Percent        Cum.
------------+-----------------------------------
       2020 |          3       18.75       18.75
       2021 |          7       43.75       62.50
       2022 |          3       18.75       81.25
       2023 |          3       18.75      100.00
------------+-----------------------------------
      Total |         16      100.00
(3 real changes made, 3 to missing)

. gen end_study = date("31/12/2022", "DMY")

. egen end_date = rowmin(dereg_dateA end_study died_date_onsA)

. replace died_date_onsA=. if end_date<died_date_onsA
(75 real changes made, 75 to missing)

. replace died_ons_covid_flag_any=0 if end_date<died_date_onsA & died_ons_covid
> _flag_any==1
(335 real changes made)

. replace hosp_covid_anyA=. if end_date<hosp_covid_anyA
(19 real changes made, 19 to missing)

. 
. 
. * Flag if died
. gen died_flag = died_date_onsA!=.

. * Generate date if died of covid
. gen died_date_ons_covid = died_date_onsA if died_ons_covid_flag_any == 1
(835 missing values generated)

. 
. * Flag hospitalised with covid 
. gen hosp_any_flag = hosp_covid_anyA!=.

. 
. * Composite outcome 
. gen hosp_died = (died_ons_covid_flag_any==1 | hosp_any_flag==1)

. tab hosp_died

  hosp_died |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        786       78.60       78.60
          1 |        214       21.40      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. egen hosp_died_dateA = rowmin(died_date_onsA hosp_covid_anyA)
(634 missing values generated)

. replace hosp_died_dateA=. if hosp_died==0
(152 real changes made, 152 to missing)

. sum hosp_died_dateA

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hosp_died_~A |        214    22436.56    297.9779      21982      23007

. * Generate flag of how met composite outcome 
. di "Number where died before hospitalisation date - should be zero"
Number where died before hospitalisation date - should be zero

. count if died_date_onsA<hosp_covid_anyA & hosp_covid_anyA!=.
  0

. di "Number where have both hospitalisation and death date" 
Number where have both hospitalisation and death date

. count if died_date_onsA!=. & hosp_covid_anyA!=.
  14

. 
. gen composite_make_up = hosp_died 

. replace composite_make_up = 2 if died_ons_covid_flag_any==1 & hosp_any_flag==
> 0
(157 real changes made)

. label define comp 0 "No outcome" 1 "Hospitalised" 2 "Died"

. label values composite_make_up comp 

. * Check 
. count if composite_make_up==1 & hosp_covid_anyA==. 
  0

. count if composite_make_up==1 & hosp_died_dateA!=hosp_covid_anyA
  0

. count if composite_make_up==2 & died_date_onsA==. 
  0

. count if composite_make_up==2 & hosp_died_dateA!=died_date_onsA
  0

. tab composite_make_up died_ons_covid_flag_any

             | died_ons_covid_flag_a
composite_ma |          ny
       ke_up |         0          1 |     Total
-------------+----------------------+----------
  No outcome |       786          0 |       786 
Hospitalised |        49          8 |        57 
        Died |         0        157 |       157 
-------------+----------------------+----------
       Total |       835        165 |     1,000 

. tab composite_make_up hosp_any_flag

composite_ma |     hosp_any_flag
       ke_up |         0          1 |     Total
-------------+----------------------+----------
  No outcome |       786          0 |       786 
Hospitalised |         0         57 |        57 
        Died |       157          0 |       157 
-------------+----------------------+----------
       Total |       943         57 |     1,000 

. tab udca_bl died_ons_covid_flag_any

           | died_ons_covid_flag_a
           |          ny
   udca_bl |         0          1 |     Total
-----------+----------------------+----------
         0 |       623        126 |       749 
         1 |       212         39 |       251 
-----------+----------------------+----------
     Total |       835        165 |     1,000 

. tab udca_bl hosp_any_flag

           |     hosp_any_flag
   udca_bl |         0          1 |     Total
-----------+----------------------+----------
         0 |       709         40 |       749 
         1 |       234         17 |       251 
-----------+----------------------+----------
     Total |       943         57 |     1,000 

. 
. * check number of outcomes per ethnicity group 
. tab ethnicity died_ons_covid_flag_any

           | died_ons_covid_flag_a
           |          ny
 ethnicity |         0          1 |     Total
-----------+----------------------+----------
     White |       113         24 |       137 
     Mixed |       175         31 |       206 
     Asian |       187         38 |       225 
     Black |       151         26 |       177 
     Other |       163         37 |       200 
   Unknown |        46          9 |        55 
-----------+----------------------+----------
     Total |       835        165 |     1,000 

. tab ethnicity hosp_any_flag

           |     hosp_any_flag
 ethnicity |         0          1 |     Total
-----------+----------------------+----------
     White |       131          6 |       137 
     Mixed |       196         10 |       206 
     Asian |       207         18 |       225 
     Black |       167         10 |       177 
     Other |       191          9 |       200 
   Unknown |        51          4 |        55 
-----------+----------------------+----------
     Total |       943         57 |     1,000 

. 
. * Number of outcomes within each time period: pre-vaccination of most populat
> ion - prior to 1st March 2021 and after
. 
. gen composite_pre = hosp_died_dateA < date("01Mar2021", "DMY")

. replace composite_pre = 0 if hosp_died_dateA==. 
(0 real changes made)

. tab hosp_died composite_pre 

           |     composite_pre
 hosp_died |         0          1 |     Total
-----------+----------------------+----------
         0 |       786          0 |       786 
         1 |       128         86 |       214 
-----------+----------------------+----------
     Total |       914         86 |     1,000 

. 
. gen died_pre = died_date_onsA < date("01Mar2021", "DMY")

. replace died_pre = . if died_date_onsA==. | died_ons_covid_flag_any==0
(835 real changes made, 835 to missing)

. tab died_ons_covid_flag_any died_pre 

died_ons_c |
ovid_flag_ |       died_pre
       any |         0          1 |     Total
-----------+----------------------+----------
         1 |       107         58 |       165 
-----------+----------------------+----------
     Total |       107         58 |       165 

. 
. gen hosp_pre = hosp_covid_anyA < date("01Mar2021", "DMY")

. replace hosp_pre = . if hosp_covid_anyA==.
(943 real changes made, 943 to missing)

. tab hosp_any_flag hosp_pre 

hosp_any_f |       hosp_pre
       lag |         0          1 |     Total
-----------+----------------------+----------
         1 |        28         29 |        57 
-----------+----------------------+----------
     Total |        28         29 |        57 

. 
. gen composite_post = hosp_died_dateA >= date("01Mar2021", "DMY") & hosp_died_
> dateA!=.

. replace composite_post = 0 if hosp_died_dateA==.
(0 real changes made)

. tab hosp_died composite_post 

           |    composite_post
 hosp_died |         0          1 |     Total
-----------+----------------------+----------
         0 |       786          0 |       786 
         1 |        86        128 |       214 
-----------+----------------------+----------
     Total |       872        128 |     1,000 

. 
. gen died_post = died_date_onsA >= date("01Mar2021", "DMY") & died_date_onsA!=
> .

. replace died_post = . if died_date_onsA==. | died_ons_covid_flag_any==0
(835 real changes made, 835 to missing)

. tab died_ons_covid_flag_any died_post 

died_ons_c |
ovid_flag_ |       died_post
       any |         0          1 |     Total
-----------+----------------------+----------
         1 |        58        107 |       165 
-----------+----------------------+----------
     Total |        58        107 |       165 

. 
. gen hosp_post = hosp_covid_anyA >= date("01Mar2021", "DMY") & hosp_covid_anyA
> !=.

. replace hosp_post = . if hosp_covid_anyA==.
(943 real changes made, 943 to missing)

. tab hosp_any_flag hosp_post

hosp_any_f |       hosp_post
       lag |         0          1 |     Total
-----------+----------------------+----------
         1 |        29         28 |        57 
-----------+----------------------+----------
     Total |        29         28 |        57 

. 
. * Exploring death by liver disease 
. gen died_liver_any = died_ons_liver_flag_any==1 & died_ons_covid_flag_any!=1

. gen died_liver_underlying = died_ons_liver_flag_underlying==1 & died_ons_covi
> d_flag_any!=1

. 
. * Exploring liver transplants during follow-update
. gen liver_transplant_fu = liver_transplant_fu_dateA!=.

. 
. * Check 
. count if died_liver_any==1 & died_ons_covid_flag_any==1
  0

. count if died_liver_underlying==1 & died_ons_covid_flag_any==1
  0

. 
. * Outcomes by baseline exposure stataus
. table1_mc, by(udca_bl) vars(died_ons_covid_flag_any bin \ hosp_any_flag bin \
>  hosp_died bin \ composite_make_up cat \ composite_pre bin \ ///
> died_pre bin \ hosp_pre bin \ composite_post bin \ died_post bin \ hosp_post 
> bin \ died_liver_any bin \ died_liver_underlying bin \ liver_transplant_fu bi
> n) clear

  +-------------------------------------------------+
  | factor                    N_0   N_1   m_0   m_1 |
  |-------------------------------------------------|
  | died_ons_covid_flag_any   749   251     0     0 |
  |-------------------------------------------------|
  | hosp_any_flag             749   251     0     0 |
  |-------------------------------------------------|
  | hosp_died                 749   251     0     0 |
  |-------------------------------------------------|
  | composite_make_up         749   251     0     0 |
  |-------------------------------------------------|
  | composite_pre             749   251     0     0 |
  |-------------------------------------------------|
  | died_pre                  126    39   623   212 |
  |-------------------------------------------------|
  | hosp_pre                   40    17   709   234 |
  |-------------------------------------------------|
  | composite_post            749   251     0     0 |
  |-------------------------------------------------|
  | died_post                 126    39   623   212 |
  |-------------------------------------------------|
  | hosp_post                  40    17   709   234 |
  |-------------------------------------------------|
  | died_liver_any            749   251     0     0 |
  |-------------------------------------------------|
  | died_liver_underlying     749   251     0     0 |
  |-------------------------------------------------|
  | liver_transplant_fu       749   251     0     0 |
  +-------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --+
  |                                          udca_bl = 0   udca_bl = 1   p-valu
> e |
  |----------------------------------------------------------------------------
> --|
  |                                          N=749         N=251               
>   |
  |----------------------------------------------------------------------------
> --|
  | died_ons_covid_flag_any                  126 (16.8%)   39 (15.5%)     0.64 
>   |
  |----------------------------------------------------------------------------
> --|
  | hosp_any_flag                            40 ( 5.3%)    17 ( 6.8%)     0.40 
>   |
  |----------------------------------------------------------------------------
> --|
  | hosp_died                                159 (21.2%)   55 (21.9%)     0.82 
>   |
  |----------------------------------------------------------------------------
> --|
  | composite_make_up         No outcome     590 (78.8%)   196 (78.1%)    0.69 
>   |
  |                           Hospitalised   40 ( 5.3%)    17 ( 6.8%)          
>   |
  |                           Died           119 (15.9%)   38 (15.1%)          
>   |
  |----------------------------------------------------------------------------
> --|
  | composite_pre                            61 ( 8.1%)    25 (10.0%)     0.37 
>   |
  |----------------------------------------------------------------------------
> --|
  | died_pre                                 44 (34.9%)    14 (35.9%)     0.91 
>   |
  |----------------------------------------------------------------------------
> --|
  | hosp_pre                                 18 (45%)      11 (65%)       0.17 
>   |
  |----------------------------------------------------------------------------
> --|
  | composite_post                           98 (13.1%)    30 (12.0%)     0.64 
>   |
  |----------------------------------------------------------------------------
> --|
  | died_post                                82 (65.1%)    25 (64.1%)     0.91 
>   |
  |----------------------------------------------------------------------------
> --|
  | hosp_post                                22 (55%)      6 (35%)        0.17 
>   |
  |----------------------------------------------------------------------------
> --|
  | died_liver_any                           314 (41.9%)   102 (40.6%)    0.72 
>   |
  |----------------------------------------------------------------------------
> --|
  | died_liver_underlying                    316 (42.2%)   96 (38.2%)     0.27 
>   |
  |----------------------------------------------------------------------------
> --|
  | liver_transplant_fu                      10 ( 1.3%)    3 ( 1.2%)      0.87 
>   |
  +----------------------------------------------------------------------------
> --+
Data are presented as n (%).
 

. export delimited using ./output/tables/baseline_outcomes.csv
file ./output/tables/baseline_outcomes.csv saved

. forvalues i=0/1 {   
  2.     destring _columna_`i', gen(n`i') ignore(",") force
  3.     destring _columnb_`i', gen(percent`i') ignore("-" "%" "(" ")")  force
  4.     gen rounded_n`i' = round(n`i', 5)
  5.     tostring rounded_n`i', gen(n`i'_rounded)
  6.     tostring percent`i', gen(percent_`i')
  7.     replace n`i'_rounded = "redacted" if (rounded_n`i'<=5)
  8.     replace percent_`i' = "redacted" if (rounded_n`i'<=5)
  9. }
_columna_0: contains nonnumeric characters not specified in ignore(); n0 genera
> ted as int
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
(2 missing values generated)
n0_rounded generated as str3
percent_0 generated as str4
(0 real changes made)
(0 real changes made)
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as int
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)
(2 missing values generated)
n1_rounded generated as str3
percent_1 generated as str4
variable n1_rounded was str3 now str8
(2 real changes made)
variable percent_1 was str4 now str8
(2 real changes made)

. keep factor rounded_n0 percent0 rounded_n1 percent1

. export delimited using ./output/tables/baseline_outcomes_rounded.csv
file ./output/tables/baseline_outcomes_rounded.csv saved

. 
. * Sensitivity analysis March 2021 cohort - vaccinations 
. 
. import delimited using ./output/input_vacc.csv, clear
(109 vars, 1,000 obs)

. 
. * Prepare variables for table 
. replace ethnicity=6 if ethnicity==0
(58 real changes made)

. label define eth5                       1 "White"                            
>            ///
>                             2 "Mixed"                           ///          
>                                    
>                             3 "Asian"                                   ///
>                             4 "Black"                                   ///
>                             5 "Other"                                   ///
>                             6 "Unknown"

.                     
. 
. label values ethnicity eth5

. safetab ethnicity, m
10

  ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |        154       15.40       15.40
      Mixed |        191       19.10       34.50
      Asian |        208       20.80       55.30
      Black |        177       17.70       73.00
      Other |        212       21.20       94.20
    Unknown |         58        5.80      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. *(2) IMD
. replace imd=6 if imd==0
(45 real changes made)

. 
. * Create age categories
. egen age_cat = cut(age), at(18, 40, 60, 80, 120) icodes
(219 missing values generated)

. label define age 0 "18 - 40 years" 1 "41 - 60 years" 2 "61 - 80 years" 3 ">80
>  years"

. label values age_cat age

. bys age_cat: sum age

-------------------------------------------------------------------------------
-> age_cat = 18 - 40 years

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        284     28.7007    6.132679         18         39

-------------------------------------------------------------------------------
-> age_cat = 41 - 60 years

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        271    48.92989    5.829576         40         59

-------------------------------------------------------------------------------
-> age_cat = 61 - 80 years

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        184    68.69022    5.562041         60         79

-------------------------------------------------------------------------------
-> age_cat = >80 years

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |         42    84.21429     3.27247         80         94

-------------------------------------------------------------------------------
-> age_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        219    8.164384    5.295871          0         17


. 
. * BMI categories
. * assume BMI's less than 10 are incorrect and set to missing 
. sum bmi, d

                             bmi
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,000
25%     15.69678              0       Sum of Wgt.       1,000

50%     25.34112                      Mean           22.25085
                        Largest       Std. Dev.      13.17012
75%     31.57951       48.26082
90%     36.74167       48.29522       Variance       173.4521
95%       40.371        49.0592       Skewness      -.5393152
99%     46.19471       49.22062       Kurtosis       2.270618

. replace bmi = . if bmi<10
(210 real changes made, 210 to missing)

. egen bmi_cat = cut(bmi), at(0, 1, 18.5, 24.9, 29.9, 39.9, 100) icodes
(210 missing values generated)

. bys bmi_cat: sum bmi

-------------------------------------------------------------------------------
-> bmi_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |         86    15.47231    2.297328   10.24404    18.4519

-------------------------------------------------------------------------------
-> bmi_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        187    22.12234    1.813517   18.56863   24.82433

-------------------------------------------------------------------------------
-> bmi_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        207    27.44709    1.476499   24.90044   29.83551

-------------------------------------------------------------------------------
-> bmi_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        255    33.88192    2.597619   30.01805   39.88887

-------------------------------------------------------------------------------
-> bmi_cat = 5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |         55    43.36003    2.625495   40.00311   49.22062

-------------------------------------------------------------------------------
-> bmi_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |          0


. * add missing . to zero category
. replace bmi_cat = 0 if bmi_cat==. 
(210 real changes made)

. label define bmi 0 "Missing" 1 "Underweight" 2 "Healthy range" 3 "Overweight"
>  4 "Obese" 5 "Morbidly obese"

. label values bmi_cat bmi

. 
. * Smoking status
. gen smoking = 0 if smoking_status=="N"
(908 missing values generated)

. replace smoking = 1 if smoking_status=="S"
(205 real changes made)

. replace smoking = 2 if smoking_status=="E"
(155 real changes made)

. replace smoking = 3 if smoking==.
(548 real changes made)

. 
. label define smok 1 "Current smoker" 2 "Ex-smoker" 0 "Never smoked" 3 "Unknow
> n"

. label values smoking smok

. 
. replace oral_steroid_drugs_nhsd=. if oral_steroid_drug_nhsd_3m_count < 2 & or
> al_steroid_drug_nhsd_12m_count < 4
(938 real changes made, 938 to missing)

. gen imid_nhsd=max(oral_steroid_drugs_nhsd, immunosuppresant_drugs_nhsd)

. gen rare_neuro_nhsd = max(multiple_sclerosis_nhsd, motor_neurone_disease_nhsd
> , myasthenia_gravis_nhsd, huntingtons_disease_nhsd)

. gen solid_organ_transplant_bin = solid_organ_transplant_nhsd_new!=""

. gen any_high_risk_condition = max(learning_disability_nhsd_snomed, cancer_ope
> nsafely_snomed_new, haematological_disease_nhsd, ///
> ckd_stage_5_nhsd, imid_nhsd, immunosupression_nhsd_new, hiv_aids_nhsd, solid_
> organ_transplant_bin, rare_neuro_nhsd)

. 
. foreach var in udca gc budesonide fenofibrate {
  2.     sum `var'_count_bl, d
  3.     sum `var'_count_fu, d 
  4.     gen `var'_any = (`var'_count_fu>=1 & `var'_count_fu!=.)
  5.     gen `var'_bl = (`var'_count_bl>=1 & `var'_count_bl!=.)
  6.     tab `var'_any, m 
  7.     tab `var'_bl, m
  8. }

                        udca_count_bl
-------------------------------------------------------------
      Percentiles      Smallest
 1%           -1             -4
 5%            0             -3
10%            0             -2       Obs               1,000
25%            0             -2       Sum of Wgt.       1,000

50%            0                      Mean               .724
                        Largest       Std. Dev.      1.504689
75%            1              7
90%            3              7       Variance       2.264088
95%            4              7       Skewness       1.929016
99%            6              7       Kurtosis       6.398678

                        udca_count_fu
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -3
 5%            0             -1
10%            0             -1       Obs               1,000
25%            0             -1       Sum of Wgt.       1,000

50%            0                      Mean               .763
                        Largest       Std. Dev.      1.576489
75%            1              7
90%            3              8       Variance       2.485316
95%            4              8       Skewness       2.079549
99%            6              8       Kurtosis       6.765186

   udca_any |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        747       74.70       74.70
          1 |        253       25.30      100.00
------------+-----------------------------------
      Total |      1,000      100.00

    udca_bl |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        738       73.80       73.80
          1 |        262       26.20      100.00
------------+-----------------------------------
      Total |      1,000      100.00

                         gc_count_bl
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -3
 5%            0             -2
10%            0             -1       Obs               1,000
25%            0             -1       Sum of Wgt.       1,000

50%            0                      Mean               .768
                        Largest       Std. Dev.      1.574374
75%           .5              7
90%            3              7       Variance       2.478655
95%            4              8       Skewness       1.993571
99%            6              8       Kurtosis       6.326737

                         gc_count_fu
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -3
 5%            0             -2
10%            0             -1       Obs               1,000
25%            0             -1       Sum of Wgt.       1,000

50%            0                      Mean               .796
                        Largest       Std. Dev.      1.578251
75%            1              7
90%            3              7       Variance       2.490875
95%            5              7       Skewness       1.871278
99%            6              7       Kurtosis       5.626688

     gc_any |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        738       73.80       73.80
          1 |        262       26.20      100.00
------------+-----------------------------------
      Total |      1,000      100.00

      gc_bl |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        750       75.00       75.00
          1 |        250       25.00      100.00
------------+-----------------------------------
      Total |      1,000      100.00

                     budesonide_count_bl
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -2
 5%            0             -1
10%            0             -1       Obs               1,000
25%            0             -1       Sum of Wgt.       1,000

50%            0                      Mean               .779
                        Largest       Std. Dev.      1.544845
75%            1              7
90%            3              7       Variance       2.386546
95%            4              7       Skewness       1.928793
99%            6              7       Kurtosis        5.81906

                     budesonide_count_fu
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -4
 5%            0             -3
10%            0             -2       Obs               1,000
25%            0             -2       Sum of Wgt.       1,000

50%            0                      Mean               .742
                        Largest       Std. Dev.      1.542016
75%            0              7
90%            3              7       Variance       2.377814
95%            4              8       Skewness       1.942505
99%            6              8       Kurtosis       6.394141

budesonide_ |
        any |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        751       75.10       75.10
          1 |        249       24.90      100.00
------------+-----------------------------------
      Total |      1,000      100.00

budesonide_ |
         bl |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        738       73.80       73.80
          1 |        262       26.20      100.00
------------+-----------------------------------
      Total |      1,000      100.00

                    fenofibrate_count_bl
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -3
 5%            0             -2
10%            0             -1       Obs               1,000
25%            0             -1       Sum of Wgt.       1,000

50%            0                      Mean               .779
                        Largest       Std. Dev.      1.582613
75%           .5              7
90%            3              7       Variance       2.504664
95%            5              7       Skewness       1.907727
99%            6              8       Kurtosis       5.793223

                    fenofibrate_count_fu
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -2
 5%            0             -2
10%            0             -1       Obs               1,000
25%            0             -1       Sum of Wgt.       1,000

50%            0                      Mean               .769
                        Largest       Std. Dev.      1.553078
75%            1              7
90%            3              7       Variance       2.412051
95%            4              8       Skewness       2.027332
99%            6              8       Kurtosis       6.445269

fenofibrate |
       _any |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        740       74.00       74.00
          1 |        260       26.00      100.00
------------+-----------------------------------
      Total |      1,000      100.00

fenofibrate |
        _bl |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        750       75.00       75.00
          1 |        250       25.00      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. 
. * Generate variable with number of vaccinations 
. foreach var in covid_vacc_first covid_vacc_second covid_vacc_third covid_vacc
> _fourth covid_vacc_fifth {
  2.     gen `var'= (`var'_date!="")    
  3. }

. 
. egen vacc_any = rowmax(covid_vacc_first covid_vacc_second covid_vacc_third co
> vid_vacc_fourth covid_vacc_fifth)

. egen total_vaccs = rowtotal(covid_vacc_first covid_vacc_second covid_vacc_thi
> rd covid_vacc_fourth covid_vacc_fifth)

. tab total_vaccs 

total_vaccs |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          9        0.90        0.90
          1 |         72        7.20        8.10
          2 |        277       27.70       35.80
          3 |        416       41.60       77.40
          4 |        202       20.20       97.60
          5 |         24        2.40      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. 
. gen severe_disease_fu = severe_disease_fu_date!=""

. 
. * Time from most recent vaccination on 1st March 2021
. gen date_most_recent_cov_vacA = date(date_most_recent_cov_vac, "YMD")
(939 missing values generated)

. gen time_vacc = date("01Mar2021", "DMY") - date_most_recent_cov_vacA
(939 missing values generated)

. sum time_vacc, d

                          time_vacc
-------------------------------------------------------------
      Percentiles      Smallest
 1%            2              2
 5%            4              2
10%            8              3       Obs                  61
25%           24              4       Sum of Wgt.          61

50%           41                      Mean           41.90164
                        Largest       Std. Dev.      24.83459
75%           60             84
90%           74             85       Variance       616.7568
95%           84             88       Skewness       .1138117
99%           89             89       Kurtosis       2.071786

. xtile time_vacc_cat = time_vacc, nq(4)

. bys time_vacc_cat: sum time_vacc 

-------------------------------------------------------------------------------
-> time_vacc_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   time_vacc |         16      10.375    7.098122          2         24

-------------------------------------------------------------------------------
-> time_vacc_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   time_vacc |         16     34.6875    4.269563         28         41

-------------------------------------------------------------------------------
-> time_vacc_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   time_vacc |         14        50.5    6.073271         42         60

-------------------------------------------------------------------------------
-> time_vacc_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   time_vacc |         15        75.2    8.841461         62         89

-------------------------------------------------------------------------------
-> time_vacc_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   time_vacc |          0


. 
. * Create tables 
. * Characteristics whole cohort
. preserve

. table1_mc, vars(age_cat cat \ sex cat \ imd cat \ ethnicity cat \ severe_dise
> ase_bl cat \ smoking cat \ bmi_cat cat \ has_pbc bin \ ///
> any_high_risk_condition cat) clear

  +---------------------------------------+
  | factor                      N_1   m_1 |
  |---------------------------------------|
  | age_cat                     781   219 |
  |---------------------------------------|
  | sex                       1,000     0 |
  |---------------------------------------|
  | imd                       1,000     0 |
  |---------------------------------------|
  | ethnicity                 1,000     0 |
  |---------------------------------------|
  | severe_disease_bl         1,000     0 |
  |---------------------------------------|
  | smoking                   1,000     0 |
  |---------------------------------------|
  | bmi_cat                   1,000     0 |
  |---------------------------------------|
  | has_pbc                   1,000     0 |
  |---------------------------------------|
  | any_high_risk_condition   1,000     0 |
  +---------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +-----------------------------------------------------------+
  |                                            Total          |
  |-----------------------------------------------------------|
  |                                            N=1,000        |
  |-----------------------------------------------------------|
  | age_cat                   18 - 40 years    284 (36.4%)    |
  |                           41 - 60 years    271 (34.7%)    |
  |                           61 - 80 years    184 (23.6%)    |
  |                           >80 years        42 ( 5.4%)     |
  |-----------------------------------------------------------|
  | sex                       F                523 (52.3%)    |
  |                           M                463 (46.3%)    |
  |                           U                14 ( 1.4%)     |
  |-----------------------------------------------------------|
  | imd                       1                187 (18.7%)    |
  |                           2                179 (17.9%)    |
  |                           3                203 (20.3%)    |
  |                           4                204 (20.4%)    |
  |                           5                182 (18.2%)    |
  |                           6                45 ( 4.5%)     |
  |-----------------------------------------------------------|
  | ethnicity                 White            154 (15.4%)    |
  |                           Mixed            191 (19.1%)    |
  |                           Asian            208 (20.8%)    |
  |                           Black            177 (17.7%)    |
  |                           Other            212 (21.2%)    |
  |                           Unknown          58 ( 5.8%)     |
  |-----------------------------------------------------------|
  | severe_disease_bl         0                500 (50.0%)    |
  |                           1                500 (50.0%)    |
  |-----------------------------------------------------------|
  | smoking                   Never smoked     92 ( 9.2%)     |
  |                           Current smoker   205 (20.5%)    |
  |                           Ex-smoker        155 (15.5%)    |
  |                           Unknown          548 (54.8%)    |
  |-----------------------------------------------------------|
  | bmi_cat                   Missing          210 (21.0%)    |
  |                           Underweight      86 ( 8.6%)     |
  |                           Healthy range    187 (18.7%)    |
  |                           Overweight       207 (20.7%)    |
  |                           Obese            255 (25.5%)    |
  |                           Morbidly obese   55 ( 5.5%)     |
  |-----------------------------------------------------------|
  | has_pbc                                    500 (50.0%)    |
  |-----------------------------------------------------------|
  | any_high_risk_condition   1                1,000 (100.0%) |
  +-----------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/baseline_table_vacc.csv, replace
(note: file ./output/tables/baseline_table_vacc.csv not found)
file ./output/tables/baseline_table_vacc.csv saved

. * Rounding numbers in table to nearest 5
. destring _columna_1, gen(n) ignore(",") force
_columna_1: contains nonnumeric characters not specified in ignore()
_columna_1: character , removed; n generated as int
(2 missing values generated)

. destring _columnb_1, gen(percent) ignore("-" "%" "(" ")")  force
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent generated as double
(2 missing values generated)

. gen rounded_n = round(n, 5)
(2 missing values generated)

. tostring rounded_n, gen(n_rounded)
n_rounded generated as str4

. replace n_rounded = "redacted" if (rounded_n<=5)
(0 real changes made)

. keep factor level n_rounded percent

. export delimited using ./output/tables/baseline_table_vacc_rounded.csv
file ./output/tables/baseline_table_vacc_rounded.csv saved

. restore 

. 
. * Characteristics by exposure status at baseline 
. preserve 

. table1_mc, vars(age_cat cat \ sex cat \ imd cat \ ethnicity cat \ severe_dise
> ase_bl cat \ smoking cat \ bmi_cat cat \ has_pbc bin \ any_high_risk_conditio
> n cat) by(udca_bl) clear

  +-------------------------------------------------+
  | factor                    N_0   N_1   m_0   m_1 |
  |-------------------------------------------------|
  | age_cat                   579   202   159    60 |
  |-------------------------------------------------|
  | sex                       738   262     0     0 |
  |-------------------------------------------------|
  | imd                       738   262     0     0 |
  |-------------------------------------------------|
  | ethnicity                 738   262     0     0 |
  |-------------------------------------------------|
  | severe_disease_bl         738   262     0     0 |
  |-------------------------------------------------|
  | smoking                   738   262     0     0 |
  |-------------------------------------------------|
  | bmi_cat                   738   262     0     0 |
  |-------------------------------------------------|
  | has_pbc                   738   262     0     0 |
  |-------------------------------------------------|
  | any_high_risk_condition   738   262     0     0 |
  +-------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> ------+
  |                                            udca_bl = 0    udca_bl = 1    p-
> value |
  |----------------------------------------------------------------------------
> ------|
  |                                            N=738          N=262            
>       |
  |----------------------------------------------------------------------------
> ------|
  | age_cat                   18 - 40 years    222 (38.3%)    62 (30.7%)      0
> .24   |
  |                           41 - 60 years    193 (33.3%)    78 (38.6%)       
>       |
  |                           61 - 80 years    135 (23.3%)    49 (24.3%)       
>       |
  |                           >80 years        29 ( 5.0%)     13 ( 6.4%)       
>       |
  |----------------------------------------------------------------------------
> ------|
  | sex                       F                382 (51.8%)    141 (53.8%)     0
> .57   |
  |                           M                347 (47.0%)    116 (44.3%)      
>       |
  |                           U                9 ( 1.2%)      5 ( 1.9%)        
>       |
  |----------------------------------------------------------------------------
> ------|
  | imd                       1                138 (18.7%)    49 (18.7%)      0
> .94   |
  |                           2                127 (17.2%)    52 (19.8%)       
>       |
  |                           3                152 (20.6%)    51 (19.5%)       
>       |
  |                           4                150 (20.3%)    54 (20.6%)       
>       |
  |                           5                138 (18.7%)    44 (16.8%)       
>       |
  |                           6                33 ( 4.5%)     12 ( 4.6%)       
>       |
  |----------------------------------------------------------------------------
> ------|
  | ethnicity                 White            110 (14.9%)    44 (16.8%)      0
> .20   |
  |                           Mixed            143 (19.4%)    48 (18.3%)       
>       |
  |                           Asian            155 (21.0%)    53 (20.2%)       
>       |
  |                           Black            137 (18.6%)    40 (15.3%)       
>       |
  |                           Other            158 (21.4%)    54 (20.6%)       
>       |
  |                           Unknown          35 ( 4.7%)     23 ( 8.8%)       
>       |
  |----------------------------------------------------------------------------
> ------|
  | severe_disease_bl         0                374 (50.7%)    126 (48.1%)     0
> .47   |
  |                           1                364 (49.3%)    136 (51.9%)      
>       |
  |----------------------------------------------------------------------------
> ------|
  | smoking                   Never smoked     75 (10.2%)     17 ( 6.5%)      0
> .20   |
  |                           Current smoker   151 (20.5%)    54 (20.6%)       
>       |
  |                           Ex-smoker        107 (14.5%)    48 (18.3%)       
>       |
  |                           Unknown          405 (54.9%)    143 (54.6%)      
>       |
  |----------------------------------------------------------------------------
> ------|
  | bmi_cat                   Missing          151 (20.5%)    59 (22.5%)      0
> .96   |
  |                           Underweight      63 ( 8.5%)     23 ( 8.8%)       
>       |
  |                           Healthy range    140 (19.0%)    47 (17.9%)       
>       |
  |                           Overweight       156 (21.1%)    51 (19.5%)       
>       |
  |                           Obese            186 (25.2%)    69 (26.3%)       
>       |
  |                           Morbidly obese   42 ( 5.7%)     13 ( 5.0%)       
>       |
  |----------------------------------------------------------------------------
> ------|
  | has_pbc                                    355 (48.1%)    145 (55.3%)     0
> .044  |
  |----------------------------------------------------------------------------
> ------|
  | any_high_risk_condition   1                738 (100.0%)   262 (100.0%)     
>       |
  +----------------------------------------------------------------------------
> ------+
Data are presented as n (%).
 

. export delimited using ./output/tables/baseline_table_udca_vacc.csv, replace
(note: file ./output/tables/baseline_table_udca_vacc.csv not found)
file ./output/tables/baseline_table_udca_vacc.csv saved

. * Rounding numbers in table to nearest 5
. forvalues i=0/1 {   
  2.     destring _columna_`i', gen(n`i') ignore(",") force
  3.     destring _columnb_`i', gen(percent`i') ignore("-" "%" "(" ")")  force
  4.     gen rounded_n`i' = round(n`i', 5)
  5.     tostring percent`i', gen(percent_`i')
  6.     tostring rounded_n`i', gen(n`i'_rounded)
  7.     replace n`i'_rounded = "redacted" if (rounded_n`i'<=5)
  8.     replace percent_`i' = "redacted" if (rounded_n`i'<=5)
  9. }
_columna_0: contains nonnumeric characters not specified in ignore(); n0 genera
> ted as int
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
(2 missing values generated)
percent_0 generated as str4
n0_rounded generated as str3
(0 real changes made)
(0 real changes made)
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as int
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)
(2 missing values generated)
percent_1 generated as str4
n1_rounded generated as str3
variable n1_rounded was str3 now str8
(1 real change made)
variable percent_1 was str4 now str8
(1 real change made)

. keep factor level n0_rounded percent_0 n1_rounded percent_1

. export delimited using ./output/tables/baseline_table_udca_vacc_rounded.csv
file ./output/tables/baseline_table_udca_vacc_rounded.csv saved

. restore 

. 
end of do-file

. . file open output using "/tmp/104_baseline_tables.do.VM0v.out", write text r
> eplace

. . file write output "success" 

. . file close output

. 
end of do-file


