
. 
. import delimited using ./output/input_pbc.csv, clear
(106 vars, 1,000 obs)

. 
. * Prepare variables for table 
. replace ethnicity=6 if ethnicity==0
(49 real changes made)

. label define eth5                       1 "White"                            
>            ///
>                             2 "Mixed"                           ///          
>                                    
>                             3 "Asian"                                   ///
>                             4 "Black"                                   ///
>                             5 "Other"                                   ///
>                             6 "Unknown"

.                     
. 
. label values ethnicity eth5

. safetab ethnicity, m
10

  ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |        136       13.60       13.60
      Mixed |        199       19.90       33.50
      Asian |        210       21.00       54.50
      Black |        205       20.50       75.00
      Other |        201       20.10       95.10
    Unknown |         49        4.90      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. *(2) IMD
. replace imd=6 if imd==0
(54 real changes made)

. 
. * Create age categories
. egen age_cat = cut(age), at(18, 40, 60, 80, 120) icodes
(210 missing values generated)

. label define age 0 "18 - 40 years" 1 "41 - 60 years" 2 "61 - 80 years" 3 ">80
>  years"

. label values age_cat age

. bys age_cat: sum age

-------------------------------------------------------------------------------
-> age_cat = 18 - 40 years

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        271    28.85978    6.165217         18         39

-------------------------------------------------------------------------------
-> age_cat = 41 - 60 years

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        254    49.34646    5.779038         40         59

-------------------------------------------------------------------------------
-> age_cat = 61 - 80 years

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        208    68.55769    5.478684         60         79

-------------------------------------------------------------------------------
-> age_cat = >80 years

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |         57    85.22807    4.403803         80         96

-------------------------------------------------------------------------------
-> age_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        210    7.638095    4.887488          0         17


. 
. * BMI categories
. * assume BMI's less than 10 are incorrect and set to missing 
. sum bmi, d

                             bmi
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,000
25%     15.93112              0       Sum of Wgt.       1,000

50%     25.72399                      Mean           22.59268
                        Largest       Std. Dev.       13.3024
75%     32.01947       49.30793
90%     37.05417       50.75135       Variance       176.9538
95%     40.63829       51.11979       Skewness      -.5601965
99%      45.3713       52.93908       Kurtosis       2.275158

. replace bmi = . if bmi<10
(208 real changes made, 208 to missing)

. egen bmi_cat = cut(bmi), at(0, 1, 18.5, 24.9, 29.9, 39.9, 100) icodes
(208 missing values generated)

. bys bmi_cat: sum bmi

-------------------------------------------------------------------------------
-> bmi_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |         76    15.22105    2.429622   10.29504   18.48774

-------------------------------------------------------------------------------
-> bmi_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        185    22.00969    1.716329   18.53792   24.83978

-------------------------------------------------------------------------------
-> bmi_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        191    27.32346    1.386647   24.93484   29.79936

-------------------------------------------------------------------------------
-> bmi_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        276    33.80112    2.638655   29.90364   39.87712

-------------------------------------------------------------------------------
-> bmi_cat = 5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |         64    42.87403    2.905725   39.92033   52.93908

-------------------------------------------------------------------------------
-> bmi_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |          0


. * add missing . to zero category
. replace bmi_cat = 0 if bmi_cat==. 
(208 real changes made)

. label define bmi 0 "Missing" 1 "Underweight" 2 "Healthy range" 3 "Overweight"
>  4 "Obese" 5 "Morbidly obese"

. label values bmi_cat bmi

. 
. * Smoking status
. gen smoking = 0 if smoking_status=="N"
(903 missing values generated)

. replace smoking = 1 if smoking_status=="S"
(198 real changes made)

. replace smoking = 2 if smoking_status=="E"
(158 real changes made)

. replace smoking = 3 if smoking==.
(547 real changes made)

. 
. label define smok 1 "Current smoker" 2 "Ex-smoker" 0 "Never smoked" 3 "Unknow
> n"

. label values smoking smok

. 
. replace oral_steroid_drugs_nhsd=. if oral_steroid_drug_nhsd_3m_count < 2 & or
> al_steroid_drug_nhsd_12m_count < 4
(942 real changes made, 942 to missing)

. gen imid_nhsd=max(oral_steroid_drugs_nhsd, immunosuppresant_drugs_nhsd)

. gen rare_neuro_nhsd = max(multiple_sclerosis_nhsd, motor_neurone_disease_nhsd
> , myasthenia_gravis_nhsd, huntingtons_disease_nhsd)

. gen solid_organ_transplant_bin = solid_organ_transplant_nhsd_new!=""

. gen any_high_risk_condition = max(learning_disability_nhsd_snomed, cancer_ope
> nsafely_snomed_new, haematological_disease_nhsd, ///
> ckd_stage_5_nhsd, imid_nhsd, immunosupression_nhsd_new, hiv_aids_nhsd, solid_
> organ_transplant_bin, rare_neuro_nhsd)

. 
. foreach var in udca gc budesonide fenofibrate {
  2.     sum `var'_count_bl, d
  3.     sum `var'_count_fu, d 
  4.     gen `var'_any = (`var'_count_fu>=1 & `var'_count_fu!=.)
  5.     gen `var'_bl = (`var'_count_bl>=1 & `var'_count_bl!=.)
  6.     tab `var'_any, m 
  7.     tab `var'_bl, m
  8. }

                        udca_count_bl
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -2
 5%            0             -1
10%            0             -1       Obs               1,000
25%            0             -1       Sum of Wgt.       1,000

50%            0                      Mean               .795
                        Largest       Std. Dev.      1.614801
75%            0              7
90%            4              7       Variance       2.607583
95%            4              8       Skewness       1.922664
99%          6.5              8       Kurtosis       5.869381

                        udca_count_fu
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -1
 5%            0             -1
10%            0             -1       Obs               1,000
25%            0             -1       Sum of Wgt.       1,000

50%            0                      Mean               .772
                        Largest       Std. Dev.      1.548035
75%            1              7
90%            3              7       Variance       2.396412
95%            4              8       Skewness        2.05535
99%            6              8       Kurtosis       6.649782

   udca_any |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        741       74.10       74.10
          1 |        259       25.90      100.00
------------+-----------------------------------
      Total |      1,000      100.00

    udca_bl |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        760       76.00       76.00
          1 |        240       24.00      100.00
------------+-----------------------------------
      Total |      1,000      100.00

                         gc_count_bl
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -1
 5%            0             -1
10%            0             -1       Obs               1,000
25%            0             -1       Sum of Wgt.       1,000

50%            0                      Mean                .76
                        Largest       Std. Dev.       1.54168
75%            1              7
90%            3              7       Variance       2.376777
95%            4              8       Skewness       2.087988
99%          6.5              8       Kurtosis       6.817921

                         gc_count_fu
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -2
 5%            0             -2
10%            0             -1       Obs               1,000
25%            0             -1       Sum of Wgt.       1,000

50%            0                      Mean                .78
                        Largest       Std. Dev.      1.622416
75%            0              8
90%            3              8       Variance       2.632232
95%            5              9       Skewness       2.113936
99%            6              9       Kurtosis       6.983937

     gc_any |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        754       75.40       75.40
          1 |        246       24.60      100.00
------------+-----------------------------------
      Total |      1,000      100.00

      gc_bl |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        745       74.50       74.50
          1 |        255       25.50      100.00
------------+-----------------------------------
      Total |      1,000      100.00

                     budesonide_count_bl
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -2
 5%            0             -1
10%            0             -1       Obs               1,000
25%            0             -1       Sum of Wgt.       1,000

50%            0                      Mean               .788
                        Largest       Std. Dev.      1.597375
75%            1              7
90%            3              8       Variance       2.551608
95%            5              8       Skewness        1.97769
99%            6              8       Kurtosis       6.128629

                     budesonide_count_fu
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -1
 5%            0             -1
10%            0             -1       Obs               1,000
25%            0             -1       Sum of Wgt.       1,000

50%            0                      Mean               .771
                        Largest       Std. Dev.      1.528691
75%            1              7
90%            3              7       Variance       2.336896
95%            4              8       Skewness       2.050681
99%            6              9       Kurtosis       6.789902

budesonide_ |
        any |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        740       74.00       74.00
          1 |        260       26.00      100.00
------------+-----------------------------------
      Total |      1,000      100.00

budesonide_ |
         bl |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        747       74.70       74.70
          1 |        253       25.30      100.00
------------+-----------------------------------
      Total |      1,000      100.00

                    fenofibrate_count_bl
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -2
 5%            0             -1
10%            0             -1       Obs               1,000
25%            0             -1       Sum of Wgt.       1,000

50%            0                      Mean               .721
                        Largest       Std. Dev.      1.505133
75%            0              7
90%            3              7       Variance       2.265424
95%            4              8       Skewness       2.197283
99%            6             10       Kurtosis       7.727368

                    fenofibrate_count_fu
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -3
 5%            0             -2
10%            0             -1       Obs               1,000
25%            0             -1       Sum of Wgt.       1,000

50%            0                      Mean               .741
                        Largest       Std. Dev.      1.518626
75%            0              7
90%            3              7       Variance       2.306225
95%            4              7       Skewness       1.985255
99%            6              7       Kurtosis       6.195062

fenofibrate |
       _any |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        753       75.30       75.30
          1 |        247       24.70      100.00
------------+-----------------------------------
      Total |      1,000      100.00

fenofibrate |
        _bl |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        754       75.40       75.40
          1 |        246       24.60      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. 
. * Generate variable with number of vaccinations 
. foreach var in covid_vacc_first covid_vacc_second covid_vacc_third covid_vacc
> _fourth covid_vacc_fifth {
  2.     gen `var'= (`var'_date!="")    
  3. }

. 
. egen vacc_any = rowmax(covid_vacc_first covid_vacc_second covid_vacc_third co
> vid_vacc_fourth covid_vacc_fifth)

. egen total_vaccs = rowtotal(covid_vacc_first covid_vacc_second covid_vacc_thi
> rd covid_vacc_fourth covid_vacc_fifth)

. tab total_vaccs 

total_vaccs |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          4        0.40        0.40
          1 |         65        6.50        6.90
          2 |        295       29.50       36.40
          3 |        416       41.60       78.00
          4 |        201       20.10       98.10
          5 |         19        1.90      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. 
. gen severe_disease_fu = severe_disease_fu_date!=""

. 
. 
. 
. * Create tables 
. * Characteristics whole cohort
. preserve

. table1_mc, vars(age_cat cat \ sex cat \ imd cat \ ethnicity cat \ severe_dise
> ase_bl cat \ smoking cat \ bmi_cat cat \ has_pbc bin \ ///
> any_high_risk_condition cat) clear

  +---------------------------------------+
  | factor                      N_1   m_1 |
  |---------------------------------------|
  | age_cat                     790   210 |
  |---------------------------------------|
  | sex                       1,000     0 |
  |---------------------------------------|
  | imd                       1,000     0 |
  |---------------------------------------|
  | ethnicity                 1,000     0 |
  |---------------------------------------|
  | severe_disease_bl         1,000     0 |
  |---------------------------------------|
  | smoking                   1,000     0 |
  |---------------------------------------|
  | bmi_cat                   1,000     0 |
  |---------------------------------------|
  | has_pbc                   1,000     0 |
  |---------------------------------------|
  | any_high_risk_condition   1,000     0 |
  +---------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +-----------------------------------------------------------+
  |                                            Total          |
  |-----------------------------------------------------------|
  |                                            N=1,000        |
  |-----------------------------------------------------------|
  | age_cat                   18 - 40 years    271 (34.3%)    |
  |                           41 - 60 years    254 (32.2%)    |
  |                           61 - 80 years    208 (26.3%)    |
  |                           >80 years        57 ( 7.2%)     |
  |-----------------------------------------------------------|
  | sex                       F                488 (48.8%)    |
  |                           M                502 (50.2%)    |
  |                           U                10 ( 1.0%)     |
  |-----------------------------------------------------------|
  | imd                       1                213 (21.3%)    |
  |                           2                200 (20.0%)    |
  |                           3                176 (17.6%)    |
  |                           4                197 (19.7%)    |
  |                           5                160 (16.0%)    |
  |                           6                54 ( 5.4%)     |
  |-----------------------------------------------------------|
  | ethnicity                 White            136 (13.6%)    |
  |                           Mixed            199 (19.9%)    |
  |                           Asian            210 (21.0%)    |
  |                           Black            205 (20.5%)    |
  |                           Other            201 (20.1%)    |
  |                           Unknown          49 ( 4.9%)     |
  |-----------------------------------------------------------|
  | severe_disease_bl         0                500 (50.0%)    |
  |                           1                500 (50.0%)    |
  |-----------------------------------------------------------|
  | smoking                   Never smoked     97 ( 9.7%)     |
  |                           Current smoker   198 (19.8%)    |
  |                           Ex-smoker        158 (15.8%)    |
  |                           Unknown          547 (54.7%)    |
  |-----------------------------------------------------------|
  | bmi_cat                   Missing          208 (20.8%)    |
  |                           Underweight      76 ( 7.6%)     |
  |                           Healthy range    185 (18.5%)    |
  |                           Overweight       191 (19.1%)    |
  |                           Obese            276 (27.6%)    |
  |                           Morbidly obese   64 ( 6.4%)     |
  |-----------------------------------------------------------|
  | has_pbc                                    500 (50.0%)    |
  |-----------------------------------------------------------|
  | any_high_risk_condition   1                1,000 (100.0%) |
  +-----------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/baseline_table.csv, replace
(note: file ./output/tables/baseline_table.csv not found)
file ./output/tables/baseline_table.csv saved

. * Rounding numbers in table to nearest 5
. destring _columna_1, gen(n) ignore(",") force
_columna_1: contains nonnumeric characters not specified in ignore()
_columna_1: character , removed; n generated as int
(2 missing values generated)

. destring _columnb_1, gen(percent) ignore("-" "%" "(" ")")  force
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent generated as double
(2 missing values generated)

. gen rounded_n = round(n, 5)
(2 missing values generated)

. tostring rounded_n, gen(n_rounded)
n_rounded generated as str4

. replace n_rounded = "redacted" if (rounded_n<=5)
(0 real changes made)

. keep factor level n_rounded percent

. export delimited using ./output/tables/baseline_table_rounded.csv
file ./output/tables/baseline_table_rounded.csv saved

. restore 

. 
. * High risk conditions
. preserve

. table1_mc, vars(learning_disability_nhsd_snomed cat \ cancer_opensafely_snome
> d_new cat \ haematological_disease_nhsd cat \ ///
> ckd_stage_5_nhsd cat \ imid_nhsd cat \ immunosupression_nhsd_new cat \ hiv_ai
> ds_nhsd cat \ solid_organ_transplant_bin cat \  ///
> rare_neuro_nhsd cat) clear

  +-----------------------------------------------+
  | factor                              N_1   m_1 |
  |-----------------------------------------------|
  | learning_disability_nhsd_snomed   1,000     0 |
  |-----------------------------------------------|
  | cancer_opensafely_snomed_new      1,000     0 |
  |-----------------------------------------------|
  | haematological_disease_nhsd       1,000     0 |
  |-----------------------------------------------|
  | ckd_stage_5_nhsd                  1,000     0 |
  |-----------------------------------------------|
  | imid_nhsd                         1,000     0 |
  |-----------------------------------------------|
  | immunosupression_nhsd_new         1,000     0 |
  |-----------------------------------------------|
  | hiv_aids_nhsd                     1,000     0 |
  |-----------------------------------------------|
  | solid_organ_transplant_bin        1,000     0 |
  |-----------------------------------------------|
  | rare_neuro_nhsd                   1,000     0 |
  +-----------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +-------------------------------------------------------+
  |                                           Total       |
  |-------------------------------------------------------|
  |                                           N=1,000     |
  |-------------------------------------------------------|
  | learning_disability_nhsd_snomed   0       500 (50.0%) |
  |                                   1       500 (50.0%) |
  |-------------------------------------------------------|
  | cancer_opensafely_snomed_new      0       500 (50.0%) |
  |                                   1       500 (50.0%) |
  |-------------------------------------------------------|
  | haematological_disease_nhsd       0       14 ( 1.4%)  |
  |                                   1       986 (98.6%) |
  |-------------------------------------------------------|
  | ckd_stage_5_nhsd                  0       240 (24.0%) |
  |                                   1       760 (76.0%) |
  |-------------------------------------------------------|
  | imid_nhsd                         0       485 (48.5%) |
  |                                   1       515 (51.5%) |
  |-------------------------------------------------------|
  | immunosupression_nhsd_new         0       500 (50.0%) |
  |                                   1       500 (50.0%) |
  |-------------------------------------------------------|
  | hiv_aids_nhsd                     0       766 (76.6%) |
  |                                   1       234 (23.4%) |
  |-------------------------------------------------------|
  | solid_organ_transplant_bin        0       491 (49.1%) |
  |                                   1       509 (50.9%) |
  |-------------------------------------------------------|
  | rare_neuro_nhsd                   0       3 ( 0.3%)   |
  |                                   1       997 (99.7%) |
  +-------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/high_risk.csv, replace
(note: file ./output/tables/high_risk.csv not found)
file ./output/tables/high_risk.csv saved

. * Rounding numbers in table to nearest 5
. destring _columna_1, gen(n) ignore(",") force
_columna_1: contains nonnumeric characters not specified in ignore(); n generat
> ed as int
(2 missing values generated)

. destring _columnb_1, gen(percent) ignore("-" "%" "(" ")")  force
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent generated as double
(2 missing values generated)

. gen rounded_n = round(n, 5)
(2 missing values generated)

. tostring rounded_n, gen(n_rounded)
n_rounded generated as str3

. replace n_rounded = "redacted" if (rounded_n<=5)
variable n_rounded was str3 now str8
(1 real change made)

. keep factor level n_rounded percent

. export delimited using ./output/tables/high_risk_rounded.csv
file ./output/tables/high_risk_rounded.csv saved

. restore 

. 
. * Characteristics by exposure status at baseline 
. preserve 

. table1_mc, vars(age_cat cat \ sex cat \ imd cat \ ethnicity cat \ severe_dise
> ase_bl cat \ smoking cat \ bmi_cat cat \ has_pbc bin \ any_high_risk_conditio
> n cat) by(udca_bl) clear

  +-------------------------------------------------+
  | factor                    N_0   N_1   m_0   m_1 |
  |-------------------------------------------------|
  | age_cat                   610   180   150    60 |
  |-------------------------------------------------|
  | sex                       760   240     0     0 |
  |-------------------------------------------------|
  | imd                       760   240     0     0 |
  |-------------------------------------------------|
  | ethnicity                 760   240     0     0 |
  |-------------------------------------------------|
  | severe_disease_bl         760   240     0     0 |
  |-------------------------------------------------|
  | smoking                   760   240     0     0 |
  |-------------------------------------------------|
  | bmi_cat                   760   240     0     0 |
  |-------------------------------------------------|
  | has_pbc                   760   240     0     0 |
  |-------------------------------------------------|
  | any_high_risk_condition   760   240     0     0 |
  +-------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> ------+
  |                                            udca_bl = 0    udca_bl = 1    p-
> value |
  |----------------------------------------------------------------------------
> ------|
  |                                            N=760          N=240            
>       |
  |----------------------------------------------------------------------------
> ------|
  | age_cat                   18 - 40 years    217 (35.6%)    54 (30.0%)      0
> .53   |
  |                           41 - 60 years    194 (31.8%)    60 (33.3%)       
>       |
  |                           61 - 80 years    155 (25.4%)    53 (29.4%)       
>       |
  |                           >80 years        44 ( 7.2%)     13 ( 7.2%)       
>       |
  |----------------------------------------------------------------------------
> ------|
  | sex                       F                371 (48.8%)    117 (48.8%)     0
> .96   |
  |                           M                381 (50.1%)    121 (50.4%)      
>       |
  |                           U                8 ( 1.1%)      2 ( 0.8%)        
>       |
  |----------------------------------------------------------------------------
> ------|
  | imd                       1                154 (20.3%)    59 (24.6%)      0
> .70   |
  |                           2                150 (19.7%)    50 (20.8%)       
>       |
  |                           3                138 (18.2%)    38 (15.8%)       
>       |
  |                           4                150 (19.7%)    47 (19.6%)       
>       |
  |                           5                126 (16.6%)    34 (14.2%)       
>       |
  |                           6                42 ( 5.5%)     12 ( 5.0%)       
>       |
  |----------------------------------------------------------------------------
> ------|
  | ethnicity                 White            108 (14.2%)    28 (11.7%)      0
> .78   |
  |                           Mixed            144 (18.9%)    55 (22.9%)       
>       |
  |                           Asian            159 (20.9%)    51 (21.2%)       
>       |
  |                           Black            157 (20.7%)    48 (20.0%)       
>       |
  |                           Other            155 (20.4%)    46 (19.2%)       
>       |
  |                           Unknown          37 ( 4.9%)     12 ( 5.0%)       
>       |
  |----------------------------------------------------------------------------
> ------|
  | severe_disease_bl         0                384 (50.5%)    116 (48.3%)     0
> .55   |
  |                           1                376 (49.5%)    124 (51.7%)      
>       |
  |----------------------------------------------------------------------------
> ------|
  | smoking                   Never smoked     81 (10.7%)     16 ( 6.7%)      0
> .11   |
  |                           Current smoker   155 (20.4%)    43 (17.9%)       
>       |
  |                           Ex-smoker        112 (14.7%)    46 (19.2%)       
>       |
  |                           Unknown          412 (54.2%)    135 (56.2%)      
>       |
  |----------------------------------------------------------------------------
> ------|
  | bmi_cat                   Missing          170 (22.4%)    38 (15.8%)      0
> .20   |
  |                           Underweight      57 ( 7.5%)     19 ( 7.9%)       
>       |
  |                           Healthy range    130 (17.1%)    55 (22.9%)       
>       |
  |                           Overweight       145 (19.1%)    46 (19.2%)       
>       |
  |                           Obese            208 (27.4%)    68 (28.3%)       
>       |
  |                           Morbidly obese   50 ( 6.6%)     14 ( 5.8%)       
>       |
  |----------------------------------------------------------------------------
> ------|
  | has_pbc                                    382 (50.3%)    118 (49.2%)     0
> .77   |
  |----------------------------------------------------------------------------
> ------|
  | any_high_risk_condition   1                760 (100.0%)   240 (100.0%)     
>       |
  +----------------------------------------------------------------------------
> ------+
Data are presented as n (%).
 

. export delimited using ./output/tables/baseline_table_udca.csv, replace
(note: file ./output/tables/baseline_table_udca.csv not found)
file ./output/tables/baseline_table_udca.csv saved

. * Rounding numbers in table to nearest 5
. forvalues i=0/1 {   
  2.     destring _columna_`i', gen(n`i') ignore(",") force
  3.     destring _columnb_`i', gen(percent`i') ignore("-" "%" "(" ")")  force
  4.     gen rounded_n`i' = round(n`i', 5)
  5.     tostring percent`i', gen(percent_`i')
  6.     tostring rounded_n`i', gen(n`i'_rounded)
  7.     replace n`i'_rounded = "redacted" if (rounded_n`i'<=5)
  8.     replace percent_`i' = "redacted" if (rounded_n`i'<=5)
  9. }
_columna_0: contains nonnumeric characters not specified in ignore(); n0 genera
> ted as int
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
(2 missing values generated)
percent_0 generated as str4
n0_rounded generated as str3
(0 real changes made)
(0 real changes made)
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as int
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)
(2 missing values generated)
percent_1 generated as str4
n1_rounded generated as str3
variable n1_rounded was str3 now str8
(1 real change made)
variable percent_1 was str4 now str8
(1 real change made)

. keep factor level n0_rounded percent_0 n1_rounded percent_1

. export delimited using ./output/tables/baseline_table_udca_rounded.csv
file ./output/tables/baseline_table_udca_rounded.csv saved

. restore 

. 
. * Additional medications by any exposure
. preserve 

. table1_mc, vars(budesonide_bl bin \ fenofibrate_bl bin \ gc_bl bin \ oca_bl b
> in \ rituximab_bl bin \ severe_disease_fu bin \ vacc_any bin  \ total_vaccs c
> at) by(udca_bl) clear

  +-------------------------------------------+
  | factor              N_0   N_1   m_0   m_1 |
  |-------------------------------------------|
  | budesonide_bl       760   240     0     0 |
  |-------------------------------------------|
  | fenofibrate_bl      760   240     0     0 |
  |-------------------------------------------|
  | gc_bl               760   240     0     0 |
  |-------------------------------------------|
  | oca_bl              760   240     0     0 |
  |-------------------------------------------|
  | rituximab_bl        760   240     0     0 |
  |-------------------------------------------|
  | severe_disease_fu   760   240     0     0 |
  |-------------------------------------------|
  | vacc_any            760   240     0     0 |
  |-------------------------------------------|
  | total_vaccs         760   240     0     0 |
  +-------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +-----------------------------------------------------------------+
  |                             udca_bl = 0   udca_bl = 1   p-value |
  |-----------------------------------------------------------------|
  |                             N=760         N=240                 |
  |-----------------------------------------------------------------|
  | budesonide_bl               187 (24.6%)   66 (27.5%)     0.37   |
  |-----------------------------------------------------------------|
  | fenofibrate_bl              183 (24.1%)   63 (26.2%)     0.50   |
  |-----------------------------------------------------------------|
  | gc_bl                       202 (26.6%)   53 (22.1%)     0.16   |
  |-----------------------------------------------------------------|
  | oca_bl                      373 (49.1%)   127 (52.9%)    0.30   |
  |-----------------------------------------------------------------|
  | rituximab_bl                378 (49.7%)   122 (50.8%)    0.77   |
  |-----------------------------------------------------------------|
  | severe_disease_fu           578 (76.1%)   189 (78.8%)    0.39   |
  |-----------------------------------------------------------------|
  | vacc_any                    758 (99.7%)   238 (99.2%)    0.22   |
  |-----------------------------------------------------------------|
  | total_vaccs         0       2 ( 0.3%)     2 ( 0.8%)      0.052  |
  |                     1       45 ( 5.9%)    20 ( 8.3%)            |
  |                     2       216 (28.4%)   79 (32.9%)            |
  |                     3       319 (42.0%)   97 (40.4%)            |
  |                     4       166 (21.8%)   35 (14.6%)            |
  |                     5       12 ( 1.6%)    7 ( 2.9%)             |
  +-----------------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/additional_meds_udca.csv, replace
(note: file ./output/tables/additional_meds_udca.csv not found)
file ./output/tables/additional_meds_udca.csv saved

. * Rounding numbers in table to nearest 5
. forvalues i=0/1 {   
  2.     destring _columna_`i', gen(n`i') ignore(",") force
  3.     destring _columnb_`i', gen(percent`i') ignore("-" "%" "(" ")")  force
  4.     gen rounded_n`i' = round(n`i', 5)
  5.     tostring rounded_n`i', gen(n`i'_rounded)
  6.     tostring percent`i', gen(percent_`i')
  7.     replace n`i'_rounded = "redacted" if (rounded_n`i'<=5)
  8.     replace percent_`i' = "redacted" if (rounded_n`i'<=5)
  9. }
_columna_0: contains nonnumeric characters not specified in ignore(); n0 genera
> ted as int
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
(2 missing values generated)
n0_rounded generated as str3
percent_0 generated as str4
variable n0_rounded was str3 now str8
(1 real change made)
variable percent_0 was str4 now str8
(1 real change made)
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as int
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)
(2 missing values generated)
n1_rounded generated as str3
percent_1 generated as str4
variable n1_rounded was str3 now str8
(2 real changes made)
variable percent_1 was str4 now str8
(2 real changes made)

. keep factor n0_rounded percent_0 n1_rounded percent_1

. export delimited using ./output/tables/additional_meds_udca_rounded.csv
file ./output/tables/additional_meds_udca_rounded.csv saved

. restore 

. 
. * Checking outcomes 
. foreach var in died_date_ons hosp_covid_primary hosp_covid_any dereg_date {
  2.     gen `var'A = date(`var', "YMD")
  3.     format `var'A %dD/N/CY
  4.     drop `var'
  5.     gen yr_`var' = year(`var'A)
  6.     tab yr_`var'
  7.     replace `var'A=. if yr_`var'==2023
  8. }
(500 missing values generated)
(500 missing values generated)

yr_died_dat |
      e_ons |      Freq.     Percent        Cum.
------------+-----------------------------------
       2020 |        134       26.80       26.80
       2021 |        157       31.40       58.20
       2022 |        131       26.20       84.40
       2023 |         78       15.60      100.00
------------+-----------------------------------
      Total |        500      100.00
(78 real changes made, 78 to missing)
(900 missing values generated)
(900 missing values generated)

yr_hosp_cov |
 id_primary |      Freq.     Percent        Cum.
------------+-----------------------------------
       2020 |         23       23.00       23.00
       2021 |         27       27.00       50.00
       2022 |         35       35.00       85.00
       2023 |         15       15.00      100.00
------------+-----------------------------------
      Total |        100      100.00
(15 real changes made, 15 to missing)
(900 missing values generated)
(900 missing values generated)

yr_hosp_cov |
     id_any |      Freq.     Percent        Cum.
------------+-----------------------------------
       2020 |         24       24.00       24.00
       2021 |         31       31.00       55.00
       2022 |         30       30.00       85.00
       2023 |         15       15.00      100.00
------------+-----------------------------------
      Total |        100      100.00
(15 real changes made, 15 to missing)
(500 missing values generated)
(500 missing values generated)

yr_dereg_da |
         te |      Freq.     Percent        Cum.
------------+-----------------------------------
       2020 |        125       25.00       25.00
       2021 |        159       31.80       56.80
       2022 |        145       29.00       85.80
       2023 |         71       14.20      100.00
------------+-----------------------------------
      Total |        500      100.00
(71 real changes made, 71 to missing)

. gen end_study = date("31/12/2022", "DMY")

. egen end_date = rowmin(dereg_dateA end_study died_date_onsA)

. replace died_date_onsA=. if end_date<died_date_onsA
(86 real changes made, 86 to missing)

. replace died_ons_covid_flag_any=0 if end_date<died_date_onsA & died_ons_covid
> _flag_any==1
(347 real changes made)

. replace hosp_covid_anyA=. if end_date<hosp_covid_anyA
(27 real changes made, 27 to missing)

. 
. 
. * Flag if died
. gen died_flag = died_date_onsA!=.

. * Generate date if died of covid
. gen died_date_ons_covid = died_date_onsA if died_ons_covid_flag_any == 1
(847 missing values generated)

. 
. * Flag hospitalised with covid 
. gen hosp_any_flag = hosp_covid_anyA!=.

. 
. * Composite outcome 
. gen hosp_died = (died_ons_covid_flag_any==1 | hosp_any_flag==1)

. tab hosp_died

  hosp_died |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        798       79.80       79.80
          1 |        202       20.20      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. egen hosp_died_dateA = rowmin(died_date_onsA hosp_covid_anyA)
(622 missing values generated)

. replace hosp_died_dateA=. if hosp_died==0
(176 real changes made, 176 to missing)

. sum hosp_died_dateA

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hosp_died_~A |        202    22414.28    287.1739      21977      23001

. * Generate flag of how met composite outcome 
. di "Number where died before hospitalisation date - should be zero"
Number where died before hospitalisation date - should be zero

. count if died_date_onsA<hosp_covid_anyA & hosp_covid_anyA!=.
  0

. di "Number where have both hospitalisation and death date" 
Number where have both hospitalisation and death date

. count if died_date_onsA!=. & hosp_covid_anyA!=.
  16

. 
. gen composite_make_up = hosp_died 

. replace composite_make_up = 2 if died_ons_covid_flag_any==1 & hosp_any_flag==
> 0
(144 real changes made)

. label define comp 0 "No outcome" 1 "Hospitalised" 2 "Died"

. label values composite_make_up comp 

. * Check 
. count if composite_make_up==1 & hosp_covid_anyA==. 
  0

. count if composite_make_up==1 & hosp_died_dateA!=hosp_covid_anyA
  0

. count if composite_make_up==2 & died_date_onsA==. 
  0

. count if composite_make_up==2 & hosp_died_dateA!=died_date_onsA
  0

. tab composite_make_up died_ons_covid_flag_any

             | died_ons_covid_flag_a
composite_ma |          ny
       ke_up |         0          1 |     Total
-------------+----------------------+----------
  No outcome |       798          0 |       798 
Hospitalised |        49          9 |        58 
        Died |         0        144 |       144 
-------------+----------------------+----------
       Total |       847        153 |     1,000 

. tab composite_make_up hosp_any_flag

composite_ma |     hosp_any_flag
       ke_up |         0          1 |     Total
-------------+----------------------+----------
  No outcome |       798          0 |       798 
Hospitalised |         0         58 |        58 
        Died |       144          0 |       144 
-------------+----------------------+----------
       Total |       942         58 |     1,000 

. tab udca_bl died_ons_covid_flag_any

           | died_ons_covid_flag_a
           |          ny
   udca_bl |         0          1 |     Total
-----------+----------------------+----------
         0 |       637        123 |       760 
         1 |       210         30 |       240 
-----------+----------------------+----------
     Total |       847        153 |     1,000 

. tab udca_bl hosp_any_flag

           |     hosp_any_flag
   udca_bl |         0          1 |     Total
-----------+----------------------+----------
         0 |       714         46 |       760 
         1 |       228         12 |       240 
-----------+----------------------+----------
     Total |       942         58 |     1,000 

. 
. * check number of outcomes per ethnicity group 
. tab ethnicity died_ons_covid_flag_any

           | died_ons_covid_flag_a
           |          ny
 ethnicity |         0          1 |     Total
-----------+----------------------+----------
     White |       109         27 |       136 
     Mixed |       172         27 |       199 
     Asian |       178         32 |       210 
     Black |       181         24 |       205 
     Other |       170         31 |       201 
   Unknown |        37         12 |        49 
-----------+----------------------+----------
     Total |       847        153 |     1,000 

. tab ethnicity hosp_any_flag

           |     hosp_any_flag
 ethnicity |         0          1 |     Total
-----------+----------------------+----------
     White |       129          7 |       136 
     Mixed |       188         11 |       199 
     Asian |       197         13 |       210 
     Black |       195         10 |       205 
     Other |       185         16 |       201 
   Unknown |        48          1 |        49 
-----------+----------------------+----------
     Total |       942         58 |     1,000 

. 
. * Number of outcomes within each time period: pre-vaccination of most populat
> ion - prior to 1st March 2021 and after
. 
. gen composite_pre = hosp_died_dateA < date("01Mar2021", "DMY")

. replace composite_pre = 0 if hosp_died_dateA==. 
(0 real changes made)

. tab hosp_died composite_pre 

           |     composite_pre
 hosp_died |         0          1 |     Total
-----------+----------------------+----------
         0 |       798          0 |       798 
         1 |       109         93 |       202 
-----------+----------------------+----------
     Total |       907         93 |     1,000 

. 
. gen died_pre = died_date_onsA < date("01Mar2021", "DMY")

. replace died_pre = . if died_date_onsA==. | died_ons_covid_flag_any==0
(847 real changes made, 847 to missing)

. tab died_ons_covid_flag_any died_pre 

died_ons_c |
ovid_flag_ |       died_pre
       any |         0          1 |     Total
-----------+----------------------+----------
         1 |        84         69 |       153 
-----------+----------------------+----------
     Total |        84         69 |       153 

. 
. gen hosp_pre = hosp_covid_anyA < date("01Mar2021", "DMY")

. replace hosp_pre = . if hosp_covid_anyA==.
(942 real changes made, 942 to missing)

. tab hosp_any_flag hosp_pre 

hosp_any_f |       hosp_pre
       lag |         0          1 |     Total
-----------+----------------------+----------
         1 |        33         25 |        58 
-----------+----------------------+----------
     Total |        33         25 |        58 

. 
. gen composite_post = hosp_died_dateA >= date("01Mar2021", "DMY") & hosp_died_
> dateA!=.

. replace composite_post = 0 if hosp_died_dateA==.
(0 real changes made)

. tab hosp_died composite_post 

           |    composite_post
 hosp_died |         0          1 |     Total
-----------+----------------------+----------
         0 |       798          0 |       798 
         1 |        93        109 |       202 
-----------+----------------------+----------
     Total |       891        109 |     1,000 

. 
. gen died_post = died_date_onsA >= date("01Mar2021", "DMY") & died_date_onsA!=
> .

. replace died_post = . if died_date_onsA==. | died_ons_covid_flag_any==0
(847 real changes made, 847 to missing)

. tab died_ons_covid_flag_any died_post 

died_ons_c |
ovid_flag_ |       died_post
       any |         0          1 |     Total
-----------+----------------------+----------
         1 |        69         84 |       153 
-----------+----------------------+----------
     Total |        69         84 |       153 

. 
. gen hosp_post = hosp_covid_anyA >= date("01Mar2021", "DMY") & hosp_covid_anyA
> !=.

. replace hosp_post = . if hosp_covid_anyA==.
(942 real changes made, 942 to missing)

. tab hosp_any_flag hosp_post

hosp_any_f |       hosp_post
       lag |         0          1 |     Total
-----------+----------------------+----------
         1 |        25         33 |        58 
-----------+----------------------+----------
     Total |        25         33 |        58 

. 
. * Outcomes by baseline exposure stataus
. table1_mc, by(udca_bl) vars(died_ons_covid_flag_any bin \ hosp_any_flag bin \
>  hosp_died bin \ composite_make_up cat \ composite_pre bin \ ///
> died_pre bin \ hosp_pre bin \ composite_post bin \ died_post bin \ hosp_post 
> bin) clear

  +-------------------------------------------------+
  | factor                    N_0   N_1   m_0   m_1 |
  |-------------------------------------------------|
  | died_ons_covid_flag_any   760   240     0     0 |
  |-------------------------------------------------|
  | hosp_any_flag             760   240     0     0 |
  |-------------------------------------------------|
  | hosp_died                 760   240     0     0 |
  |-------------------------------------------------|
  | composite_make_up         760   240     0     0 |
  |-------------------------------------------------|
  | composite_pre             760   240     0     0 |
  |-------------------------------------------------|
  | died_pre                  123    30   637   210 |
  |-------------------------------------------------|
  | hosp_pre                   46    12   714   228 |
  |-------------------------------------------------|
  | composite_post            760   240     0     0 |
  |-------------------------------------------------|
  | died_post                 123    30   637   210 |
  |-------------------------------------------------|
  | hosp_post                  46    12   714   228 |
  +-------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> --+
  |                                          udca_bl = 0   udca_bl = 1   p-valu
> e |
  |----------------------------------------------------------------------------
> --|
  |                                          N=760         N=240               
>   |
  |----------------------------------------------------------------------------
> --|
  | died_ons_covid_flag_any                  123 (16.2%)   30 (12.5%)     0.17 
>   |
  |----------------------------------------------------------------------------
> --|
  | hosp_any_flag                            46 ( 6.1%)    12 ( 5.0%)     0.54 
>   |
  |----------------------------------------------------------------------------
> --|
  | hosp_died                                161 (21.2%)   41 (17.1%)     0.17 
>   |
  |----------------------------------------------------------------------------
> --|
  | composite_make_up         No outcome     599 (78.8%)   199 (82.9%)    0.38 
>   |
  |                           Hospitalised   46 ( 6.1%)    12 ( 5.0%)          
>   |
  |                           Died           115 (15.1%)   29 (12.1%)          
>   |
  |----------------------------------------------------------------------------
> --|
  | composite_pre                            73 ( 9.6%)    20 ( 8.3%)     0.55 
>   |
  |----------------------------------------------------------------------------
> --|
  | died_pre                                 55 (44.7%)    14 (46.7%)     0.85 
>   |
  |----------------------------------------------------------------------------
> --|
  | hosp_pre                                 19 (41%)      6 (50%)        0.59 
>   |
  |----------------------------------------------------------------------------
> --|
  | composite_post                           88 (11.6%)    21 ( 8.8%)     0.22 
>   |
  |----------------------------------------------------------------------------
> --|
  | died_post                                68 (55.3%)    16 (53.3%)     0.85 
>   |
  |----------------------------------------------------------------------------
> --|
  | hosp_post                                27 (59%)      6 (50%)        0.59 
>   |
  +----------------------------------------------------------------------------
> --+
Data are presented as n (%).
 

. export delimited using ./output/tables/baseline_outcomes.csv
file ./output/tables/baseline_outcomes.csv saved

. forvalues i=0/1 {   
  2.     destring _columna_`i', gen(n`i') ignore(",") force
  3.     destring _columnb_`i', gen(percent`i') ignore("-" "%" "(" ")")  force
  4.     gen rounded_n`i' = round(n`i', 5)
  5.     tostring rounded_n`i', gen(n`i'_rounded)
  6.     tostring percent`i', gen(percent_`i')
  7.     replace n`i'_rounded = "redacted" if (rounded_n`i'<=5)
  8.     replace percent_`i' = "redacted" if (rounded_n`i'<=5)
  9. }
_columna_0: contains nonnumeric characters not specified in ignore(); n0 genera
> ted as int
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
(2 missing values generated)
n0_rounded generated as str3
percent_0 generated as str4
(0 real changes made)
(0 real changes made)
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as int
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)
(2 missing values generated)
n1_rounded generated as str3
percent_1 generated as str4
variable n1_rounded was str3 now str8
(2 real changes made)
variable percent_1 was str4 now str8
(2 real changes made)

. keep factor rounded_n0 percent0 rounded_n1 percent1

. export delimited using ./output/tables/baseline_outcomes_rounded.csv
file ./output/tables/baseline_outcomes_rounded.csv saved

. 
. 
end of do-file

. . file open output using "/tmp/104_baseline_tables.do.9mqg.out", write text r
> eplace

. . file write output "success" 

. . file close output

. 
end of do-file


