
. 
. import delimited using ./output/input_pbc.csv, clear
(97 vars, 1,000 obs)

. 
. * Prepare variables for table 
. replace ethnicity=6 if ethnicity==0
(54 real changes made)

. label define eth5                       1 "White"                            
>            ///
>                             2 "Mixed"                           ///          
>                                    
>                             3 "Asian"                                   ///
>                             4 "Black"                                   ///
>                             5 "Other"                                   ///
>                             6 "Unknown"

.                     
. 
. label values ethnicity eth5

. safetab ethnicity, m
10

  ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |        157       15.70       15.70
      Mixed |        200       20.00       35.70
      Asian |        191       19.10       54.80
      Black |        188       18.80       73.60
      Other |        210       21.00       94.60
    Unknown |         54        5.40      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. *(2) IMD
. replace imd=6 if imd==0
(61 real changes made)

. 
. * Create age categories
. egen age_cat = cut(age), at(18, 40, 60, 80, 120) icodes
(205 missing values generated)

. label define age 0 "18 - 40 years" 1 "41 - 60 years" 2 "61 - 80 years" 3 ">80
>  years"

. label values age_cat age

. bys age_cat: sum age

-------------------------------------------------------------------------------
-> age_cat = 18 - 40 years

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        275    28.40364    6.241548         18         39

-------------------------------------------------------------------------------
-> age_cat = 41 - 60 years

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        278     49.3705    5.747653         40         59

-------------------------------------------------------------------------------
-> age_cat = 61 - 80 years

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        197    68.00508    5.887983         60         79

-------------------------------------------------------------------------------
-> age_cat = >80 years

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |         45    85.68889    4.094465         80         95

-------------------------------------------------------------------------------
-> age_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        205    9.014634    5.212615          0         17


. 
. * BMI categories
. egen bmi_cat = cut(bmi), at(0, 1, 18.5, 24.9, 29.9, 39.9, 100) icodes

. bys bmi_cat: sum bmi

-------------------------------------------------------------------------------
-> bmi_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        199           0           0          0          0

-------------------------------------------------------------------------------
-> bmi_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |         95    14.11928    3.562657   1.034895   18.45594

-------------------------------------------------------------------------------
-> bmi_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        176    22.12876    1.745695   18.55834   24.89843

-------------------------------------------------------------------------------
-> bmi_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        217     27.5001    1.501998   24.92286    29.8848

-------------------------------------------------------------------------------
-> bmi_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        264    33.95687    2.675602   29.90091   39.80875

-------------------------------------------------------------------------------
-> bmi_cat = 5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |         49    43.73118    3.458137   39.92422   55.14725


. * add missing . to zero category
. replace bmi_cat = 0 if bmi_cat==. 
(0 real changes made)

. label define bmi 0 "Missing" 1 "Underweight" 2 "Healthy range" 3 "Overweight"
>  4 "Obese" 5 "Morbidly obese"

. label values bmi_cat bmi

. 
. replace oral_steroid_drugs_nhsd=. if oral_steroid_drug_nhsd_3m_count < 2 & or
> al_steroid_drug_nhsd_12m_count < 4
(929 real changes made, 929 to missing)

. gen imid_nhsd=max(oral_steroid_drugs_nhsd, immunosuppresant_drugs_nhsd)

. gen rare_neuro_nhsd = max(multiple_sclerosis_nhsd, motor_neurone_disease_nhsd
> , myasthenia_gravis_nhsd, huntingtons_disease_nhsd)

. gen solid_organ_transplant_bin = solid_organ_transplant_nhsd_new!=""

. gen any_high_risk_condition = max(learning_disability_nhsd_snomed, cancer_ope
> nsafely_snomed_new, haematological_disease_nhsd, ///
> ckd_stage_5_nhsd, imid_nhsd, immunosupression_nhsd_new, hiv_aids_nhsd, solid_
> organ_transplant_bin, rare_neuro_nhsd)

. 
. foreach var in udca gc budesonide fenofibrate {
  2.     gen `var'_any = (`var'_count_fu>=1 & `var'_count_fu!=.)
  3.     gen `var'_bl = (`var'_count_bl>=1 & `var'_count_bl!=.)
  4. }

. 
. gen vacc_any = covid_vacc_date!=""

. 
. gen severe_disease_fu = severe_disease_fu_date!=""

. 
. * Create tables 
. * Characteristics whole cohort
. preserve

. table1_mc, vars(age_cat cat \ sex cat \ imd cat \ ethnicity cat \ severe_dise
> ase_bl cat \ smoking_status cat \ bmi_cat cat \ has_pbc bin \ ///
> any_high_risk_condition cat) clear

  +---------------------------------------+
  | factor                      N_1   m_1 |
  |---------------------------------------|
  | age_cat                     795   205 |
  |---------------------------------------|
  | sex                       1,000     0 |
  |---------------------------------------|
  | imd                       1,000     0 |
  |---------------------------------------|
  | ethnicity                 1,000     0 |
  |---------------------------------------|
  | severe_disease_bl         1,000     0 |
  |---------------------------------------|
  | smoking_status              500   500 |
  |---------------------------------------|
  | bmi_cat                   1,000     0 |
  |---------------------------------------|
  | has_pbc                   1,000     0 |
  |---------------------------------------|
  | any_high_risk_condition   1,000     0 |
  +---------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +-----------------------------------------------------------+
  |                                            Total          |
  |-----------------------------------------------------------|
  |                                            N=1,000        |
  |-----------------------------------------------------------|
  | age_cat                   18 - 40 years    275 (34.6%)    |
  |                           41 - 60 years    278 (35.0%)    |
  |                           61 - 80 years    197 (24.8%)    |
  |                           >80 years        45 ( 5.7%)     |
  |-----------------------------------------------------------|
  | sex                       F                483 (48.3%)    |
  |                           M                507 (50.7%)    |
  |                           U                10 ( 1.0%)     |
  |-----------------------------------------------------------|
  | imd                       1                173 (17.3%)    |
  |                           2                180 (18.0%)    |
  |                           3                175 (17.5%)    |
  |                           4                197 (19.7%)    |
  |                           5                214 (21.4%)    |
  |                           6                61 ( 6.1%)     |
  |-----------------------------------------------------------|
  | ethnicity                 White            157 (15.7%)    |
  |                           Mixed            200 (20.0%)    |
  |                           Asian            191 (19.1%)    |
  |                           Black            188 (18.8%)    |
  |                           Other            210 (21.0%)    |
  |                           Unknown          54 ( 5.4%)     |
  |-----------------------------------------------------------|
  | severe_disease_bl         0                500 (50.0%)    |
  |                           1                500 (50.0%)    |
  |-----------------------------------------------------------|
  | smoking_status            E                156 (31.2%)    |
  |                           M                49 ( 9.8%)     |
  |                           N                89 (17.8%)     |
  |                           S                206 (41.2%)    |
  |-----------------------------------------------------------|
  | bmi_cat                   Missing          199 (19.9%)    |
  |                           Underweight      95 ( 9.5%)     |
  |                           Healthy range    176 (17.6%)    |
  |                           Overweight       217 (21.7%)    |
  |                           Obese            264 (26.4%)    |
  |                           Morbidly obese   49 ( 4.9%)     |
  |-----------------------------------------------------------|
  | has_pbc                                    500 (50.0%)    |
  |-----------------------------------------------------------|
  | any_high_risk_condition   1                1,000 (100.0%) |
  +-----------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/baseline_table.csv, replace
(note: file ./output/tables/baseline_table.csv not found)
file ./output/tables/baseline_table.csv saved

. * Rounding numbers in table to nearest 5
. destring _columna_1, gen(n) ignore(",") force
_columna_1: contains nonnumeric characters not specified in ignore()
_columna_1: character , removed; n generated as int
(2 missing values generated)

. destring _columnb_1, gen(percent) ignore("-" "%" "(" ")")  force
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent generated as double
(2 missing values generated)

. gen rounded_n = round(n, 5)
(2 missing values generated)

. tostring rounded_n, gen(n_rounded)
n_rounded generated as str4

. replace n_rounded = "redacted" if (n_rounded=="5" | n_rounded=="4" | n_rounde
> d=="3" | n_rounded=="2" | n_rounded=="1" | n_rounded=="0")
(0 real changes made)

. keep factor level n_rounded percent

. export delimited using ./output/tables/baseline_table_rounded.csv
file ./output/tables/baseline_table_rounded.csv saved

. restore 

. 
. * High risk conditions
. preserve

. table1_mc, vars(learning_disability_nhsd_snomed cat \ cancer_opensafely_snome
> d_new cat \ haematological_disease_nhsd cat \ ///
> ckd_stage_5_nhsd cat \ imid_nhsd cat \ immunosupression_nhsd_new cat \ hiv_ai
> ds_nhsd cat \ solid_organ_transplant_bin cat \  ///
> rare_neuro_nhsd cat) clear

  +-----------------------------------------------+
  | factor                              N_1   m_1 |
  |-----------------------------------------------|
  | learning_disability_nhsd_snomed   1,000     0 |
  |-----------------------------------------------|
  | cancer_opensafely_snomed_new      1,000     0 |
  |-----------------------------------------------|
  | haematological_disease_nhsd       1,000     0 |
  |-----------------------------------------------|
  | ckd_stage_5_nhsd                  1,000     0 |
  |-----------------------------------------------|
  | imid_nhsd                         1,000     0 |
  |-----------------------------------------------|
  | immunosupression_nhsd_new         1,000     0 |
  |-----------------------------------------------|
  | hiv_aids_nhsd                     1,000     0 |
  |-----------------------------------------------|
  | solid_organ_transplant_bin        1,000     0 |
  |-----------------------------------------------|
  | rare_neuro_nhsd                   1,000     0 |
  +-----------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +-------------------------------------------------------+
  |                                           Total       |
  |-------------------------------------------------------|
  |                                           N=1,000     |
  |-------------------------------------------------------|
  | learning_disability_nhsd_snomed   0       500 (50.0%) |
  |                                   1       500 (50.0%) |
  |-------------------------------------------------------|
  | cancer_opensafely_snomed_new      0       500 (50.0%) |
  |                                   1       500 (50.0%) |
  |-------------------------------------------------------|
  | haematological_disease_nhsd       0       22 ( 2.2%)  |
  |                                   1       978 (97.8%) |
  |-------------------------------------------------------|
  | ckd_stage_5_nhsd                  0       257 (25.7%) |
  |                                   1       743 (74.3%) |
  |-------------------------------------------------------|
  | imid_nhsd                         0       492 (49.2%) |
  |                                   1       508 (50.8%) |
  |-------------------------------------------------------|
  | immunosupression_nhsd_new         0       500 (50.0%) |
  |                                   1       500 (50.0%) |
  |-------------------------------------------------------|
  | hiv_aids_nhsd                     0       747 (74.7%) |
  |                                   1       253 (25.3%) |
  |-------------------------------------------------------|
  | solid_organ_transplant_bin        0       489 (48.9%) |
  |                                   1       511 (51.1%) |
  |-------------------------------------------------------|
  | rare_neuro_nhsd                   0       8 ( 0.8%)   |
  |                                   1       992 (99.2%) |
  +-------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/high_risk.csv, replace
(note: file ./output/tables/high_risk.csv not found)
file ./output/tables/high_risk.csv saved

. * Rounding numbers in table to nearest 5
. destring _columna_1, gen(n) ignore(",") force
_columna_1: contains nonnumeric characters not specified in ignore(); n generat
> ed as int
(2 missing values generated)

. destring _columnb_1, gen(percent) ignore("-" "%" "(" ")")  force
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent generated as double
(2 missing values generated)

. gen rounded_n = round(n, 5)
(2 missing values generated)

. tostring rounded_n, gen(n_rounded)
n_rounded generated as str3

. replace n_rounded = "redacted" if (n_rounded=="5" | n_rounded=="4" | n_rounde
> d=="3" | n_rounded=="2" | n_rounded=="1" | n_rounded=="0")
(0 real changes made)

. keep factor level n_rounded percent

. export delimited using ./output/tables/high_risk_rounded.csv
file ./output/tables/high_risk_rounded.csv saved

. restore 

. 
. * Characteristics by any exposure
. preserve 

. table1_mc, vars(age_cat cat \ sex cat \ imd cat \ ethnicity cat \ severe_dise
> ase_bl cat \ smoking_status cat \ bmi_cat cat \ has_pbc bin) by(udca_bl) clea
> r

  +-------------------------------------------+
  | factor              N_0   N_1   m_0   m_1 |
  |-------------------------------------------|
  | age_cat             599   196   152    53 |
  |-------------------------------------------|
  | sex                 751   249     0     0 |
  |-------------------------------------------|
  | imd                 751   249     0     0 |
  |-------------------------------------------|
  | ethnicity           751   249     0     0 |
  |-------------------------------------------|
  | severe_disease_bl   751   249     0     0 |
  |-------------------------------------------|
  | smoking_status      370   130   381   119 |
  |-------------------------------------------|
  | bmi_cat             751   249     0     0 |
  |-------------------------------------------|
  | has_pbc             751   249     0     0 |
  +-------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------------------+
  |                                      udca_bl = 0   udca_bl = 1   p-value |
  |--------------------------------------------------------------------------|
  |                                      N=751         N=249                 |
  |--------------------------------------------------------------------------|
  | age_cat             18 - 40 years    213 (35.6%)   62 (31.6%)     0.52   |
  |                     41 - 60 years    202 (33.7%)   76 (38.8%)            |
  |                     61 - 80 years    148 (24.7%)   49 (25.0%)            |
  |                     >80 years        36 ( 6.0%)    9 ( 4.6%)             |
  |--------------------------------------------------------------------------|
  | sex                 F                371 (49.4%)   112 (45.0%)    0.23   |
  |                     M                371 (49.4%)   136 (54.6%)           |
  |                     U                9 ( 1.2%)     1 ( 0.4%)             |
  |--------------------------------------------------------------------------|
  | imd                 1                131 (17.4%)   42 (16.9%)     0.64   |
  |                     2                130 (17.3%)   50 (20.1%)            |
  |                     3                129 (17.2%)   46 (18.5%)            |
  |                     4                148 (19.7%)   49 (19.7%)            |
  |                     5                162 (21.6%)   52 (20.9%)            |
  |                     6                51 ( 6.8%)    10 ( 4.0%)            |
  |--------------------------------------------------------------------------|
  | ethnicity           White            111 (14.8%)   46 (18.5%)     0.76   |
  |                     Mixed            155 (20.6%)   45 (18.1%)            |
  |                     Asian            146 (19.4%)   45 (18.1%)            |
  |                     Black            143 (19.0%)   45 (18.1%)            |
  |                     Other            156 (20.8%)   54 (21.7%)            |
  |                     Unknown          40 ( 5.3%)    14 ( 5.6%)            |
  |--------------------------------------------------------------------------|
  | severe_disease_bl   0                365 (48.6%)   135 (54.2%)    0.12   |
  |                     1                386 (51.4%)   114 (45.8%)           |
  |--------------------------------------------------------------------------|
  | smoking_status      E                111 (30.0%)   45 (34.6%)     0.64   |
  |                     M                38 (10.3%)    11 ( 8.5%)            |
  |                     N                64 (17.3%)    25 (19.2%)            |
  |                     S                157 (42.4%)   49 (37.7%)            |
  |--------------------------------------------------------------------------|
  | bmi_cat             Missing          151 (20.1%)   48 (19.3%)     0.28   |
  |                     Underweight      67 ( 8.9%)    28 (11.2%)            |
  |                     Healthy range    140 (18.6%)   36 (14.5%)            |
  |                     Overweight       162 (21.6%)   55 (22.1%)            |
  |                     Obese            190 (25.3%)   74 (29.7%)            |
  |                     Morbidly obese   41 ( 5.5%)    8 ( 3.2%)             |
  |--------------------------------------------------------------------------|
  | has_pbc                              369 (49.1%)   131 (52.6%)    0.34   |
  +--------------------------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/baseline_table_udca.csv, replace
(note: file ./output/tables/baseline_table_udca.csv not found)
file ./output/tables/baseline_table_udca.csv saved

. * Rounding numbers in table to nearest 5
. forvalues i=0/1 {   
  2.     destring _columna_`i', gen(n`i') ignore(",") force
  3.     destring _columnb_`i', gen(percent`i') ignore("-" "%" "(" ")")  force
  4.     gen rounded_n`i' = round(n`i', 5)
  5.     tostring rounded_n`i', gen(n`i'_rounded)
  6.     replace n`i'_rounded = "redacted" if (n`i'_rounded=="5" | n`i'_rounded
> =="4" | n`i'_rounded=="3" | n`i'_rounded=="2" | n`i'_rounded=="1" | n`i'_roun
> ded=="0")
  7. }
_columna_0: contains nonnumeric characters not specified in ignore(); n0 genera
> ted as int
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
(2 missing values generated)
n0_rounded generated as str3
(0 real changes made)
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as int
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)
(2 missing values generated)
n1_rounded generated as str3
variable n1_rounded was str3 now str8
(1 real change made)

. keep factor level n0_rounded percent0 n1_rounded percent1

. export delimited using ./output/tables/baseline_table_udca_rounded.csv
file ./output/tables/baseline_table_udca_rounded.csv saved

. restore 

. 
. * Additional medications by any exposure
. preserve 

. table1_mc, vars(budesonide_bl bin \ fenofibrate_bl bin \ gc_bl bin \ oca_bl b
> in \ rituximab_bl bin \ severe_disease_fu bin \ vacc_any bin ) by(udca_bl) cl
> ear

  +-------------------------------------------+
  | factor              N_0   N_1   m_0   m_1 |
  |-------------------------------------------|
  | budesonide_bl       751   249     0     0 |
  |-------------------------------------------|
  | fenofibrate_bl      751   249     0     0 |
  |-------------------------------------------|
  | gc_bl               751   249     0     0 |
  |-------------------------------------------|
  | oca_bl              751   249     0     0 |
  |-------------------------------------------|
  | rituximab_bl        751   249     0     0 |
  |-------------------------------------------|
  | severe_disease_fu   751   249     0     0 |
  |-------------------------------------------|
  | vacc_any            751   249     0     0 |
  +-------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +---------------------------------------------------------+
  |                     udca_bl = 0   udca_bl = 1   p-value |
  |---------------------------------------------------------|
  |                     N=751         N=249                 |
  |---------------------------------------------------------|
  | budesonide_bl       190 (25.3%)   70 (28.1%)     0.38   |
  |---------------------------------------------------------|
  | fenofibrate_bl      187 (24.9%)   54 (21.7%)     0.30   |
  |---------------------------------------------------------|
  | gc_bl               197 (26.2%)   60 (24.1%)     0.50   |
  |---------------------------------------------------------|
  | oca_bl              380 (50.6%)   120 (48.2%)    0.51   |
  |---------------------------------------------------------|
  | rituximab_bl        379 (50.5%)   121 (48.6%)    0.61   |
  |---------------------------------------------------------|
  | severe_disease_fu   561 (74.7%)   192 (77.1%)    0.45   |
  |---------------------------------------------------------|
  | vacc_any            676 (90.0%)   225 (90.4%)    0.87   |
  +---------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/additional_meds_udca.csv, replace
(note: file ./output/tables/additional_meds_udca.csv not found)
file ./output/tables/additional_meds_udca.csv saved

. * Rounding numbers in table to nearest 5
. forvalues i=0/1 {   
  2.     destring _columna_`i', gen(n`i') ignore(",") force
  3.     destring _columnb_`i', gen(percent`i') ignore("-" "%" "(" ")")  force
  4.     gen rounded_n`i' = round(n`i', 5)
  5.     tostring rounded_n`i', gen(n`i'_rounded)
  6.     tostring percent`i', gen(percent_`i')
  7.     replace n`i'_rounded = "redacted" if (rounded_n`i'<=5)
  8.     replace percent_`i' = "redacted" if (rounded_n`i'<=5)
  9. }
_columna_0: contains nonnumeric characters not specified in ignore(); n0 genera
> ted as int
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
(2 missing values generated)
n0_rounded generated as str3
percent_0 generated as str4
(0 real changes made)
(0 real changes made)
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as int
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)
(2 missing values generated)
n1_rounded generated as str3
percent_1 generated as str4
(0 real changes made)
(0 real changes made)

. keep factor n0_rounded percent_0 n1_rounded percent_1

. export delimited using ./output/tables/additional_meds_udca_rounded.csv
file ./output/tables/additional_meds_udca_rounded.csv saved

. restore 

. 
. 
. 
. 
end of do-file

. . file open output using "/tmp/103_baseline_tables.do.raNZ.out", write text r
> eplace

. . file write output "success" 

. . file close output

. 
end of do-file


