
. 
. import delimited using ./output/input_pbc.csv, clear
(106 vars, 1,000 obs)

. 
. * Prepare variables for table 
. replace ethnicity=6 if ethnicity==0
(41 real changes made)

. label define eth5                       1 "White"                            
>            ///
>                             2 "Mixed"                           ///          
>                                    
>                             3 "Asian"                                   ///
>                             4 "Black"                                   ///
>                             5 "Other"                                   ///
>                             6 "Unknown"

.                     
. 
. label values ethnicity eth5

. safetab ethnicity, m
10

  ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |        152       15.20       15.20
      Mixed |        190       19.00       34.20
      Asian |        199       19.90       54.10
      Black |        218       21.80       75.90
      Other |        200       20.00       95.90
    Unknown |         41        4.10      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. *(2) IMD
. replace imd=6 if imd==0
(45 real changes made)

. 
. * Create age categories
. egen age_cat = cut(age), at(18, 40, 60, 80, 120) icodes
(193 missing values generated)

. label define age 0 "18 - 40 years" 1 "41 - 60 years" 2 "61 - 80 years" 3 ">80
>  years"

. label values age_cat age

. bys age_cat: sum age

-------------------------------------------------------------------------------
-> age_cat = 18 - 40 years

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        306    28.69935    6.255316         18         39

-------------------------------------------------------------------------------
-> age_cat = 41 - 60 years

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        252    49.34524     5.61478         40         59

-------------------------------------------------------------------------------
-> age_cat = 61 - 80 years

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        193    68.93264    5.889664         60         79

-------------------------------------------------------------------------------
-> age_cat = >80 years

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |         56        85.5    4.390071         80         98

-------------------------------------------------------------------------------
-> age_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        193    8.611399    5.059981          0         17


. 
. * BMI categories
. egen bmi_cat = cut(bmi), at(0, 1, 18.5, 24.9, 29.9, 39.9, 100) icodes

. bys bmi_cat: sum bmi

-------------------------------------------------------------------------------
-> bmi_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        199           0           0          0          0

-------------------------------------------------------------------------------
-> bmi_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        125     13.9534    3.574112   2.749661   18.48268

-------------------------------------------------------------------------------
-> bmi_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        189    22.12708    1.835691   18.51279     24.833

-------------------------------------------------------------------------------
-> bmi_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        188    27.41659    1.492979   24.92099   29.88993

-------------------------------------------------------------------------------
-> bmi_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        260    34.19291    2.795426   29.90575   39.78086

-------------------------------------------------------------------------------
-> bmi_cat = 5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |         39    42.76828    2.615726   39.90075   51.95408


. * add missing . to zero category
. replace bmi_cat = 0 if bmi_cat==. 
(0 real changes made)

. label define bmi 0 "Missing" 1 "Underweight" 2 "Healthy range" 3 "Overweight"
>  4 "Obese" 5 "Morbidly obese"

. label values bmi_cat bmi

. 
. replace oral_steroid_drugs_nhsd=. if oral_steroid_drug_nhsd_3m_count < 2 & or
> al_steroid_drug_nhsd_12m_count < 4
(934 real changes made, 934 to missing)

. gen imid_nhsd=max(oral_steroid_drugs_nhsd, immunosuppresant_drugs_nhsd)

. gen rare_neuro_nhsd = max(multiple_sclerosis_nhsd, motor_neurone_disease_nhsd
> , myasthenia_gravis_nhsd, huntingtons_disease_nhsd)

. gen solid_organ_transplant_bin = solid_organ_transplant_nhsd_new!=""

. gen any_high_risk_condition = max(learning_disability_nhsd_snomed, cancer_ope
> nsafely_snomed_new, haematological_disease_nhsd, ///
> ckd_stage_5_nhsd, imid_nhsd, immunosupression_nhsd_new, hiv_aids_nhsd, solid_
> organ_transplant_bin, rare_neuro_nhsd)

. 
. foreach var in udca gc budesonide fenofibrate {
  2.     gen `var'_any = (`var'_count_fu>=1 & `var'_count_fu!=.)
  3.     gen `var'_bl = (`var'_count_bl>=1 & `var'_count_bl!=.)
  4. }

. 
. * Generate variable with number of vaccinations 
. foreach var in covid_vacc_first covid_vacc_second covid_vacc_third covid_vacc
> _fourth covid_vacc_fifth {
  2.     gen `var'= (`var'_date!="")    
  3. }

. 
. egen vacc_any = rowmax(covid_vacc_first covid_vacc_second covid_vacc_third co
> vid_vacc_fourth covid_vacc_fifth)

. egen total_vaccs = rowmax(covid_vacc_first covid_vacc_second covid_vacc_third
>  covid_vacc_fourth covid_vacc_fifth)

. tab total_vaccs 

total_vaccs |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          7        0.70        0.70
          1 |        993       99.30      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. 
. gen severe_disease_fu = severe_disease_fu_date!=""

. 
. 
. 
. * Create tables 
. * Characteristics whole cohort
. preserve

. table1_mc, vars(age_cat cat \ sex cat \ imd cat \ ethnicity cat \ severe_dise
> ase_bl cat \ smoking_status cat \ bmi_cat cat \ has_pbc bin \ ///
> any_high_risk_condition cat) clear

  +---------------------------------------+
  | factor                      N_1   m_1 |
  |---------------------------------------|
  | age_cat                     807   193 |
  |---------------------------------------|
  | sex                       1,000     0 |
  |---------------------------------------|
  | imd                       1,000     0 |
  |---------------------------------------|
  | ethnicity                 1,000     0 |
  |---------------------------------------|
  | severe_disease_bl         1,000     0 |
  |---------------------------------------|
  | smoking_status              500   500 |
  |---------------------------------------|
  | bmi_cat                   1,000     0 |
  |---------------------------------------|
  | has_pbc                   1,000     0 |
  |---------------------------------------|
  | any_high_risk_condition   1,000     0 |
  +---------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +-----------------------------------------------------------+
  |                                            Total          |
  |-----------------------------------------------------------|
  |                                            N=1,000        |
  |-----------------------------------------------------------|
  | age_cat                   18 - 40 years    306 (37.9%)    |
  |                           41 - 60 years    252 (31.2%)    |
  |                           61 - 80 years    193 (23.9%)    |
  |                           >80 years        56 ( 6.9%)     |
  |-----------------------------------------------------------|
  | sex                       F                478 (47.8%)    |
  |                           M                507 (50.7%)    |
  |                           U                15 ( 1.5%)     |
  |-----------------------------------------------------------|
  | imd                       1                186 (18.6%)    |
  |                           2                192 (19.2%)    |
  |                           3                213 (21.3%)    |
  |                           4                187 (18.7%)    |
  |                           5                177 (17.7%)    |
  |                           6                45 ( 4.5%)     |
  |-----------------------------------------------------------|
  | ethnicity                 White            152 (15.2%)    |
  |                           Mixed            190 (19.0%)    |
  |                           Asian            199 (19.9%)    |
  |                           Black            218 (21.8%)    |
  |                           Other            200 (20.0%)    |
  |                           Unknown          41 ( 4.1%)     |
  |-----------------------------------------------------------|
  | severe_disease_bl         0                500 (50.0%)    |
  |                           1                500 (50.0%)    |
  |-----------------------------------------------------------|
  | smoking_status            E                128 (25.6%)    |
  |                           M                56 (11.2%)     |
  |                           N                97 (19.4%)     |
  |                           S                219 (43.8%)    |
  |-----------------------------------------------------------|
  | bmi_cat                   Missing          199 (19.9%)    |
  |                           Underweight      125 (12.5%)    |
  |                           Healthy range    189 (18.9%)    |
  |                           Overweight       188 (18.8%)    |
  |                           Obese            260 (26.0%)    |
  |                           Morbidly obese   39 ( 3.9%)     |
  |-----------------------------------------------------------|
  | has_pbc                                    500 (50.0%)    |
  |-----------------------------------------------------------|
  | any_high_risk_condition   1                1,000 (100.0%) |
  +-----------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/baseline_table.csv, replace
(note: file ./output/tables/baseline_table.csv not found)
file ./output/tables/baseline_table.csv saved

. * Rounding numbers in table to nearest 5
. destring _columna_1, gen(n) ignore(",") force
_columna_1: contains nonnumeric characters not specified in ignore()
_columna_1: character , removed; n generated as int
(2 missing values generated)

. destring _columnb_1, gen(percent) ignore("-" "%" "(" ")")  force
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent generated as double
(2 missing values generated)

. gen rounded_n = round(n, 5)
(2 missing values generated)

. tostring rounded_n, gen(n_rounded)
n_rounded generated as str4

. replace n_rounded = "redacted" if (n_rounded=="5" | n_rounded=="4" | n_rounde
> d=="3" | n_rounded=="2" | n_rounded=="1" | n_rounded=="0")
(0 real changes made)

. keep factor level n_rounded percent

. export delimited using ./output/tables/baseline_table_rounded.csv
file ./output/tables/baseline_table_rounded.csv saved

. restore 

. 
. * High risk conditions
. preserve

. table1_mc, vars(learning_disability_nhsd_snomed cat \ cancer_opensafely_snome
> d_new cat \ haematological_disease_nhsd cat \ ///
> ckd_stage_5_nhsd cat \ imid_nhsd cat \ immunosupression_nhsd_new cat \ hiv_ai
> ds_nhsd cat \ solid_organ_transplant_bin cat \  ///
> rare_neuro_nhsd cat) clear

  +-----------------------------------------------+
  | factor                              N_1   m_1 |
  |-----------------------------------------------|
  | learning_disability_nhsd_snomed   1,000     0 |
  |-----------------------------------------------|
  | cancer_opensafely_snomed_new      1,000     0 |
  |-----------------------------------------------|
  | haematological_disease_nhsd       1,000     0 |
  |-----------------------------------------------|
  | ckd_stage_5_nhsd                  1,000     0 |
  |-----------------------------------------------|
  | imid_nhsd                         1,000     0 |
  |-----------------------------------------------|
  | immunosupression_nhsd_new         1,000     0 |
  |-----------------------------------------------|
  | hiv_aids_nhsd                     1,000     0 |
  |-----------------------------------------------|
  | solid_organ_transplant_bin        1,000     0 |
  |-----------------------------------------------|
  | rare_neuro_nhsd                   1,000     0 |
  +-----------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +-------------------------------------------------------+
  |                                           Total       |
  |-------------------------------------------------------|
  |                                           N=1,000     |
  |-------------------------------------------------------|
  | learning_disability_nhsd_snomed   0       500 (50.0%) |
  |                                   1       500 (50.0%) |
  |-------------------------------------------------------|
  | cancer_opensafely_snomed_new      0       500 (50.0%) |
  |                                   1       500 (50.0%) |
  |-------------------------------------------------------|
  | haematological_disease_nhsd       0       16 ( 1.6%)  |
  |                                   1       984 (98.4%) |
  |-------------------------------------------------------|
  | ckd_stage_5_nhsd                  0       254 (25.4%) |
  |                                   1       746 (74.6%) |
  |-------------------------------------------------------|
  | imid_nhsd                         0       490 (49.0%) |
  |                                   1       510 (51.0%) |
  |-------------------------------------------------------|
  | immunosupression_nhsd_new         0       500 (50.0%) |
  |                                   1       500 (50.0%) |
  |-------------------------------------------------------|
  | hiv_aids_nhsd                     0       749 (74.9%) |
  |                                   1       251 (25.1%) |
  |-------------------------------------------------------|
  | solid_organ_transplant_bin        0       497 (49.7%) |
  |                                   1       503 (50.3%) |
  |-------------------------------------------------------|
  | rare_neuro_nhsd                   0       2 ( 0.2%)   |
  |                                   1       998 (99.8%) |
  +-------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/high_risk.csv, replace
(note: file ./output/tables/high_risk.csv not found)
file ./output/tables/high_risk.csv saved

. * Rounding numbers in table to nearest 5
. destring _columna_1, gen(n) ignore(",") force
_columna_1: contains nonnumeric characters not specified in ignore(); n generat
> ed as int
(2 missing values generated)

. destring _columnb_1, gen(percent) ignore("-" "%" "(" ")")  force
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent generated as double
(2 missing values generated)

. gen rounded_n = round(n, 5)
(2 missing values generated)

. tostring rounded_n, gen(n_rounded)
n_rounded generated as str4

. replace n_rounded = "redacted" if (n_rounded=="5" | n_rounded=="4" | n_rounde
> d=="3" | n_rounded=="2" | n_rounded=="1" | n_rounded=="0")
variable n_rounded was str4 now str8
(1 real change made)

. keep factor level n_rounded percent

. export delimited using ./output/tables/high_risk_rounded.csv
file ./output/tables/high_risk_rounded.csv saved

. restore 

. 
. 
. 
. * Characteristics by exposure status at baseline 
. preserve 

. table1_mc, vars(age_cat cat \ sex cat \ imd cat \ ethnicity cat \ severe_dise
> ase_bl cat \ smoking_status cat \ bmi_cat cat \ has_pbc bin) by(udca_bl) clea
> r

  +-------------------------------------------+
  | factor              N_0   N_1   m_0   m_1 |
  |-------------------------------------------|
  | age_cat             583   224   152    41 |
  |-------------------------------------------|
  | sex                 735   265     0     0 |
  |-------------------------------------------|
  | imd                 735   265     0     0 |
  |-------------------------------------------|
  | ethnicity           735   265     0     0 |
  |-------------------------------------------|
  | severe_disease_bl   735   265     0     0 |
  |-------------------------------------------|
  | smoking_status      364   136   371   129 |
  |-------------------------------------------|
  | bmi_cat             735   265     0     0 |
  |-------------------------------------------|
  | has_pbc             735   265     0     0 |
  +-------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------------------+
  |                                      udca_bl = 0   udca_bl = 1   p-value |
  |--------------------------------------------------------------------------|
  |                                      N=735         N=265                 |
  |--------------------------------------------------------------------------|
  | age_cat             18 - 40 years    221 (37.9%)   85 (37.9%)     0.39   |
  |                     41 - 60 years    189 (32.4%)   63 (28.1%)            |
  |                     61 - 80 years    131 (22.5%)   62 (27.7%)            |
  |                     >80 years        42 ( 7.2%)    14 ( 6.2%)            |
  |--------------------------------------------------------------------------|
  | sex                 F                351 (47.8%)   127 (47.9%)    0.85   |
  |                     M                372 (50.6%)   135 (50.9%)           |
  |                     U                12 ( 1.6%)    3 ( 1.1%)             |
  |--------------------------------------------------------------------------|
  | imd                 1                147 (20.0%)   39 (14.7%)     0.029  |
  |                     2                147 (20.0%)   45 (17.0%)            |
  |                     3                163 (22.2%)   50 (18.9%)            |
  |                     4                123 (16.7%)   64 (24.2%)            |
  |                     5                122 (16.6%)   55 (20.8%)            |
  |                     6                33 ( 4.5%)    12 ( 4.5%)            |
  |--------------------------------------------------------------------------|
  | ethnicity           White            106 (14.4%)   46 (17.4%)     0.37   |
  |                     Mixed            145 (19.7%)   45 (17.0%)            |
  |                     Asian            146 (19.9%)   53 (20.0%)            |
  |                     Black            153 (20.8%)   65 (24.5%)            |
  |                     Other            151 (20.5%)   49 (18.5%)            |
  |                     Unknown          34 ( 4.6%)    7 ( 2.6%)             |
  |--------------------------------------------------------------------------|
  | severe_disease_bl   0                365 (49.7%)   135 (50.9%)    0.72   |
  |                     1                370 (50.3%)   130 (49.1%)           |
  |--------------------------------------------------------------------------|
  | smoking_status      E                91 (25.0%)    37 (27.2%)     0.18   |
  |                     M                35 ( 9.6%)    21 (15.4%)            |
  |                     N                70 (19.2%)    27 (19.9%)            |
  |                     S                168 (46.2%)   51 (37.5%)            |
  |--------------------------------------------------------------------------|
  | bmi_cat             Missing          141 (19.2%)   58 (21.9%)     0.16   |
  |                     Underweight      92 (12.5%)    33 (12.5%)            |
  |                     Healthy range    152 (20.7%)   37 (14.0%)            |
  |                     Overweight       130 (17.7%)   58 (21.9%)            |
  |                     Obese            189 (25.7%)   71 (26.8%)            |
  |                     Morbidly obese   31 ( 4.2%)    8 ( 3.0%)             |
  |--------------------------------------------------------------------------|
  | has_pbc                              361 (49.1%)   139 (52.5%)    0.35   |
  +--------------------------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/baseline_table_udca.csv, replace
(note: file ./output/tables/baseline_table_udca.csv not found)
file ./output/tables/baseline_table_udca.csv saved

. * Rounding numbers in table to nearest 5
. forvalues i=0/1 {   
  2.     destring _columna_`i', gen(n`i') ignore(",") force
  3.     destring _columnb_`i', gen(percent`i') ignore("-" "%" "(" ")")  force
  4.     gen rounded_n`i' = round(n`i', 5)
  5.     tostring rounded_n`i', gen(n`i'_rounded)
  6.     replace n`i'_rounded = "redacted" if (n`i'_rounded=="5" | n`i'_rounded
> =="4" | n`i'_rounded=="3" | n`i'_rounded=="2" | n`i'_rounded=="1" | n`i'_roun
> ded=="0")
  7. }
_columna_0: contains nonnumeric characters not specified in ignore(); n0 genera
> ted as int
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
(2 missing values generated)
n0_rounded generated as str3
(0 real changes made)
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as int
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)
(2 missing values generated)
n1_rounded generated as str3
variable n1_rounded was str3 now str8
(2 real changes made)

. keep factor level n0_rounded percent0 n1_rounded percent1

. export delimited using ./output/tables/baseline_table_udca_rounded.csv
file ./output/tables/baseline_table_udca_rounded.csv saved

. restore 

. 
. * Additional medications by any exposure
. preserve 

. table1_mc, vars(budesonide_bl bin \ fenofibrate_bl bin \ gc_bl bin \ oca_bl b
> in \ rituximab_bl bin \ severe_disease_fu bin \ vacc_any bin  \ total_vaccs c
> at) by(udca_bl) clear

  +-------------------------------------------+
  | factor              N_0   N_1   m_0   m_1 |
  |-------------------------------------------|
  | budesonide_bl       735   265     0     0 |
  |-------------------------------------------|
  | fenofibrate_bl      735   265     0     0 |
  |-------------------------------------------|
  | gc_bl               735   265     0     0 |
  |-------------------------------------------|
  | oca_bl              735   265     0     0 |
  |-------------------------------------------|
  | rituximab_bl        735   265     0     0 |
  |-------------------------------------------|
  | severe_disease_fu   735   265     0     0 |
  |-------------------------------------------|
  | vacc_any            735   265     0     0 |
  |-------------------------------------------|
  | total_vaccs         735   265     0     0 |
  +-------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +-----------------------------------------------------------------+
  |                             udca_bl = 0   udca_bl = 1   p-value |
  |-----------------------------------------------------------------|
  |                             N=735         N=265                 |
  |-----------------------------------------------------------------|
  | budesonide_bl               194 (26.4%)   56 (21.1%)     0.090  |
  |-----------------------------------------------------------------|
  | fenofibrate_bl              175 (23.8%)   67 (25.3%)     0.63   |
  |-----------------------------------------------------------------|
  | gc_bl                       178 (24.2%)   74 (27.9%)     0.23   |
  |-----------------------------------------------------------------|
  | oca_bl                      371 (50.5%)   129 (48.7%)    0.62   |
  |-----------------------------------------------------------------|
  | rituximab_bl                374 (50.9%)   126 (47.5%)    0.35   |
  |-----------------------------------------------------------------|
  | severe_disease_fu           547 (74.4%)   203 (76.6%)    0.48   |
  |-----------------------------------------------------------------|
  | vacc_any                    729 (99.2%)   264 (99.6%)    0.46   |
  |-----------------------------------------------------------------|
  | total_vaccs         0       6 ( 0.8%)     1 ( 0.4%)      0.46   |
  |                     1       729 (99.2%)   264 (99.6%)           |
  +-----------------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/additional_meds_udca.csv, replace
(note: file ./output/tables/additional_meds_udca.csv not found)
file ./output/tables/additional_meds_udca.csv saved

. * Rounding numbers in table to nearest 5
. forvalues i=0/1 {   
  2.     destring _columna_`i', gen(n`i') ignore(",") force
  3.     destring _columnb_`i', gen(percent`i') ignore("-" "%" "(" ")")  force
  4.     gen rounded_n`i' = round(n`i', 5)
  5.     tostring rounded_n`i', gen(n`i'_rounded)
  6.     tostring percent`i', gen(percent_`i')
  7.     replace n`i'_rounded = "redacted" if (rounded_n`i'<=5)
  8.     replace percent_`i' = "redacted" if (rounded_n`i'<=5)
  9. }
_columna_0: contains nonnumeric characters not specified in ignore(); n0 genera
> ted as int
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
(2 missing values generated)
n0_rounded generated as str3
percent_0 generated as str4
variable n0_rounded was str3 now str8
(1 real change made)
variable percent_0 was str4 now str8
(1 real change made)
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as int
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)
(2 missing values generated)
n1_rounded generated as str3
percent_1 generated as str4
variable n1_rounded was str3 now str8
(1 real change made)
variable percent_1 was str4 now str8
(1 real change made)

. keep factor n0_rounded percent_0 n1_rounded percent_1

. export delimited using ./output/tables/additional_meds_udca_rounded.csv
file ./output/tables/additional_meds_udca_rounded.csv saved

. restore 

. 
. * Checking outcomes 
. foreach var in died_date_ons hosp_covid_primary hosp_covid_any {
  2.     gen `var'A = date(`var', "YMD")
  3.     format `var'A %dD/N/CY
  4.     drop `var'
  5. }
(500 missing values generated)
(900 missing values generated)
(900 missing values generated)

. * Flag if died
. gen died_flag = died_date_onsA!=.

. * Generate date if died of covid
. gen died_date_onscovid = died_date_onsA if died_ons_covid_flag_any == 1
(742 missing values generated)

. 
. * Flag hospitalised with covid 
. gen hosp_any_flag = hosp_covid_anyA!=.

. 
. * Composite outcome 
. gen hosp_died = (died_ons_covid_flag_any==1 | hosp_any_flag==1)

. egen hosp_died_dateA = rowmin(died_date_onsA hosp_covid_anyA)
(452 missing values generated)

. 
. 
. tab udca_bl died_ons_covid_flag_any

           | died_ons_covid_flag_a
           |          ny
   udca_bl |         0          1 |     Total
-----------+----------------------+----------
         0 |       365        370 |       735 
         1 |       135        130 |       265 
-----------+----------------------+----------
     Total |       500        500 |     1,000 

. tab udca_bl hosp_any_flag

           |     hosp_any_flag
   udca_bl |         0          1 |     Total
-----------+----------------------+----------
         0 |       659         76 |       735 
         1 |       241         24 |       265 
-----------+----------------------+----------
     Total |       900        100 |     1,000 

. 
. table1_mc, by(udca_bl) vars(died_ons_covid_flag_any bin \ hosp_any_flag bin \
>  hosp_died bin) clear

  +-------------------------------------------------+
  | factor                    N_0   N_1   m_0   m_1 |
  |-------------------------------------------------|
  | died_ons_covid_flag_any   735   265     0     0 |
  |-------------------------------------------------|
  | hosp_any_flag             735   265     0     0 |
  |-------------------------------------------------|
  | hosp_died                 735   265     0     0 |
  +-------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +---------------------------------------------------------------+
  |                           udca_bl = 0   udca_bl = 1   p-value |
  |---------------------------------------------------------------|
  |                           N=735         N=265                 |
  |---------------------------------------------------------------|
  | died_ons_covid_flag_any   370 (50.3%)   130 (49.1%)    0.72   |
  |---------------------------------------------------------------|
  | hosp_any_flag             76 (10.3%)    24 ( 9.1%)     0.55   |
  |---------------------------------------------------------------|
  | hosp_died                 409 (55.6%)   144 (54.3%)    0.71   |
  +---------------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/baseline_outcomes.csv
file ./output/tables/baseline_outcomes.csv saved

. forvalues i=0/1 {   
  2.     destring _columna_`i', gen(n`i') ignore(",") force
  3.     destring _columnb_`i', gen(percent`i') ignore("-" "%" "(" ")")  force
  4.     gen rounded_n`i' = round(n`i', 5)
  5.     tostring rounded_n`i', gen(n`i'_rounded)
  6.     tostring percent`i', gen(percent_`i')
  7.     replace n`i'_rounded = "redacted" if (rounded_n`i'<=5)
  8.     replace percent_`i' = "redacted" if (rounded_n`i'<=5)
  9. }
_columna_0: contains nonnumeric characters not specified in ignore(); n0 genera
> ted as int
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
(2 missing values generated)
n0_rounded generated as str3
percent_0 generated as str4
(0 real changes made)
(0 real changes made)
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as int
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)
(2 missing values generated)
n1_rounded generated as str3
percent_1 generated as str4
(0 real changes made)
(0 real changes made)

. keep factor rounded_n0 percent0 rounded_n1 percent1

. export delimited using ./output/tables/baseline_outcomes_rounded.csv
file ./output/tables/baseline_outcomes_rounded.csv saved

. 
end of do-file

. . file open output using "/tmp/104_baseline_tables.do.3tBF.out", write text r
> eplace

. . file write output "success" 

. . file close output

. 
end of do-file


