
. 
. import delimited using ./output/input_pbc.csv, clear
(106 vars, 1,000 obs)

. 
. * Prepare variables for table 
. replace ethnicity=6 if ethnicity==0
(49 real changes made)

. label define eth5                       1 "White"                            
>            ///
>                             2 "Mixed"                           ///          
>                                    
>                             3 "Asian"                                   ///
>                             4 "Black"                                   ///
>                             5 "Other"                                   ///
>                             6 "Unknown"

.                     
. 
. label values ethnicity eth5

. safetab ethnicity, m
10

  ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |        136       13.60       13.60
      Mixed |        199       19.90       33.50
      Asian |        210       21.00       54.50
      Black |        205       20.50       75.00
      Other |        201       20.10       95.10
    Unknown |         49        4.90      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. *(2) IMD
. replace imd=6 if imd==0
(54 real changes made)

. 
. * Create age categories
. egen age_cat = cut(age), at(18, 40, 60, 80, 120) icodes
(210 missing values generated)

. label define age 0 "18 - 40 years" 1 "41 - 60 years" 2 "61 - 80 years" 3 ">80
>  years"

. label values age_cat age

. bys age_cat: sum age

-------------------------------------------------------------------------------
-> age_cat = 18 - 40 years

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        271    28.85978    6.165217         18         39

-------------------------------------------------------------------------------
-> age_cat = 41 - 60 years

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        254    49.34646    5.779038         40         59

-------------------------------------------------------------------------------
-> age_cat = 61 - 80 years

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        208    68.55769    5.478684         60         79

-------------------------------------------------------------------------------
-> age_cat = >80 years

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |         57    85.22807    4.403803         80         96

-------------------------------------------------------------------------------
-> age_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        210    7.638095    4.887488          0         17


. 
. * BMI categories
. egen bmi_cat = cut(bmi), at(0, 1, 18.5, 24.9, 29.9, 39.9, 100) icodes

. bys bmi_cat: sum bmi

-------------------------------------------------------------------------------
-> bmi_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        199           0           0          0          0

-------------------------------------------------------------------------------
-> bmi_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |         85    14.45949    3.252124   3.873663   18.48774

-------------------------------------------------------------------------------
-> bmi_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        185    22.00969    1.716329   18.53792   24.83978

-------------------------------------------------------------------------------
-> bmi_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        191    27.32346    1.386647   24.93484   29.79936

-------------------------------------------------------------------------------
-> bmi_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        276    33.80112    2.638655   29.90364   39.87712

-------------------------------------------------------------------------------
-> bmi_cat = 5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |         64    42.87403    2.905725   39.92033   52.93908


. * add missing . to zero category
. replace bmi_cat = 0 if bmi_cat==. 
(0 real changes made)

. label define bmi 0 "Missing" 1 "Underweight" 2 "Healthy range" 3 "Overweight"
>  4 "Obese" 5 "Morbidly obese"

. label values bmi_cat bmi

. 
. replace oral_steroid_drugs_nhsd=. if oral_steroid_drug_nhsd_3m_count < 2 & or
> al_steroid_drug_nhsd_12m_count < 4
(942 real changes made, 942 to missing)

. gen imid_nhsd=max(oral_steroid_drugs_nhsd, immunosuppresant_drugs_nhsd)

. gen rare_neuro_nhsd = max(multiple_sclerosis_nhsd, motor_neurone_disease_nhsd
> , myasthenia_gravis_nhsd, huntingtons_disease_nhsd)

. gen solid_organ_transplant_bin = solid_organ_transplant_nhsd_new!=""

. gen any_high_risk_condition = max(learning_disability_nhsd_snomed, cancer_ope
> nsafely_snomed_new, haematological_disease_nhsd, ///
> ckd_stage_5_nhsd, imid_nhsd, immunosupression_nhsd_new, hiv_aids_nhsd, solid_
> organ_transplant_bin, rare_neuro_nhsd)

. 
. foreach var in udca gc budesonide fenofibrate {
  2.     gen `var'_any = (`var'_count_fu>=1 & `var'_count_fu!=.)
  3.     gen `var'_bl = (`var'_count_bl>=1 & `var'_count_bl!=.)
  4. }

. 
. * Generate variable with number of vaccinations 
. foreach var in covid_vacc_first covid_vacc_second covid_vacc_third covid_vacc
> _fourth covid_vacc_fifth {
  2.     gen `var'= (`var'_date!="")    
  3. }

. 
. egen vacc_any = rowmax(covid_vacc_first covid_vacc_second covid_vacc_third co
> vid_vacc_fourth covid_vacc_fifth)

. egen total_vaccs = rowtotal(covid_vacc_first covid_vacc_second covid_vacc_thi
> rd covid_vacc_fourth covid_vacc_fifth)

. tab total_vaccs 

total_vaccs |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          4        0.40        0.40
          1 |         65        6.50        6.90
          2 |        295       29.50       36.40
          3 |        416       41.60       78.00
          4 |        201       20.10       98.10
          5 |         19        1.90      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. 
. gen severe_disease_fu = severe_disease_fu_date!=""

. 
. 
. 
. * Create tables 
. * Characteristics whole cohort
. preserve

. table1_mc, vars(age_cat cat \ sex cat \ imd cat \ ethnicity cat \ severe_dise
> ase_bl cat \ smoking_status cat \ bmi_cat cat \ has_pbc bin \ ///
> any_high_risk_condition cat) clear

  +---------------------------------------+
  | factor                      N_1   m_1 |
  |---------------------------------------|
  | age_cat                     790   210 |
  |---------------------------------------|
  | sex                       1,000     0 |
  |---------------------------------------|
  | imd                       1,000     0 |
  |---------------------------------------|
  | ethnicity                 1,000     0 |
  |---------------------------------------|
  | severe_disease_bl         1,000     0 |
  |---------------------------------------|
  | smoking_status              500   500 |
  |---------------------------------------|
  | bmi_cat                   1,000     0 |
  |---------------------------------------|
  | has_pbc                   1,000     0 |
  |---------------------------------------|
  | any_high_risk_condition   1,000     0 |
  +---------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +-----------------------------------------------------------+
  |                                            Total          |
  |-----------------------------------------------------------|
  |                                            N=1,000        |
  |-----------------------------------------------------------|
  | age_cat                   18 - 40 years    271 (34.3%)    |
  |                           41 - 60 years    254 (32.2%)    |
  |                           61 - 80 years    208 (26.3%)    |
  |                           >80 years        57 ( 7.2%)     |
  |-----------------------------------------------------------|
  | sex                       F                488 (48.8%)    |
  |                           M                502 (50.2%)    |
  |                           U                10 ( 1.0%)     |
  |-----------------------------------------------------------|
  | imd                       1                213 (21.3%)    |
  |                           2                200 (20.0%)    |
  |                           3                176 (17.6%)    |
  |                           4                197 (19.7%)    |
  |                           5                160 (16.0%)    |
  |                           6                54 ( 5.4%)     |
  |-----------------------------------------------------------|
  | ethnicity                 White            136 (13.6%)    |
  |                           Mixed            199 (19.9%)    |
  |                           Asian            210 (21.0%)    |
  |                           Black            205 (20.5%)    |
  |                           Other            201 (20.1%)    |
  |                           Unknown          49 ( 4.9%)     |
  |-----------------------------------------------------------|
  | severe_disease_bl         0                500 (50.0%)    |
  |                           1                500 (50.0%)    |
  |-----------------------------------------------------------|
  | smoking_status            E                158 (31.6%)    |
  |                           M                47 ( 9.4%)     |
  |                           N                97 (19.4%)     |
  |                           S                198 (39.6%)    |
  |-----------------------------------------------------------|
  | bmi_cat                   Missing          199 (19.9%)    |
  |                           Underweight      85 ( 8.5%)     |
  |                           Healthy range    185 (18.5%)    |
  |                           Overweight       191 (19.1%)    |
  |                           Obese            276 (27.6%)    |
  |                           Morbidly obese   64 ( 6.4%)     |
  |-----------------------------------------------------------|
  | has_pbc                                    500 (50.0%)    |
  |-----------------------------------------------------------|
  | any_high_risk_condition   1                1,000 (100.0%) |
  +-----------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/baseline_table.csv, replace
(note: file ./output/tables/baseline_table.csv not found)
file ./output/tables/baseline_table.csv saved

. * Rounding numbers in table to nearest 5
. destring _columna_1, gen(n) ignore(",") force
_columna_1: contains nonnumeric characters not specified in ignore()
_columna_1: character , removed; n generated as int
(2 missing values generated)

. destring _columnb_1, gen(percent) ignore("-" "%" "(" ")")  force
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent generated as double
(2 missing values generated)

. gen rounded_n = round(n, 5)
(2 missing values generated)

. tostring rounded_n, gen(n_rounded)
n_rounded generated as str4

. replace n_rounded = "redacted" if (rounded_n<=5)
(0 real changes made)

. keep factor level n_rounded percent

. export delimited using ./output/tables/baseline_table_rounded.csv
file ./output/tables/baseline_table_rounded.csv saved

. restore 

. 
. * High risk conditions
. preserve

. table1_mc, vars(learning_disability_nhsd_snomed cat \ cancer_opensafely_snome
> d_new cat \ haematological_disease_nhsd cat \ ///
> ckd_stage_5_nhsd cat \ imid_nhsd cat \ immunosupression_nhsd_new cat \ hiv_ai
> ds_nhsd cat \ solid_organ_transplant_bin cat \  ///
> rare_neuro_nhsd cat) clear

  +-----------------------------------------------+
  | factor                              N_1   m_1 |
  |-----------------------------------------------|
  | learning_disability_nhsd_snomed   1,000     0 |
  |-----------------------------------------------|
  | cancer_opensafely_snomed_new      1,000     0 |
  |-----------------------------------------------|
  | haematological_disease_nhsd       1,000     0 |
  |-----------------------------------------------|
  | ckd_stage_5_nhsd                  1,000     0 |
  |-----------------------------------------------|
  | imid_nhsd                         1,000     0 |
  |-----------------------------------------------|
  | immunosupression_nhsd_new         1,000     0 |
  |-----------------------------------------------|
  | hiv_aids_nhsd                     1,000     0 |
  |-----------------------------------------------|
  | solid_organ_transplant_bin        1,000     0 |
  |-----------------------------------------------|
  | rare_neuro_nhsd                   1,000     0 |
  +-----------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +-------------------------------------------------------+
  |                                           Total       |
  |-------------------------------------------------------|
  |                                           N=1,000     |
  |-------------------------------------------------------|
  | learning_disability_nhsd_snomed   0       500 (50.0%) |
  |                                   1       500 (50.0%) |
  |-------------------------------------------------------|
  | cancer_opensafely_snomed_new      0       500 (50.0%) |
  |                                   1       500 (50.0%) |
  |-------------------------------------------------------|
  | haematological_disease_nhsd       0       14 ( 1.4%)  |
  |                                   1       986 (98.6%) |
  |-------------------------------------------------------|
  | ckd_stage_5_nhsd                  0       240 (24.0%) |
  |                                   1       760 (76.0%) |
  |-------------------------------------------------------|
  | imid_nhsd                         0       485 (48.5%) |
  |                                   1       515 (51.5%) |
  |-------------------------------------------------------|
  | immunosupression_nhsd_new         0       500 (50.0%) |
  |                                   1       500 (50.0%) |
  |-------------------------------------------------------|
  | hiv_aids_nhsd                     0       766 (76.6%) |
  |                                   1       234 (23.4%) |
  |-------------------------------------------------------|
  | solid_organ_transplant_bin        0       491 (49.1%) |
  |                                   1       509 (50.9%) |
  |-------------------------------------------------------|
  | rare_neuro_nhsd                   0       3 ( 0.3%)   |
  |                                   1       997 (99.7%) |
  +-------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/high_risk.csv, replace
(note: file ./output/tables/high_risk.csv not found)
file ./output/tables/high_risk.csv saved

. * Rounding numbers in table to nearest 5
. destring _columna_1, gen(n) ignore(",") force
_columna_1: contains nonnumeric characters not specified in ignore(); n generat
> ed as int
(2 missing values generated)

. destring _columnb_1, gen(percent) ignore("-" "%" "(" ")")  force
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent generated as double
(2 missing values generated)

. gen rounded_n = round(n, 5)
(2 missing values generated)

. tostring rounded_n, gen(n_rounded)
n_rounded generated as str3

. replace n_rounded = "redacted" if (rounded_n<=5)
variable n_rounded was str3 now str8
(1 real change made)

. keep factor level n_rounded percent

. export delimited using ./output/tables/high_risk_rounded.csv
file ./output/tables/high_risk_rounded.csv saved

. restore 

. 
. 
. 
. * Characteristics by exposure status at baseline 
. preserve 

. table1_mc, vars(age_cat cat \ sex cat \ imd cat \ ethnicity cat \ severe_dise
> ase_bl cat \ smoking_status cat \ bmi_cat cat \ has_pbc bin) by(udca_bl) clea
> r

  +-------------------------------------------+
  | factor              N_0   N_1   m_0   m_1 |
  |-------------------------------------------|
  | age_cat             610   180   150    60 |
  |-------------------------------------------|
  | sex                 760   240     0     0 |
  |-------------------------------------------|
  | imd                 760   240     0     0 |
  |-------------------------------------------|
  | ethnicity           760   240     0     0 |
  |-------------------------------------------|
  | severe_disease_bl   760   240     0     0 |
  |-------------------------------------------|
  | smoking_status      383   117   377   123 |
  |-------------------------------------------|
  | bmi_cat             760   240     0     0 |
  |-------------------------------------------|
  | has_pbc             760   240     0     0 |
  +-------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +--------------------------------------------------------------------------+
  |                                      udca_bl = 0   udca_bl = 1   p-value |
  |--------------------------------------------------------------------------|
  |                                      N=760         N=240                 |
  |--------------------------------------------------------------------------|
  | age_cat             18 - 40 years    217 (35.6%)   54 (30.0%)     0.53   |
  |                     41 - 60 years    194 (31.8%)   60 (33.3%)            |
  |                     61 - 80 years    155 (25.4%)   53 (29.4%)            |
  |                     >80 years        44 ( 7.2%)    13 ( 7.2%)            |
  |--------------------------------------------------------------------------|
  | sex                 F                371 (48.8%)   117 (48.8%)    0.96   |
  |                     M                381 (50.1%)   121 (50.4%)           |
  |                     U                8 ( 1.1%)     2 ( 0.8%)             |
  |--------------------------------------------------------------------------|
  | imd                 1                154 (20.3%)   59 (24.6%)     0.70   |
  |                     2                150 (19.7%)   50 (20.8%)            |
  |                     3                138 (18.2%)   38 (15.8%)            |
  |                     4                150 (19.7%)   47 (19.6%)            |
  |                     5                126 (16.6%)   34 (14.2%)            |
  |                     6                42 ( 5.5%)    12 ( 5.0%)            |
  |--------------------------------------------------------------------------|
  | ethnicity           White            108 (14.2%)   28 (11.7%)     0.78   |
  |                     Mixed            144 (18.9%)   55 (22.9%)            |
  |                     Asian            159 (20.9%)   51 (21.2%)            |
  |                     Black            157 (20.7%)   48 (20.0%)            |
  |                     Other            155 (20.4%)   46 (19.2%)            |
  |                     Unknown          37 ( 4.9%)    12 ( 5.0%)            |
  |--------------------------------------------------------------------------|
  | severe_disease_bl   0                384 (50.5%)   116 (48.3%)    0.55   |
  |                     1                376 (49.5%)   124 (51.7%)           |
  |--------------------------------------------------------------------------|
  | smoking_status      E                112 (29.2%)   46 (39.3%)     0.12   |
  |                     M                35 ( 9.1%)    12 (10.3%)            |
  |                     N                81 (21.1%)    16 (13.7%)            |
  |                     S                155 (40.5%)   43 (36.8%)            |
  |--------------------------------------------------------------------------|
  | bmi_cat             Missing          163 (21.4%)   36 (15.0%)     0.19   |
  |                     Underweight      64 ( 8.4%)    21 ( 8.8%)            |
  |                     Healthy range    130 (17.1%)   55 (22.9%)            |
  |                     Overweight       145 (19.1%)   46 (19.2%)            |
  |                     Obese            208 (27.4%)   68 (28.3%)            |
  |                     Morbidly obese   50 ( 6.6%)    14 ( 5.8%)            |
  |--------------------------------------------------------------------------|
  | has_pbc                              382 (50.3%)   118 (49.2%)    0.77   |
  +--------------------------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/baseline_table_udca.csv, replace
(note: file ./output/tables/baseline_table_udca.csv not found)
file ./output/tables/baseline_table_udca.csv saved

. * Rounding numbers in table to nearest 5
. forvalues i=0/1 {   
  2.     destring _columna_`i', gen(n`i') ignore(",") force
  3.     destring _columnb_`i', gen(percent`i') ignore("-" "%" "(" ")")  force
  4.     gen rounded_n`i' = round(n`i', 5)
  5.     tostring percent`i', gen(percent_`i')
  6.     tostring rounded_n`i', gen(n`i'_rounded)
  7.     replace n`i'_rounded = "redacted" if (rounded_n`i'<=5)
  8.     replace percent_`i' = "redacted" if (rounded_n`i'<=5)
  9. }
_columna_0: contains nonnumeric characters not specified in ignore(); n0 genera
> ted as int
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
(2 missing values generated)
percent_0 generated as str4
n0_rounded generated as str3
(0 real changes made)
(0 real changes made)
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as int
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)
(2 missing values generated)
percent_1 generated as str4
n1_rounded generated as str3
variable n1_rounded was str3 now str8
(1 real change made)
variable percent_1 was str4 now str8
(1 real change made)

. keep factor level n0_rounded percent_0 n1_rounded percent_1

. export delimited using ./output/tables/baseline_table_udca_rounded.csv
file ./output/tables/baseline_table_udca_rounded.csv saved

. restore 

. 
. * Additional medications by any exposure
. preserve 

. table1_mc, vars(budesonide_bl bin \ fenofibrate_bl bin \ gc_bl bin \ oca_bl b
> in \ rituximab_bl bin \ severe_disease_fu bin \ vacc_any bin  \ total_vaccs c
> at) by(udca_bl) clear

  +-------------------------------------------+
  | factor              N_0   N_1   m_0   m_1 |
  |-------------------------------------------|
  | budesonide_bl       760   240     0     0 |
  |-------------------------------------------|
  | fenofibrate_bl      760   240     0     0 |
  |-------------------------------------------|
  | gc_bl               760   240     0     0 |
  |-------------------------------------------|
  | oca_bl              760   240     0     0 |
  |-------------------------------------------|
  | rituximab_bl        760   240     0     0 |
  |-------------------------------------------|
  | severe_disease_fu   760   240     0     0 |
  |-------------------------------------------|
  | vacc_any            760   240     0     0 |
  |-------------------------------------------|
  | total_vaccs         760   240     0     0 |
  +-------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +-----------------------------------------------------------------+
  |                             udca_bl = 0   udca_bl = 1   p-value |
  |-----------------------------------------------------------------|
  |                             N=760         N=240                 |
  |-----------------------------------------------------------------|
  | budesonide_bl               187 (24.6%)   66 (27.5%)     0.37   |
  |-----------------------------------------------------------------|
  | fenofibrate_bl              183 (24.1%)   63 (26.2%)     0.50   |
  |-----------------------------------------------------------------|
  | gc_bl                       202 (26.6%)   53 (22.1%)     0.16   |
  |-----------------------------------------------------------------|
  | oca_bl                      373 (49.1%)   127 (52.9%)    0.30   |
  |-----------------------------------------------------------------|
  | rituximab_bl                378 (49.7%)   122 (50.8%)    0.77   |
  |-----------------------------------------------------------------|
  | severe_disease_fu           578 (76.1%)   189 (78.8%)    0.39   |
  |-----------------------------------------------------------------|
  | vacc_any                    758 (99.7%)   238 (99.2%)    0.22   |
  |-----------------------------------------------------------------|
  | total_vaccs         0       2 ( 0.3%)     2 ( 0.8%)      0.052  |
  |                     1       45 ( 5.9%)    20 ( 8.3%)            |
  |                     2       216 (28.4%)   79 (32.9%)            |
  |                     3       319 (42.0%)   97 (40.4%)            |
  |                     4       166 (21.8%)   35 (14.6%)            |
  |                     5       12 ( 1.6%)    7 ( 2.9%)             |
  +-----------------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/additional_meds_udca.csv, replace
(note: file ./output/tables/additional_meds_udca.csv not found)
file ./output/tables/additional_meds_udca.csv saved

. * Rounding numbers in table to nearest 5
. forvalues i=0/1 {   
  2.     destring _columna_`i', gen(n`i') ignore(",") force
  3.     destring _columnb_`i', gen(percent`i') ignore("-" "%" "(" ")")  force
  4.     gen rounded_n`i' = round(n`i', 5)
  5.     tostring rounded_n`i', gen(n`i'_rounded)
  6.     tostring percent`i', gen(percent_`i')
  7.     replace n`i'_rounded = "redacted" if (rounded_n`i'<=5)
  8.     replace percent_`i' = "redacted" if (rounded_n`i'<=5)
  9. }
_columna_0: contains nonnumeric characters not specified in ignore(); n0 genera
> ted as int
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
(2 missing values generated)
n0_rounded generated as str3
percent_0 generated as str4
variable n0_rounded was str3 now str8
(1 real change made)
variable percent_0 was str4 now str8
(1 real change made)
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as int
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)
(2 missing values generated)
n1_rounded generated as str3
percent_1 generated as str4
variable n1_rounded was str3 now str8
(2 real changes made)
variable percent_1 was str4 now str8
(2 real changes made)

. keep factor n0_rounded percent_0 n1_rounded percent_1

. export delimited using ./output/tables/additional_meds_udca_rounded.csv
file ./output/tables/additional_meds_udca_rounded.csv saved

. restore 

. 
. * Checking outcomes 
. foreach var in died_date_ons hosp_covid_primary hosp_covid_any {
  2.     gen `var'A = date(`var', "YMD")
  3.     format `var'A %dD/N/CY
  4.     drop `var'
  5. }
(500 missing values generated)
(900 missing values generated)
(900 missing values generated)

. * Flag if died
. gen died_flag = died_date_onsA!=.

. * Generate date if died of covid
. gen died_date_onscovid = died_date_onsA if died_ons_covid_flag_any == 1
(770 missing values generated)

. 
. * Flag hospitalised with covid 
. gen hosp_any_flag = hosp_covid_anyA!=.

. 
. * Composite outcome 
. gen hosp_died = (died_ons_covid_flag_any==1 | hosp_any_flag==1)

. egen hosp_died_dateA = rowmin(died_date_onsA hosp_covid_anyA)
(451 missing values generated)

. 
. 
. tab udca_bl died_ons_covid_flag_any

           | died_ons_covid_flag_a
           |          ny
   udca_bl |         0          1 |     Total
-----------+----------------------+----------
         0 |       373        387 |       760 
         1 |       127        113 |       240 
-----------+----------------------+----------
     Total |       500        500 |     1,000 

. tab udca_bl hosp_any_flag

           |     hosp_any_flag
   udca_bl |         0          1 |     Total
-----------+----------------------+----------
         0 |       680         80 |       760 
         1 |       220         20 |       240 
-----------+----------------------+----------
     Total |       900        100 |     1,000 

. 
. table1_mc, by(udca_bl) vars(died_ons_covid_flag_any bin \ hosp_any_flag bin \
>  hosp_died bin) clear

  +-------------------------------------------------+
  | factor                    N_0   N_1   m_0   m_1 |
  |-------------------------------------------------|
  | died_ons_covid_flag_any   760   240     0     0 |
  |-------------------------------------------------|
  | hosp_any_flag             760   240     0     0 |
  |-------------------------------------------------|
  | hosp_died                 760   240     0     0 |
  +-------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +---------------------------------------------------------------+
  |                           udca_bl = 0   udca_bl = 1   p-value |
  |---------------------------------------------------------------|
  |                           N=760         N=240                 |
  |---------------------------------------------------------------|
  | died_ons_covid_flag_any   387 (50.9%)   113 (47.1%)    0.30   |
  |---------------------------------------------------------------|
  | hosp_any_flag             80 (10.5%)    20 ( 8.3%)     0.32   |
  |---------------------------------------------------------------|
  | hosp_died                 424 (55.8%)   125 (52.1%)    0.31   |
  +---------------------------------------------------------------+
Data are presented as n (%).
 

. export delimited using ./output/tables/baseline_outcomes.csv
file ./output/tables/baseline_outcomes.csv saved

. forvalues i=0/1 {   
  2.     destring _columna_`i', gen(n`i') ignore(",") force
  3.     destring _columnb_`i', gen(percent`i') ignore("-" "%" "(" ")")  force
  4.     gen rounded_n`i' = round(n`i', 5)
  5.     tostring rounded_n`i', gen(n`i'_rounded)
  6.     tostring percent`i', gen(percent_`i')
  7.     replace n`i'_rounded = "redacted" if (rounded_n`i'<=5)
  8.     replace percent_`i' = "redacted" if (rounded_n`i'<=5)
  9. }
_columna_0: contains nonnumeric characters not specified in ignore(); n0 genera
> ted as int
(2 missing values generated)
_columnb_0: contains nonnumeric characters not specified in ignore()
_columnb_0: characters space % ( ) removed; percent0 generated as double
(2 missing values generated)
(2 missing values generated)
n0_rounded generated as str3
percent_0 generated as str4
(0 real changes made)
(0 real changes made)
_columna_1: contains nonnumeric characters not specified in ignore(); n1 genera
> ted as int
(2 missing values generated)
_columnb_1: contains nonnumeric characters not specified in ignore()
_columnb_1: characters space % ( ) removed; percent1 generated as double
(2 missing values generated)
(2 missing values generated)
n1_rounded generated as str3
percent_1 generated as str4
(0 real changes made)
(0 real changes made)

. keep factor rounded_n0 percent0 rounded_n1 percent1

. export delimited using ./output/tables/baseline_outcomes_rounded.csv
file ./output/tables/baseline_outcomes_rounded.csv saved

. 
end of do-file

. . file open output using "/tmp/104_baseline_tables.do.z3sI.out", write text r
> eplace

. . file write output "success" 

. . file close output

. 
end of do-file


