
. 
. cap mkdir ./output/tables/

. 
. tempfile tempfile 

. import delimited using ./output/input_pbc.csv
(97 vars, 1,000 obs)

. save `tempfile' 
file /tmp/St00015.000001 saved

. 
. ** First import udca population
. import delimited using ./output/input_additional.csv, clear
(41 vars, 1,000 obs)

. 
. describe 

Contains data
  obs:         1,000                          
 vars:            41                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
udca_1          str10   %10s                  
udca_2          str10   %10s                  
udca_3          str10   %10s                  
udca_4          str10   %10s                  
udca_5          str10   %10s                  
udca_6          str10   %10s                  
udca_7          str10   %10s                  
udca_8          str10   %10s                  
udca_9          str10   %10s                  
udca_10         str10   %10s                  
udca_11         str10   %10s                  
udca_12         str10   %10s                  
udca_13         str10   %10s                  
udca_14         str10   %10s                  
udca_15         str10   %10s                  
udca_16         str10   %10s                  
udca_17         str10   %10s                  
udca_18         str10   %10s                  
udca_19         str10   %10s                  
udca_20         str10   %10s                  
udca_21         str10   %10s                  
udca_22         str10   %10s                  
udca_23         str10   %10s                  
udca_24         str10   %10s                  
udca_25         str10   %10s                  
udca_26         str10   %10s                  
udca_27         str10   %10s                  
udca_28         str10   %10s                  
udca_29         str10   %10s                  
udca_30         str10   %10s                  
udca_31         str10   %10s                  
udca_32         str10   %10s                  
udca_33         str10   %10s                  
udca_34         str10   %10s                  
udca_35         str10   %10s                  
udca_36         str10   %10s                  
udca_37         str10   %10s                  
udca_38         str10   %10s                  
udca_39         str10   %10s                  
udca_40         str10   %10s                  
patient_id      int     %8.0g                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. 
. *missings report, minimum(12400)
. missings dropvars udca_*, force

Checking missings in udca_1 udca_2 udca_3 udca_4 udca_5 udca_6 udca_7 udca_8
    udca_9 udca_10 udca_11 udca_12 udca_13 udca_14 udca_15 udca_16 udca_17
    udca_18 udca_19 udca_20 udca_21 udca_22 udca_23 udca_24 udca_25 udca_26
    udca_27 udca_28 udca_29 udca_30 udca_31 udca_32 udca_33 udca_34 udca_35
    udca_36 udca_37 udca_38 udca_39 udca_40:
1000 observations with missing values

note: no variables qualify

. 
. * Format dates - 179 if real data 
. forvalues i=1/40 {
  2.     gen udcaA`i' = date(udca_`i', "YMD")
  3.     format udcaA`i' %dD/N/CY
  4.     drop udca_`i'
  5. }
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)

. 
. * Reshape to long format 
. reshape long udcaA, i(patient_id) j(presc_number)
(note: j = 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26
>  27 28 29 30 31 32 33 34 35 36 37 38 39 40)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                     1000   ->   40000
Number of variables                  41   ->       3
j variable (40 values)                    ->   presc_number
xij variables:
              udcaA1 udcaA2 ... udcaA40   ->   udcaA
-----------------------------------------------------------------------------

. 
. * Drop rows where there is no prescription
. drop if udcaA==.
(20,000 observations deleted)

. 
. * Check that prescriptions are in order
. gen order_flag = (udcaA<udcaA[_n-1] & patient_id==patient_id[_n-1])

. tab order_flag 

 order_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,497       52.48       52.48
          1 |      9,503       47.52      100.00
------------+-----------------------------------
      Total |     20,000      100.00

. * Create flag if any out of order prescriptions in the data - should only be 
> in dummy data 
. egen out_of_order = max(order_flag)

. tab out_of_order

out_of_orde |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     20,000      100.00      100.00
------------+-----------------------------------
      Total |     20,000      100.00

. 
. * Sort if out of order - should only apply to dummy data 
. sort patient_id udcaA 

. 
. drop order_flag

. * Check in order
. gen order_flag = (udcaA<udcaA[_n-1] & patient_id==patient_id[_n-1])

. tab order_flag

 order_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     20,000      100.00      100.00
------------+-----------------------------------
      Total |     20,000      100.00

. 
. * Identify prescriptions with the same date 
. bys patient_id: gen dup_presc = (udcaA==udcaA[_n-1])

. tab dup_presc 

  dup_presc |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     19,809       99.05       99.05
          1 |        191        0.95      100.00
------------+-----------------------------------
      Total |     20,000      100.00

. * Drop them 
. drop if dup_presc 
(191 observations deleted)

. 
. drop order_flag out_of_order dup_presc presc_number

. 
. * Re-count number of prescriptions 
. gen udca=1

. bys patient_id: egen total_no_presc = total(udca)

. sum total_no_presc, d

                       total_no_presc
-------------------------------------------------------------
      Percentiles      Smallest
 1%           13             11
 5%           15             11
10%           16             11       Obs              19,809
25%           18             11       Sum of Wgt.      19,809

50%           20                      Mean           20.30274
                        Largest       Std. Dev.      3.065763
75%           22             29
90%           24             29       Variance       9.398903
95%           25             29       Skewness      -.0963922
99%           27             29       Kurtosis       2.978792

. 
. * Determine length of time from previous prescription 
. bys patient_id (udcaA): gen time_previous = udcaA - udcaA[_n-1]
(1,000 missing values generated)

. sum time_previous, d 

                        time_previous
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            3              1
10%            6              1       Obs              18,809
25%           17              1       Sum of Wgt.      18,809

50%           39                      Mean           55.17056
                        Largest       Std. Dev.      52.84857
75%           77            410
90%          125            422       Variance       2792.971
95%          162            433       Skewness       1.802642
99%          238            455       Kurtosis       7.460346

. gen year = year(udcaA)

. bys year: sum time_previous, d

-------------------------------------------------------------------------------
-> year = 2020

                        time_previous
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            3              1
10%            6              1       Obs               4,176
25%           14              1       Sum of Wgt.       4,176

50%           33                      Mean           46.64392
                        Largest       Std. Dev.      43.89903
75%           66            251
90%          106            255       Variance       1927.125
95%          139            257       Skewness       1.567182
99%          199            284       Kurtosis       5.635472

-------------------------------------------------------------------------------
-> year = 2021

                        time_previous
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            3              1
10%            7              1       Obs               6,353
25%           18              1       Sum of Wgt.       6,353

50%           40                      Mean           57.07414
                        Largest       Std. Dev.      54.88202
75%           81            385
90%          130            386       Variance       3012.036
95%          168            391       Skewness       1.796887
99%          252            397       Kurtosis       7.302141

-------------------------------------------------------------------------------
-> year = 2022

                        time_previous
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            4              1
10%            7              1       Obs               6,294
25%           19              1       Sum of Wgt.       6,294

50%           42                      Mean           58.32682
                        Largest       Std. Dev.      55.01998
75%           82            403
90%          132            404       Variance       3027.199
95%          172            422       Skewness       1.728085
99%          248            433       Kurtosis        6.96863

-------------------------------------------------------------------------------
-> year = 2023

                        time_previous
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            3              1
10%            6              1       Obs               1,986
25%           18              1       Sum of Wgt.       1,986

50%           42                      Mean           57.00755
                        Largest       Std. Dev.      54.54557
75%           78            336
90%          129            367       Variance        2975.22
95%          163            410       Skewness       1.984117
99%          265            455       Kurtosis       8.901403


. 
. * Drop records in 2023 as this is after end of study
. drop if year==2023
(1,986 observations deleted)

. 
. * Create two files one with 60 days prescription end the other with 90 days 
. foreach i in 60 90 {
  2.     preserve 
  3.     * Assume end date is 60 or 90 days after prescription generated
.     gen stop_date = udcaA + `i' 
  4.     format stop_date %dD/N/CY 
  5. 
.     * Drop rows where prescriptions ends prior to March 2020
.     count if stop_date <= date("01March2020", "DMY")
  6.     drop if stop_date <= date("01March2020", "DMY")
  7. 
.     * Collapse adjacent prescriptions that are continuous prescribing into on
> e period 
.     * Flag if start date is greater than assumed stop date of previous prescr
> iption 
.     bys patient_id (udcaA): gen spell = udcaA > stop_date[_n-1]
  8.     bys patient_id (udcaA): replace spell = 1 if _n==1
  9.     * Flag each row associated with each spell 
.     bys patient_id (udcaA): gen spell_sum = sum(spell) 
 10.     * Start date of spell 
.     bys patient_id spell_sum (udcaA): gen start = udcaA[1] 
 11.     bys patient_id spell_sum (udcaA): gen stop = stop_date[_N] 
 12.     format start stop %dD/N/CY
 13.     keep patient_id start stop udca total_no_presc
 14.     duplicates drop 
 15. 
.     * Add in rows where there are gaps in prescriptions 
.     bys patient_id (start): gen to_expand = 1 + (stop < start[_n+1])*(start[_
> n+1]~=.)
 16.     tab to_expand 
 17.     expand to_expand 
 18. 
.     * Flag new rows
.     bys patient_id start: gen new_record = (_n==2)
 19.     tab to_expand new_record 
 20. 
.     * Updating new rows 
.     sort patient_id start
 21.     replace udca=0 if new_record==1
 22.     replace start = stop if new_record==1
 23.     bys patient_id (start): replace stop = start[_n+1] if new_record==1
 24.     drop new_record to_expand
 25. 
.     * Checks 
.     count if stop<start 
 26.     sort patient_id start
 27.     count if stop[_n-1]>start & patient_id==patient_id[_n-1]
 28. 
.     * Update to match follow-up time
.     * merge variables from original study definition 
.     merge m:1 patient_id using `tempfile', keepusing(dereg_date died_date_ons
> ) 
 29.     tab _merge
 30. 
.     * Update variables for people without prescriptions 
.     replace start = date("01/03/2020", "DMY") if _merge==2
 31.     replace udca = 0 if _merge==2
 32.     replace stop = date("31/12/2022", "DMY") if _merge==2
 33.     replace total_no_presc = 0 if _merge==2
 34. 
.     * Determine end of follow-up date
.     gen dereg_dateA = date(dereg_date, "YMD")
 35.     format %dD/N/CY dereg_dateA
 36.     drop dereg_date
 37.     gen died_dateA = date(died_date_ons, "YMD")
 38.     format %dD/N/CY died_dateA
 39.     drop died_date_ons
 40.     gen end_study = date("31/12/2022", "DMY")
 41.     egen end_date = rowmin(dereg_dateA end_study died_dateA)
 42.     * Count number of days of follow-up 
.     gen total_fu = end_date - date("01/03/2020", "DMY")
 43. 
.     ** Update start and end of follow-up for cohort
.     * Identify prescriptions that start prior to March 2020
.     gen start_prior = (start < date("01/03/2020", "DMY"))
 44.     replace start = date("01/03/2020", "DMY") if start_prior==1
 45. 
.     * Identify first prescriptions that start after March 2020
.     bys patient_id (start): gen start_after = 1 + (start > date("01/03/2020",
>  "DMY") & _n==1)
 46.     tab start_after
 47.     expand start_after
 48. 
.     * Flag new rows
.     bys patient_id start: gen new_record = (_n==2)
 49.     tab start_after new_record 
 50. 
.     * Updating new rows 
.     sort patient_id start
 51.     replace udca=0 if new_record==1
 52.     replace stop = start if new_record==1
 53.     replace start = date("01/03/2020", "DMY") if new_record==1
 54.     drop new_record start_after
 55. 
.     * Identify rows that end after study end date for person 
.     gen end_after = (stop > end_date )
 56.     gen end_before = (start > end_date) 
 57. 
.     tab end_after
 58.     tab end_before 
 59. 
.     * Drop whole rows that are after end_date 
.     drop if end_before 
 60. 
.     * Check those flagged as ending after are last row only 
.     bys patient_id: gen last = _n==_N
 61.     tab last end_after 
 62. 
.     replace stop = end_date if end_after==1 & end_before==0
 63. 
.     * Identify prescriptions that end prior to end of follow-up 
.     bys patient_id (start): gen stop_prior = 1 + (stop < end_date & _n==_N)
 64.     tab stop_prior
 65.     expand stop_prior
 66. 
.     * Flag new rows
.     bys patient_id start: gen new_record = (_n==2)
 67.     tab stop_prior new_record 
 68. 
.     * Updating new rows 
.     sort patient_id start
 69.     replace udca=0 if new_record==1
 70.     replace start =  stop if new_record==1
 71.     replace stop = end_date if new_record==1
 72.     drop new_record stop_prior
 73. 
.     count if start > stop 
 74. 
.     * Check that time covered by prescriptions equals total follow-up
.     gen time = stop - start 
 75.     bys patient_id: egen total_time = total(time)
 76. 
.     gen total_time_unequal = total_time!=total_fu
 77.     tab total_time_unequal, m
 78. 
.     save ./output/time_varying_udca_all_vars_`i'
 79.     * Drop unnecessary variables
.     keep patient_id start stop udca 
 80. 
.     save ./output/time_varying_udca_`i'
 81.     restore
 82. }
  0
(0 observations deleted)
(1000 real changes made)

Duplicates in terms of all variables

(11,137 observations deleted)

  to_expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,000       14.96       14.96
          2 |      5,686       85.04      100.00
------------+-----------------------------------
      Total |      6,686      100.00
(5,686 observations created)

           |      new_record
 to_expand |         0          1 |     Total
-----------+----------------------+----------
         1 |     1,000          0 |     1,000 
         2 |     5,686      5,686 |    11,372 
-----------+----------------------+----------
     Total |     6,686      5,686 |    12,372 
(5,686 real changes made)
(5,686 real changes made)
(5686 real changes made)
  0
  0

    Result                           # of obs.
    -----------------------------------------
    not matched                        11,992
        from master                    11,096  (_merge==1)
        from using                        896  (_merge==2)

    matched                             1,276  (_merge==3)
    -----------------------------------------

                 _merge |      Freq.     Percent        Cum.
------------------------+-----------------------------------
        master only (1) |     11,096       83.63       83.63
         using only (2) |        896        6.75       90.38
            matched (3) |      1,276        9.62      100.00
------------------------+-----------------------------------
                  Total |     13,268      100.00
(896 real changes made)
(896 real changes made)
(896 real changes made)
(896 real changes made)
(12,296 missing values generated)
(12,226 missing values generated)
(0 real changes made)

start_after |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     12,268       92.46       92.46
          2 |      1,000        7.54      100.00
------------+-----------------------------------
      Total |     13,268      100.00
(1,000 observations created)

start_afte |      new_record
         r |         0          1 |     Total
-----------+----------------------+----------
         1 |    12,268          0 |    12,268 
         2 |     1,000      1,000 |     2,000 
-----------+----------------------+----------
     Total |    13,268      1,000 |    14,268 
(1,000 real changes made)
(1,000 real changes made)
(1,000 real changes made)

  end_after |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,550       87.96       87.96
          1 |      1,718       12.04      100.00
------------+-----------------------------------
      Total |     14,268      100.00

 end_before |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     13,860       97.14       97.14
          1 |        408        2.86      100.00
------------+-----------------------------------
      Total |     14,268      100.00
(408 observations deleted)

           |       end_after
      last |         0          1 |     Total
-----------+----------------------+----------
         0 |    11,956          8 |    11,964 
         1 |       594      1,302 |     1,896 
-----------+----------------------+----------
     Total |    12,550      1,310 |    13,860 
(1,310 real changes made)

 stop_prior |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     13,559       97.83       97.83
          2 |        301        2.17      100.00
------------+-----------------------------------
      Total |     13,860      100.00
(301 observations created)

           |      new_record
stop_prior |         0          1 |     Total
-----------+----------------------+----------
         1 |    13,559          0 |    13,559 
         2 |       301        301 |       602 
-----------+----------------------+----------
     Total |    13,860        301 |    14,161 
(301 real changes made)
(301 real changes made)
(301 real changes made)
  0

total_time_ |
    unequal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,161      100.00      100.00
------------+-----------------------------------
      Total |     14,161      100.00
file ./output/time_varying_udca_all_vars_60.dta saved
file ./output/time_varying_udca_60.dta saved
  0
(0 observations deleted)
(1000 real changes made)

Duplicates in terms of all variables

(13,558 observations deleted)

  to_expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,000       23.45       23.45
          2 |      3,265       76.55      100.00
------------+-----------------------------------
      Total |      4,265      100.00
(3,265 observations created)

           |      new_record
 to_expand |         0          1 |     Total
-----------+----------------------+----------
         1 |     1,000          0 |     1,000 
         2 |     3,265      3,265 |     6,530 
-----------+----------------------+----------
     Total |     4,265      3,265 |     7,530 
(3,265 real changes made)
(3,265 real changes made)
(3265 real changes made)
  0
  0

    Result                           # of obs.
    -----------------------------------------
    not matched                         7,644
        from master                     6,748  (_merge==1)
        from using                        896  (_merge==2)

    matched                               782  (_merge==3)
    -----------------------------------------

                 _merge |      Freq.     Percent        Cum.
------------------------+-----------------------------------
        master only (1) |      6,748       80.09       80.09
         using only (2) |        896       10.63       90.72
            matched (3) |        782        9.28      100.00
------------------------+-----------------------------------
                  Total |      8,426      100.00
(896 real changes made)
(896 real changes made)
(896 real changes made)
(896 real changes made)
(7,674 missing values generated)
(7,610 missing values generated)
(0 real changes made)

start_after |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      7,426       88.13       88.13
          2 |      1,000       11.87      100.00
------------+-----------------------------------
      Total |      8,426      100.00
(1,000 observations created)

start_afte |      new_record
         r |         0          1 |     Total
-----------+----------------------+----------
         1 |     7,426          0 |     7,426 
         2 |     1,000      1,000 |     2,000 
-----------+----------------------+----------
     Total |     8,426      1,000 |     9,426 
(1,000 real changes made)
(1,000 real changes made)
(1,000 real changes made)

  end_after |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,750       82.22       82.22
          1 |      1,676       17.78      100.00
------------+-----------------------------------
      Total |      9,426      100.00

 end_before |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      9,206       97.67       97.67
          1 |        220        2.33      100.00
------------+-----------------------------------
      Total |      9,426      100.00
(220 observations deleted)

           |       end_after
      last |         0          1 |     Total
-----------+----------------------+----------
         0 |     7,298         12 |     7,310 
         1 |       452      1,444 |     1,896 
-----------+----------------------+----------
     Total |     7,750      1,456 |     9,206 
(1,456 real changes made)

 stop_prior |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      9,046       98.26       98.26
          2 |        160        1.74      100.00
------------+-----------------------------------
      Total |      9,206      100.00
(160 observations created)

           |      new_record
stop_prior |         0          1 |     Total
-----------+----------------------+----------
         1 |     9,046          0 |     9,046 
         2 |       160        160 |       320 
-----------+----------------------+----------
     Total |     9,206        160 |     9,366 
(160 real changes made)
(160 real changes made)
(160 real changes made)
  0

total_time_ |
    unequal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      9,366      100.00      100.00
------------+-----------------------------------
      Total |      9,366      100.00
file ./output/time_varying_udca_all_vars_90.dta saved
file ./output/time_varying_udca_90.dta saved

. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
end of do-file

. . file open output using "/tmp/101_drug_prep.do.XFpF.out", write text replace

. . file write output "success" 

. . file close output

. 
end of do-file


