
. 
. cap mkdir ./output/tables/

. 
. tempfile tempfile 

. import delimited using ./output/input_pbc.csv
(106 vars, 1,000 obs)

. save `tempfile' 
file /tmp/St00015.000001 saved

. 
. ** First import udca population
. import delimited using ./output/input_additional.csv, clear
(336 vars, 1,000 obs)

. 
. describe 

Contains data
  obs:         1,000                          
 vars:           336                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
udca_1          str10   %10s                  
udca_2          str10   %10s                  
udca_3          str10   %10s                  
udca_4          str10   %10s                  
udca_5          str10   %10s                  
udca_6          str10   %10s                  
udca_7          str10   %10s                  
udca_8          str10   %10s                  
udca_9          str10   %10s                  
udca_10         str10   %10s                  
udca_11         str10   %10s                  
udca_12         str10   %10s                  
udca_13         str10   %10s                  
udca_14         str10   %10s                  
udca_15         str10   %10s                  
udca_16         str10   %10s                  
udca_17         str10   %10s                  
udca_18         str10   %10s                  
udca_19         str10   %10s                  
udca_20         str10   %10s                  
udca_21         str10   %10s                  
udca_22         str10   %10s                  
udca_23         str10   %10s                  
udca_24         str10   %10s                  
udca_25         str10   %10s                  
udca_26         str10   %10s                  
udca_27         str10   %10s                  
udca_28         str10   %10s                  
udca_29         str10   %10s                  
udca_30         str10   %10s                  
udca_31         str10   %10s                  
udca_32         str10   %10s                  
udca_33         str10   %10s                  
udca_34         str10   %10s                  
udca_35         str10   %10s                  
udca_36         str10   %10s                  
udca_37         str10   %10s                  
udca_38         str10   %10s                  
udca_39         str10   %10s                  
udca_40         str10   %10s                  
udca_41         str10   %10s                  
udca_42         str10   %10s                  
udca_43         str10   %10s                  
udca_44         str10   %10s                  
udca_45         str10   %10s                  
udca_46         str10   %10s                  
udca_47         str10   %10s                  
udca_48         str10   %10s                  
udca_49         str10   %10s                  
udca_50         str10   %10s                  
udca_51         str10   %10s                  
udca_52         str10   %10s                  
udca_53         str10   %10s                  
udca_54         str10   %10s                  
udca_55         str10   %10s                  
udca_56         str10   %10s                  
udca_57         str10   %10s                  
udca_58         str10   %10s                  
udca_59         str10   %10s                  
udca_60         str10   %10s                  
udca_61         str10   %10s                  
udca_62         str10   %10s                  
udca_63         str10   %10s                  
udca_64         str10   %10s                  
udca_65         str10   %10s                  
udca_66         str10   %10s                  
udca_67         str10   %10s                  
udca_68         str10   %10s                  
udca_69         str10   %10s                  
udca_70         str10   %10s                  
udca_71         str10   %10s                  
udca_72         str10   %10s                  
udca_73         str10   %10s                  
udca_74         str10   %10s                  
udca_75         str10   %10s                  
udca_76         str10   %10s                  
udca_77         str10   %10s                  
udca_78         str10   %10s                  
udca_79         str10   %10s                  
udca_80         str10   %10s                  
udca_81         str10   %10s                  
udca_82         str10   %10s                  
udca_83         str10   %10s                  
udca_84         str10   %10s                  
udca_85         str10   %10s                  
udca_86         str10   %10s                  
udca_87         str10   %10s                  
udca_88         str10   %10s                  
udca_89         str10   %10s                  
udca_90         str10   %10s                  
udca_91         str10   %10s                  
udca_92         str10   %10s                  
udca_93         str10   %10s                  
udca_94         str10   %10s                  
udca_95         str10   %10s                  
udca_96         str10   %10s                  
udca_97         str10   %10s                  
udca_98         str10   %10s                  
udca_99         str10   %10s                  
udca_100        str10   %10s                  
udca_101        str10   %10s                  
udca_102        str10   %10s                  
udca_103        str10   %10s                  
udca_104        str10   %10s                  
udca_105        str10   %10s                  
udca_106        str10   %10s                  
udca_107        str10   %10s                  
udca_108        str10   %10s                  
udca_109        str10   %10s                  
udca_110        str10   %10s                  
udca_111        str10   %10s                  
udca_112        str10   %10s                  
udca_113        str10   %10s                  
udca_114        str10   %10s                  
udca_115        str10   %10s                  
udca_116        str10   %10s                  
udca_117        str10   %10s                  
udca_118        str10   %10s                  
udca_119        str10   %10s                  
udca_120        str10   %10s                  
udca_121        str10   %10s                  
udca_122        str10   %10s                  
udca_123        str10   %10s                  
udca_124        str10   %10s                  
udca_125        str10   %10s                  
udca_126        str10   %10s                  
udca_127        str10   %10s                  
udca_128        str10   %10s                  
udca_129        str10   %10s                  
udca_130        str10   %10s                  
udca_131        str10   %10s                  
udca_132        str10   %10s                  
udca_133        str10   %10s                  
udca_134        str10   %10s                  
udca_135        str10   %10s                  
udca_136        str10   %10s                  
udca_137        str10   %10s                  
udca_138        str10   %10s                  
udca_139        str10   %10s                  
udca_140        str10   %10s                  
udca_141        str10   %10s                  
udca_142        str10   %10s                  
udca_143        str10   %10s                  
udca_144        str10   %10s                  
udca_145        str10   %10s                  
udca_146        str10   %10s                  
udca_147        str10   %10s                  
udca_148        str10   %10s                  
udca_149        str10   %10s                  
udca_150        str10   %10s                  
udca_151        str10   %10s                  
udca_152        str10   %10s                  
udca_153        str10   %10s                  
udca_154        str10   %10s                  
udca_155        str10   %10s                  
udca_156        str10   %10s                  
udca_157        str10   %10s                  
udca_158        str10   %10s                  
udca_159        str10   %10s                  
udca_160        str10   %10s                  
udca_161        str10   %10s                  
udca_162        str10   %10s                  
udca_163        str10   %10s                  
udca_164        str10   %10s                  
udca_165        str10   %10s                  
udca_166        str10   %10s                  
udca_167        str10   %10s                  
udca_168        str10   %10s                  
udca_169        str10   %10s                  
udca_170        str10   %10s                  
udca_171        str10   %10s                  
udca_172        str10   %10s                  
udca_173        str10   %10s                  
udca_174        str10   %10s                  
udca_175        str10   %10s                  
udca_176        str10   %10s                  
udca_177        str10   %10s                  
udca_178        str10   %10s                  
udca_179        str10   %10s                  
udca_180        str10   %10s                  
udca_181        str10   %10s                  
udca_182        str10   %10s                  
udca_183        str10   %10s                  
udca_184        str10   %10s                  
udca_185        str10   %10s                  
udca_186        str10   %10s                  
udca_187        str10   %10s                  
udca_188        str10   %10s                  
udca_189        str10   %10s                  
udca_190        str10   %10s                  
udca_191        str10   %10s                  
udca_192        str10   %10s                  
udca_193        str10   %10s                  
udca_194        str10   %10s                  
udca_195        str10   %10s                  
udca_196        str10   %10s                  
udca_197        str10   %10s                  
udca_198        str10   %10s                  
udca_199        str10   %10s                  
udca_200        str10   %10s                  
udca_201        str10   %10s                  
udca_202        str10   %10s                  
udca_203        str10   %10s                  
udca_204        str10   %10s                  
udca_205        str10   %10s                  
udca_206        str10   %10s                  
udca_207        str10   %10s                  
udca_208        str10   %10s                  
udca_209        str10   %10s                  
udca_210        str10   %10s                  
udca_211        str10   %10s                  
udca_212        str10   %10s                  
udca_213        str10   %10s                  
udca_214        str10   %10s                  
udca_215        str10   %10s                  
udca_216        str10   %10s                  
udca_217        str10   %10s                  
udca_218        str10   %10s                  
udca_219        str10   %10s                  
udca_220        str10   %10s                  
udca_221        str10   %10s                  
udca_222        str10   %10s                  
udca_223        str10   %10s                  
udca_224        str10   %10s                  
udca_225        str10   %10s                  
udca_226        str10   %10s                  
udca_227        str10   %10s                  
udca_228        str10   %10s                  
udca_229        str10   %10s                  
udca_230        str10   %10s                  
udca_231        str10   %10s                  
udca_232        str10   %10s                  
udca_233        str10   %10s                  
udca_234        str10   %10s                  
udca_235        str10   %10s                  
udca_236        str10   %10s                  
udca_237        str10   %10s                  
udca_238        str10   %10s                  
udca_239        str10   %10s                  
udca_240        str10   %10s                  
udca_241        str10   %10s                  
udca_242        str10   %10s                  
udca_243        str10   %10s                  
udca_244        str10   %10s                  
udca_245        str10   %10s                  
udca_246        str10   %10s                  
udca_247        str10   %10s                  
udca_248        str10   %10s                  
udca_249        str10   %10s                  
udca_250        str10   %10s                  
udca_251        str10   %10s                  
udca_252        str10   %10s                  
udca_253        str10   %10s                  
udca_254        str10   %10s                  
udca_255        str10   %10s                  
udca_256        str10   %10s                  
udca_257        str10   %10s                  
udca_258        str10   %10s                  
udca_259        str10   %10s                  
udca_260        str10   %10s                  
udca_261        str10   %10s                  
udca_262        str10   %10s                  
udca_263        str10   %10s                  
udca_264        str10   %10s                  
udca_265        str10   %10s                  
udca_266        str10   %10s                  
udca_267        str10   %10s                  
udca_268        str10   %10s                  
udca_269        str10   %10s                  
udca_270        str10   %10s                  
udca_271        str10   %10s                  
udca_272        str10   %10s                  
udca_273        str10   %10s                  
udca_274        str10   %10s                  
udca_275        str10   %10s                  
udca_276        str10   %10s                  
udca_277        str10   %10s                  
udca_278        str10   %10s                  
udca_279        str10   %10s                  
udca_280        str10   %10s                  
udca_281        str10   %10s                  
udca_282        str10   %10s                  
udca_283        str10   %10s                  
udca_284        str10   %10s                  
udca_285        str10   %10s                  
udca_286        str10   %10s                  
udca_287        str10   %10s                  
udca_288        str10   %10s                  
udca_289        str10   %10s                  
udca_290        str10   %10s                  
udca_291        str10   %10s                  
udca_292        str10   %10s                  
udca_293        str10   %10s                  
udca_294        str10   %10s                  
udca_295        str10   %10s                  
udca_296        str10   %10s                  
udca_297        str10   %10s                  
udca_298        str10   %10s                  
udca_299        str10   %10s                  
udca_300        str10   %10s                  
udca_301        str10   %10s                  
udca_302        str10   %10s                  
udca_303        str10   %10s                  
udca_304        str10   %10s                  
udca_305        str10   %10s                  
udca_306        str10   %10s                  
udca_307        str10   %10s                  
udca_308        str10   %10s                  
udca_309        str10   %10s                  
udca_310        str10   %10s                  
udca_311        str10   %10s                  
udca_312        str10   %10s                  
udca_313        str10   %10s                  
udca_314        str10   %10s                  
udca_315        str10   %10s                  
udca_316        str10   %10s                  
udca_317        str10   %10s                  
udca_318        str10   %10s                  
udca_319        str10   %10s                  
udca_320        str10   %10s                  
udca_321        str10   %10s                  
udca_322        str10   %10s                  
udca_323        str10   %10s                  
udca_324        str10   %10s                  
udca_325        str10   %10s                  
udca_326        str10   %10s                  
udca_327        str10   %10s                  
udca_328        str10   %10s                  
udca_329        str10   %10s                  
udca_330        str10   %10s                  
udca_331        str10   %10s                  
udca_332        str10   %10s                  
udca_333        str10   %10s                  
udca_334        str10   %10s                  
udca_335        str10   %10s                  
patient_id      int     %8.0g                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. 
. *missings report, minimum(12400)
. missings dropvars udca_*, force

Checking missings in udca_1 udca_2 udca_3 udca_4 udca_5 udca_6 udca_7 udca_8
    udca_9 udca_10 udca_11 udca_12 udca_13 udca_14 udca_15 udca_16 udca_17
    udca_18 udca_19 udca_20 udca_21 udca_22 udca_23 udca_24 udca_25 udca_26
    udca_27 udca_28 udca_29 udca_30 udca_31 udca_32 udca_33 udca_34 udca_35
    udca_36 udca_37 udca_38 udca_39 udca_40 udca_41 udca_42 udca_43 udca_44
    udca_45 udca_46 udca_47 udca_48 udca_49 udca_50 udca_51 udca_52 udca_53
    udca_54 udca_55 udca_56 udca_57 udca_58 udca_59 udca_60 udca_61 udca_62
    udca_63 udca_64 udca_65 udca_66 udca_67 udca_68 udca_69 udca_70 udca_71
    udca_72 udca_73 udca_74 udca_75 udca_76 udca_77 udca_78 udca_79 udca_80
    udca_81 udca_82 udca_83 udca_84 udca_85 udca_86 udca_87 udca_88 udca_89
    udca_90 udca_91 udca_92 udca_93 udca_94 udca_95 udca_96 udca_97 udca_98
    udca_99 udca_100 udca_101 udca_102 udca_103 udca_104 udca_105 udca_106
    udca_107 udca_108 udca_109 udca_110 udca_111 udca_112 udca_113 udca_114
    udca_115 udca_116 udca_117 udca_118 udca_119 udca_120 udca_121 udca_122
    udca_123 udca_124 udca_125 udca_126 udca_127 udca_128 udca_129 udca_130
    udca_131 udca_132 udca_133 udca_134 udca_135 udca_136 udca_137 udca_138
    udca_139 udca_140 udca_141 udca_142 udca_143 udca_144 udca_145 udca_146
    udca_147 udca_148 udca_149 udca_150 udca_151 udca_152 udca_153 udca_154
    udca_155 udca_156 udca_157 udca_158 udca_159 udca_160 udca_161 udca_162
    udca_163 udca_164 udca_165 udca_166 udca_167 udca_168 udca_169 udca_170
    udca_171 udca_172 udca_173 udca_174 udca_175 udca_176 udca_177 udca_178
    udca_179 udca_180 udca_181 udca_182 udca_183 udca_184 udca_185 udca_186
    udca_187 udca_188 udca_189 udca_190 udca_191 udca_192 udca_193 udca_194
    udca_195 udca_196 udca_197 udca_198 udca_199 udca_200 udca_201 udca_202
    udca_203 udca_204 udca_205 udca_206 udca_207 udca_208 udca_209 udca_210
    udca_211 udca_212 udca_213 udca_214 udca_215 udca_216 udca_217 udca_218
    udca_219 udca_220 udca_221 udca_222 udca_223 udca_224 udca_225 udca_226
    udca_227 udca_228 udca_229 udca_230 udca_231 udca_232 udca_233 udca_234
    udca_235 udca_236 udca_237 udca_238 udca_239 udca_240 udca_241 udca_242
    udca_243 udca_244 udca_245 udca_246 udca_247 udca_248 udca_249 udca_250
    udca_251 udca_252 udca_253 udca_254 udca_255 udca_256 udca_257 udca_258
    udca_259 udca_260 udca_261 udca_262 udca_263 udca_264 udca_265 udca_266
    udca_267 udca_268 udca_269 udca_270 udca_271 udca_272 udca_273 udca_274
    udca_275 udca_276 udca_277 udca_278 udca_279 udca_280 udca_281 udca_282
    udca_283 udca_284 udca_285 udca_286 udca_287 udca_288 udca_289 udca_290
    udca_291 udca_292 udca_293 udca_294 udca_295 udca_296 udca_297 udca_298
    udca_299 udca_300 udca_301 udca_302 udca_303 udca_304 udca_305 udca_306
    udca_307 udca_308 udca_309 udca_310 udca_311 udca_312 udca_313 udca_314
    udca_315 udca_316 udca_317 udca_318 udca_319 udca_320 udca_321 udca_322
    udca_323 udca_324 udca_325 udca_326 udca_327 udca_328 udca_329 udca_330
    udca_331 udca_332 udca_333 udca_334 udca_335:
1000 observations with missing values

note: no variables qualify

. 
. * Format dates 187
. forvalues i=1/187 {
  2.     gen udcaA`i' = date(udca_`i', "YMD")
  3.     format udcaA`i' %dD/N/CY
  4.     drop udca_`i'
  5. }
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)

. 
. * Reshape to long format 
. reshape long udcaA, i(patient_id) j(presc_number)
(note: j = 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26
>  27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 5
> 2 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 
> 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99 100 101 102
>  103 104 105 106 107 108 109 110 111 112 113 114 115 116 117 118 119 120 121 
> 122 123 124 125 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 1
> 41 142 143 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 16
> 0 161 162 163 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179
>  180 181 182 183 184 185 186 187)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                     1000   ->  187000
Number of variables                 336   ->     151
j variable (187 values)                   ->   presc_number
xij variables:
             udcaA1 udcaA2 ... udcaA187   ->   udcaA
-----------------------------------------------------------------------------

. 
. * Drop rows where there is no prescription
. drop if udcaA==.
(93,500 observations deleted)

. 
. * Check that prescriptions are in order
. gen order_flag = (udcaA<udcaA[_n-1] & patient_id==patient_id[_n-1])

. tab order_flag 

 order_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,241       50.53       50.53
          1 |     46,259       49.47      100.00
------------+-----------------------------------
      Total |     93,500      100.00

. * Create flag if any out of order prescriptions in the data - should only be 
> in dummy data 
. egen out_of_order = max(order_flag)

. tab out_of_order

out_of_orde |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     93,500      100.00      100.00
------------+-----------------------------------
      Total |     93,500      100.00

. 
. * Sort if out of order - should only apply to dummy data 
. sort patient_id udcaA 

. 
. drop order_flag

. * Check in order
. gen order_flag = (udcaA<udcaA[_n-1] & patient_id==patient_id[_n-1])

. tab order_flag

 order_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     93,500      100.00      100.00
------------+-----------------------------------
      Total |     93,500      100.00

. 
. * Identify prescriptions with the same date 
. bys patient_id: gen dup_presc = (udcaA==udcaA[_n-1])

. tab dup_presc 

  dup_presc |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     90,145       96.41       96.41
          1 |      3,355        3.59      100.00
------------+-----------------------------------
      Total |     93,500      100.00

. * Drop them 
. drop if dup_presc 
(3,355 observations deleted)

. 
. drop order_flag out_of_order dup_presc presc_number

. 
. * Re-count number of prescriptions 
. gen udca=1

. bys patient_id: egen total_no_presc = total(udca)

. sum total_no_presc, d

                       total_no_presc
-------------------------------------------------------------
      Percentiles      Smallest
 1%           76             72
 5%           80             72
10%           82             72       Obs              90,145
25%           86             72       Sum of Wgt.      90,145

50%           91                      Mean           90.61325
                        Largest       Std. Dev.      6.494914
75%           95            111
90%           99            111       Variance       42.18391
95%          102            111       Skewness       .0620964
99%          107            111       Kurtosis       2.993233

. 
. * Determine length of time from previous prescription 
. bys patient_id (udcaA): gen time_previous = udcaA - udcaA[_n-1]
(1,000 missing values generated)

. sum time_previous, d 

                        time_previous
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            2              1       Obs              89,145
25%            4              1       Sum of Wgt.      89,145

50%            9                      Mean           13.38193
                        Largest       Std. Dev.       12.8485
75%           18            130
90%           30            133       Variance       165.0841
95%           39            150       Skewness       1.988207
99%           59            156       Kurtosis       8.953809

. gen year = year(udcaA)

. bys year: sum time_previous, d

-------------------------------------------------------------------------------
-> year = 2020

                        time_previous
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            2              1       Obs              21,301
25%            4              1       Sum of Wgt.      21,301

50%            9                      Mean           13.08657
                        Largest       Std. Dev.      12.61213
75%           18            109
90%           30            116       Variance       159.0659
95%           38            130       Skewness       2.024661
99%           59            150       Kurtosis       9.345655

-------------------------------------------------------------------------------
-> year = 2021

                        time_previous
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            2              1       Obs              27,034
25%            4              1       Sum of Wgt.      27,034

50%           10                      Mean           13.52227
                        Largest       Std. Dev.      12.99699
75%           19            122
90%           30            126       Variance       168.9217
95%           40            127       Skewness       2.034374
99%           60            156       Kurtosis       9.467506

-------------------------------------------------------------------------------
-> year = 2022

                        time_previous
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            2              1       Obs              27,202
25%            4              1       Sum of Wgt.      27,202

50%            9                      Mean           13.39927
                        Largest       Std. Dev.       12.7889
75%           19            109
90%           30            124       Variance       163.5559
95%           39            126       Skewness       1.926087
99%           59            133       Kurtosis       8.327155

-------------------------------------------------------------------------------
-> year = 2023

                        time_previous
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            2              1       Obs              13,608
25%            4              1       Sum of Wgt.      13,608

50%           10                      Mean           13.53079
                        Largest       Std. Dev.       13.0297
75%           19            106
90%           31            110       Variance       169.7731
95%           39            113       Skewness       1.957239
99%           60            125       Kurtosis       8.525282


. 
. * Drop records in 2023 as this is after end of study
. drop if year==2023
(13,608 observations deleted)

. forvalues i = 60(30)180 {
  2.     preserve
  3.     * Assume end date is 60 to 180 days after prescription generated
.     gen stop_date = udcaA + `i'
  4.     format stop_date %dD/N/CY 
  5. 
.     * Drop rows where prescriptions ends prior to March 2020
.     count if stop_date <= date("01March2020", "DMY")
  6.     drop if stop_date <= date("01March2020", "DMY")
  7. 
.     * Collapse adjacent prescriptions that are continuous prescribing into on
> e period 
.     * Flag if start date is greater than assumed stop date of previous prescr
> iption 
.     bys patient_id (udcaA): gen spell = udcaA > stop_date[_n-1]
  8.     bys patient_id (udcaA): replace spell = 1 if _n==1
  9.     * Flag each row associated with each spell 
.     bys patient_id (udcaA): gen spell_sum = sum(spell) 
 10.     * Start date of spell 
.     bys patient_id spell_sum (udcaA): gen start = udcaA[1] 
 11.     bys patient_id spell_sum (udcaA): gen stop = stop_date[_N] 
 12.     format start stop %dD/N/CY
 13.     keep patient_id start stop udca total_no_presc
 14.     duplicates drop 
 15. 
.     * Add in rows where there are gaps in prescriptions 
.     bys patient_id (start): gen to_expand = 1 + (stop < start[_n+1])*(start[_
> n+1]~=.)
 16.     tab to_expand 
 17.     expand to_expand 
 18. 
.     * Flag new rows
.     bys patient_id start: gen new_record = (_n==2)
 19.     tab to_expand new_record 
 20. 
.     * Updating new rows 
.     sort patient_id start
 21.     replace udca=0 if new_record==1
 22.     replace start = stop if new_record==1
 23.     bys patient_id (start): replace stop = start[_n+1] if new_record==1
 24.     drop new_record to_expand
 25. 
.     * Checks 
.     count if stop<start 
 26.     sort patient_id start
 27.     count if stop[_n-1]>start & patient_id==patient_id[_n-1]
 28. 
.     * Update to match follow-up time
.     * merge variables from original study definition 
.     merge m:1 patient_id using `tempfile', keepusing(dereg_date died_date_ons
>  udca_count_bl) 
 29.     tab _merge
 30. 
.     * Update variables for people without prescriptions 
.     replace start = date("01/03/2020", "DMY") if _merge==2
 31.     replace udca = 0 if _merge==2
 32.     replace stop = date("31/12/2022", "DMY") if _merge==2
 33.     replace total_no_presc = 0 if _merge==2
 34. 
.     * Determine end of follow-up date
.     gen dereg_dateA = date(dereg_date, "YMD")
 35.     format %dD/N/CY dereg_dateA
 36.     drop dereg_date
 37.     gen died_dateA = date(died_date_ons, "YMD")
 38.     format %dD/N/CY died_dateA
 39.     drop died_date_ons
 40.     gen end_study = date("31/12/2022", "DMY")
 41.     egen end_date = rowmin(dereg_dateA end_study died_dateA)
 42.     * Count number of days of follow-up 
.     gen total_fu = end_date - date("01/03/2020", "DMY")
 43. 
.     ** Update start and end of follow-up for cohort
.     * Identify prescriptions that start prior to March 2020
.     gen start_prior = (start < date("01/03/2020", "DMY"))
 44.     replace start = date("01/03/2020", "DMY") if start_prior==1
 45. 
.     * Identify first prescriptions that start after March 2020
.     bys patient_id (start): gen start_after = 1 + (start > date("01/03/2020",
>  "DMY") & _n==1)
 46.     tab start_after
 47.     expand start_after
 48. 
.     * Flag new rows
.     bys patient_id start: gen new_record = (_n==2)
 49.     tab start_after new_record 
 50. 
.     * Updating new rows 
.     sort patient_id start
 51.     replace udca=0 if new_record==1
 52.     replace stop = start if new_record==1
 53.     replace start = date("01/03/2020", "DMY") if new_record==1
 54.     drop new_record start_after
 55. 
.     * Identify rows that end after study end date for person 
.     gen end_after = (stop > end_date )
 56.     gen end_before = (start > end_date) 
 57. 
.     tab end_after
 58.     tab end_before 
 59. 
.     * Drop whole rows that are after end_date 
.     drop if end_before 
 60. 
.     * Check those flagged as ending after are last row only 
.     bys patient_id (start): gen last = _n==_N
 61.     tab last end_after 
 62.     * Check how many records end after end date - should just be one
.     bys patient_id: egen tot_end_after = total(end_after)
 63. 
.     replace stop = end_date if end_after==1 & end_before==0
 64. 
.     * Identify prescriptions that end prior to end of follow-up 
.     bys patient_id (start): gen stop_prior = 1 + (stop < end_date & _n==_N)
 65.     tab stop_prior
 66.     expand stop_prior
 67. 
.     * Flag new rows
.     bys patient_id start: gen new_record = (_n==2)
 68.     tab stop_prior new_record 
 69. 
.     * Updating new rows 
.     sort patient_id start
 70.     replace udca=0 if new_record==1
 71.     replace start =  stop if new_record==1
 72.     replace stop = end_date if new_record==1
 73.     drop new_record stop_prior
 74. 
.     count if start > stop 
 75. 
.     * Check that time covered by prescriptions equals total follow-up
.     gen time = stop - start 
 76.     bys patient_id: egen total_time = total(time)
 77. 
.     gen total_time_unequal = total_time!=total_fu
 78.     tab total_time_unequal, m
 79. 
.     save ./output/time_varying_udca_all_vars_`i'
 80.     * Drop unnecessary variables
.     keep patient_id start stop udca 
 81. 
.     save ./output/time_varying_udca_`i'
 82.     restore
 83. }
  0
(0 observations deleted)
(1000 real changes made)

Duplicates in terms of all variables

(74,862 observations deleted)

  to_expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,000       59.70       59.70
          2 |        675       40.30      100.00
------------+-----------------------------------
      Total |      1,675      100.00
(675 observations created)

           |      new_record
 to_expand |         0          1 |     Total
-----------+----------------------+----------
         1 |     1,000          0 |     1,000 
         2 |       675        675 |     1,350 
-----------+----------------------+----------
     Total |     1,675        675 |     2,350 
(675 real changes made)
(675 real changes made)
(675 real changes made)
  0
  0

    Result                           # of obs.
    -----------------------------------------
    not matched                         3,040
        from master                     2,131  (_merge==1)
        from using                        909  (_merge==2)

    matched                               219  (_merge==3)
    -----------------------------------------

                 _merge |      Freq.     Percent        Cum.
------------------------+-----------------------------------
        master only (1) |      2,131       65.39       65.39
         using only (2) |        909       27.89       93.28
            matched (3) |        219        6.72      100.00
------------------------+-----------------------------------
                  Total |      3,259      100.00
(909 real changes made)
(909 real changes made)
(909 real changes made)
(909 real changes made)
(2,697 missing values generated)
(2,677 missing values generated)
(0 real changes made)

start_after |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      2,259       69.32       69.32
          2 |      1,000       30.68      100.00
------------+-----------------------------------
      Total |      3,259      100.00
(1,000 observations created)

start_afte |      new_record
         r |         0          1 |     Total
-----------+----------------------+----------
         1 |     2,259          0 |     2,259 
         2 |     1,000      1,000 |     2,000 
-----------+----------------------+----------
     Total |     3,259      1,000 |     4,259 
(1,000 real changes made)
(1,000 real changes made)
(1,000 real changes made)

  end_after |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,584       60.67       60.67
          1 |      1,675       39.33      100.00
------------+-----------------------------------
      Total |      4,259      100.00

 end_before |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,198       98.57       98.57
          1 |         61        1.43      100.00
------------+-----------------------------------
      Total |      4,259      100.00
(61 observations deleted)

           |       end_after
      last |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,289          0 |     2,289 
         1 |       295      1,614 |     1,909 
-----------+----------------------+----------
     Total |     2,584      1,614 |     4,198 
(1,614 real changes made)

 stop_prior |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      4,193       99.88       99.88
          2 |          5        0.12      100.00
------------+-----------------------------------
      Total |      4,198      100.00
(5 observations created)

           |      new_record
stop_prior |         0          1 |     Total
-----------+----------------------+----------
         1 |     4,193          0 |     4,193 
         2 |         5          5 |        10 
-----------+----------------------+----------
     Total |     4,198          5 |     4,203 
(5 real changes made)
(5 real changes made)
(5 real changes made)
  0

total_time_ |
    unequal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,203      100.00      100.00
------------+-----------------------------------
      Total |      4,203      100.00
file ./output/time_varying_udca_all_vars_60.dta saved
file ./output/time_varying_udca_60.dta saved
  0
(0 observations deleted)
(1000 real changes made)

Duplicates in terms of all variables

(75,472 observations deleted)

  to_expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,000       93.90       93.90
          2 |         65        6.10      100.00
------------+-----------------------------------
      Total |      1,065      100.00
(65 observations created)

           |      new_record
 to_expand |         0          1 |     Total
-----------+----------------------+----------
         1 |     1,000          0 |     1,000 
         2 |        65         65 |       130 
-----------+----------------------+----------
     Total |     1,065         65 |     1,130 
(65 real changes made)
(65 real changes made)
(65 real changes made)
  0
  0

    Result                           # of obs.
    -----------------------------------------
    not matched                         1,930
        from master                     1,021  (_merge==1)
        from using                        909  (_merge==2)

    matched                               109  (_merge==3)
    -----------------------------------------

                 _merge |      Freq.     Percent        Cum.
------------------------+-----------------------------------
        master only (1) |      1,021       50.07       50.07
         using only (2) |        909       44.58       94.65
            matched (3) |        109        5.35      100.00
------------------------+-----------------------------------
                  Total |      2,039      100.00
(909 real changes made)
(909 real changes made)
(909 real changes made)
(909 real changes made)
(1,531 missing values generated)
(1,527 missing values generated)
(0 real changes made)

start_after |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,039       50.96       50.96
          2 |      1,000       49.04      100.00
------------+-----------------------------------
      Total |      2,039      100.00
(1,000 observations created)

start_afte |      new_record
         r |         0          1 |     Total
-----------+----------------------+----------
         1 |     1,039          0 |     1,039 
         2 |     1,000      1,000 |     2,000 
-----------+----------------------+----------
     Total |     2,039      1,000 |     3,039 
(1,000 real changes made)
(1,000 real changes made)
(1,000 real changes made)

  end_after |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,411       46.43       46.43
          1 |      1,628       53.57      100.00
------------+-----------------------------------
      Total |      3,039      100.00

 end_before |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,032       99.77       99.77
          1 |          7        0.23      100.00
------------+-----------------------------------
      Total |      3,039      100.00
(7 observations deleted)

           |       end_after
      last |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,123          0 |     1,123 
         1 |       288      1,621 |     1,909 
-----------+----------------------+----------
     Total |     1,411      1,621 |     3,032 
(1,621 real changes made)

 stop_prior |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,031       99.97       99.97
          2 |          1        0.03      100.00
------------+-----------------------------------
      Total |      3,032      100.00
(1 observation created)

           |      new_record
stop_prior |         0          1 |     Total
-----------+----------------------+----------
         1 |     3,031          0 |     3,031 
         2 |         1          1 |         2 
-----------+----------------------+----------
     Total |     3,032          1 |     3,033 
(1 real change made)
(1 real change made)
(1 real change made)
  0

total_time_ |
    unequal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,033      100.00      100.00
------------+-----------------------------------
      Total |      3,033      100.00
file ./output/time_varying_udca_all_vars_90.dta saved
file ./output/time_varying_udca_90.dta saved
  0
(0 observations deleted)
(1000 real changes made)

Duplicates in terms of all variables

(75,528 observations deleted)

  to_expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,000       99.11       99.11
          2 |          9        0.89      100.00
------------+-----------------------------------
      Total |      1,009      100.00
(9 observations created)

           |      new_record
 to_expand |         0          1 |     Total
-----------+----------------------+----------
         1 |     1,000          0 |     1,000 
         2 |         9          9 |        18 
-----------+----------------------+----------
     Total |     1,009          9 |     1,018 
(9 real changes made)
(9 real changes made)
(9 real changes made)
  0
  0

    Result                           # of obs.
    -----------------------------------------
    not matched                         1,834
        from master                       925  (_merge==1)
        from using                        909  (_merge==2)

    matched                                93  (_merge==3)
    -----------------------------------------

                 _merge |      Freq.     Percent        Cum.
------------------------+-----------------------------------
        master only (1) |        925       48.00       48.00
         using only (2) |        909       47.17       95.17
            matched (3) |         93        4.83      100.00
------------------------+-----------------------------------
                  Total |      1,927      100.00
(909 real changes made)
(909 real changes made)
(909 real changes made)
(909 real changes made)
(1,427 missing values generated)
(1,425 missing values generated)
(0 real changes made)

start_after |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        927       48.11       48.11
          2 |      1,000       51.89      100.00
------------+-----------------------------------
      Total |      1,927      100.00
(1,000 observations created)

start_afte |      new_record
         r |         0          1 |     Total
-----------+----------------------+----------
         1 |       927          0 |       927 
         2 |     1,000      1,000 |     2,000 
-----------+----------------------+----------
     Total |     1,927      1,000 |     2,927 
(1,000 real changes made)
(1,000 real changes made)
(1,000 real changes made)

  end_after |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,302       44.48       44.48
          1 |      1,625       55.52      100.00
------------+-----------------------------------
      Total |      2,927      100.00

 end_before |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,924       99.90       99.90
          1 |          3        0.10      100.00
------------+-----------------------------------
      Total |      2,927      100.00
(3 observations deleted)

           |       end_after
      last |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,015          0 |     1,015 
         1 |       287      1,622 |     1,909 
-----------+----------------------+----------
     Total |     1,302      1,622 |     2,924 
(1,622 real changes made)

 stop_prior |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      2,924      100.00      100.00
------------+-----------------------------------
      Total |      2,924      100.00
(0 observations created)

           | new_record
stop_prior |         0 |     Total
-----------+-----------+----------
         1 |     2,924 |     2,924 
-----------+-----------+----------
     Total |     2,924 |     2,924 
(0 real changes made)
(0 real changes made)
(0 real changes made)
  0

total_time_ |
    unequal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,924      100.00      100.00
------------+-----------------------------------
      Total |      2,924      100.00
file ./output/time_varying_udca_all_vars_120.dta saved
file ./output/time_varying_udca_120.dta saved
  0
(0 observations deleted)
(1000 real changes made)

Duplicates in terms of all variables

(75,536 observations deleted)

  to_expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,000       99.90       99.90
          2 |          1        0.10      100.00
------------+-----------------------------------
      Total |      1,001      100.00
(1 observation created)

           |      new_record
 to_expand |         0          1 |     Total
-----------+----------------------+----------
         1 |     1,000          0 |     1,000 
         2 |         1          1 |         2 
-----------+----------------------+----------
     Total |     1,001          1 |     1,002 
(1 real change made)
(1 real change made)
(1 real change made)
  0
  0

    Result                           # of obs.
    -----------------------------------------
    not matched                         1,820
        from master                       911  (_merge==1)
        from using                        909  (_merge==2)

    matched                                91  (_merge==3)
    -----------------------------------------

                 _merge |      Freq.     Percent        Cum.
------------------------+-----------------------------------
        master only (1) |        911       47.67       47.67
         using only (2) |        909       47.57       95.24
            matched (3) |         91        4.76      100.00
------------------------+-----------------------------------
                  Total |      1,911      100.00
(909 real changes made)
(909 real changes made)
(909 real changes made)
(909 real changes made)
(1,411 missing values generated)
(1,411 missing values generated)
(0 real changes made)

start_after |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        911       47.67       47.67
          2 |      1,000       52.33      100.00
------------+-----------------------------------
      Total |      1,911      100.00
(1,000 observations created)

start_afte |      new_record
         r |         0          1 |     Total
-----------+----------------------+----------
         1 |       911          0 |       911 
         2 |     1,000      1,000 |     2,000 
-----------+----------------------+----------
     Total |     1,911      1,000 |     2,911 
(1,000 real changes made)
(1,000 real changes made)
(1,000 real changes made)

  end_after |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,288       44.25       44.25
          1 |      1,623       55.75      100.00
------------+-----------------------------------
      Total |      2,911      100.00

 end_before |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,910       99.97       99.97
          1 |          1        0.03      100.00
------------+-----------------------------------
      Total |      2,911      100.00
(1 observation deleted)

           |       end_after
      last |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,001          0 |     1,001 
         1 |       287      1,622 |     1,909 
-----------+----------------------+----------
     Total |     1,288      1,622 |     2,910 
(1,622 real changes made)

 stop_prior |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      2,910      100.00      100.00
------------+-----------------------------------
      Total |      2,910      100.00
(0 observations created)

           | new_record
stop_prior |         0 |     Total
-----------+-----------+----------
         1 |     2,910 |     2,910 
-----------+-----------+----------
     Total |     2,910 |     2,910 
(0 real changes made)
(0 real changes made)
(0 real changes made)
  0

total_time_ |
    unequal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,910      100.00      100.00
------------+-----------------------------------
      Total |      2,910      100.00
file ./output/time_varying_udca_all_vars_150.dta saved
file ./output/time_varying_udca_150.dta saved
  0
(0 observations deleted)
(1000 real changes made)

Duplicates in terms of all variables

(75,537 observations deleted)

  to_expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,000      100.00      100.00
------------+-----------------------------------
      Total |      1,000      100.00
(0 observations created)

           | new_record
 to_expand |         0 |     Total
-----------+-----------+----------
         1 |     1,000 |     1,000 
-----------+-----------+----------
     Total |     1,000 |     1,000 
(0 real changes made)
(0 real changes made)
(0 real changes made)
  0
  0

    Result                           # of obs.
    -----------------------------------------
    not matched                         1,818
        from master                       909  (_merge==1)
        from using                        909  (_merge==2)

    matched                                91  (_merge==3)
    -----------------------------------------

                 _merge |      Freq.     Percent        Cum.
------------------------+-----------------------------------
        master only (1) |        909       47.62       47.62
         using only (2) |        909       47.62       95.23
            matched (3) |         91        4.77      100.00
------------------------+-----------------------------------
                  Total |      1,909      100.00
(909 real changes made)
(909 real changes made)
(909 real changes made)
(909 real changes made)
(1,409 missing values generated)
(1,409 missing values generated)
(0 real changes made)

start_after |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        909       47.62       47.62
          2 |      1,000       52.38      100.00
------------+-----------------------------------
      Total |      1,909      100.00
(1,000 observations created)

start_afte |      new_record
         r |         0          1 |     Total
-----------+----------------------+----------
         1 |       909          0 |       909 
         2 |     1,000      1,000 |     2,000 
-----------+----------------------+----------
     Total |     1,909      1,000 |     2,909 
(1,000 real changes made)
(1,000 real changes made)
(1,000 real changes made)

  end_after |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,286       44.21       44.21
          1 |      1,623       55.79      100.00
------------+-----------------------------------
      Total |      2,909      100.00

 end_before |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,908       99.97       99.97
          1 |          1        0.03      100.00
------------+-----------------------------------
      Total |      2,909      100.00
(1 observation deleted)

           |       end_after
      last |         0          1 |     Total
-----------+----------------------+----------
         0 |       999          0 |       999 
         1 |       287      1,622 |     1,909 
-----------+----------------------+----------
     Total |     1,286      1,622 |     2,908 
(1,622 real changes made)

 stop_prior |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      2,908      100.00      100.00
------------+-----------------------------------
      Total |      2,908      100.00
(0 observations created)

           | new_record
stop_prior |         0 |     Total
-----------+-----------+----------
         1 |     2,908 |     2,908 
-----------+-----------+----------
     Total |     2,908 |     2,908 
(0 real changes made)
(0 real changes made)
(0 real changes made)
  0

total_time_ |
    unequal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,908      100.00      100.00
------------+-----------------------------------
      Total |      2,908      100.00
file ./output/time_varying_udca_all_vars_180.dta saved
file ./output/time_varying_udca_180.dta saved

. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
end of do-file

. . file open output using "/tmp/101_drug_prep.do.bOOC.out", write text replace

. . file write output "success" 

. . file close output

. 
end of do-file


