
. 
. cap mkdir ./output/tables/

. 
. tempfile tempfile 

. import delimited using ./output/input_pbc.csv
(97 vars, 1,000 obs)

. save `tempfile' 
file /tmp/St00015.000001 saved

. 
. ** First import udca population
. import delimited using ./output/input_additional.csv, clear
(335 vars, 1,000 obs)

. 
. describe 

Contains data
  obs:         1,000                          
 vars:           335                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
udca_1          str10   %10s                  
udca_2          str10   %10s                  
udca_3          str10   %10s                  
udca_4          str10   %10s                  
udca_5          str10   %10s                  
udca_6          str10   %10s                  
udca_7          str10   %10s                  
udca_8          str10   %10s                  
udca_9          str10   %10s                  
udca_10         str10   %10s                  
udca_11         str10   %10s                  
udca_12         str10   %10s                  
udca_13         str10   %10s                  
udca_14         str10   %10s                  
udca_15         str10   %10s                  
udca_16         str10   %10s                  
udca_17         str10   %10s                  
udca_18         str10   %10s                  
udca_19         str10   %10s                  
udca_20         str10   %10s                  
udca_21         str10   %10s                  
udca_22         str10   %10s                  
udca_23         str10   %10s                  
udca_24         str10   %10s                  
udca_25         str10   %10s                  
udca_26         str10   %10s                  
udca_27         str10   %10s                  
udca_28         str10   %10s                  
udca_29         str10   %10s                  
udca_30         str10   %10s                  
udca_31         str10   %10s                  
udca_32         str10   %10s                  
udca_33         str10   %10s                  
udca_34         str10   %10s                  
udca_35         str10   %10s                  
udca_36         str10   %10s                  
udca_37         str10   %10s                  
udca_38         str10   %10s                  
udca_39         str10   %10s                  
udca_40         str10   %10s                  
udca_41         str10   %10s                  
udca_42         str10   %10s                  
udca_43         str10   %10s                  
udca_44         str10   %10s                  
udca_45         str10   %10s                  
udca_46         str10   %10s                  
udca_47         str10   %10s                  
udca_48         str10   %10s                  
udca_49         str10   %10s                  
udca_50         str10   %10s                  
udca_51         str10   %10s                  
udca_52         str10   %10s                  
udca_53         str10   %10s                  
udca_54         str10   %10s                  
udca_55         str10   %10s                  
udca_56         str10   %10s                  
udca_57         str10   %10s                  
udca_58         str10   %10s                  
udca_59         str10   %10s                  
udca_60         str10   %10s                  
udca_61         str10   %10s                  
udca_62         str10   %10s                  
udca_63         str10   %10s                  
udca_64         str10   %10s                  
udca_65         str10   %10s                  
udca_66         str10   %10s                  
udca_67         str10   %10s                  
udca_68         str10   %10s                  
udca_69         str10   %10s                  
udca_70         str10   %10s                  
udca_71         str10   %10s                  
udca_72         str10   %10s                  
udca_73         str10   %10s                  
udca_74         str10   %10s                  
udca_75         str10   %10s                  
udca_76         str10   %10s                  
udca_77         str10   %10s                  
udca_78         str10   %10s                  
udca_79         str10   %10s                  
udca_80         str10   %10s                  
udca_81         str10   %10s                  
udca_82         str10   %10s                  
udca_83         str10   %10s                  
udca_84         str10   %10s                  
udca_85         str10   %10s                  
udca_86         str10   %10s                  
udca_87         str10   %10s                  
udca_88         str10   %10s                  
udca_89         str10   %10s                  
udca_90         str10   %10s                  
udca_91         str10   %10s                  
udca_92         str10   %10s                  
udca_93         str10   %10s                  
udca_94         str10   %10s                  
udca_95         str10   %10s                  
udca_96         str10   %10s                  
udca_97         str10   %10s                  
udca_98         str10   %10s                  
udca_99         str10   %10s                  
udca_100        str10   %10s                  
udca_101        str10   %10s                  
udca_102        str10   %10s                  
udca_103        str10   %10s                  
udca_104        str10   %10s                  
udca_105        str10   %10s                  
udca_106        str10   %10s                  
udca_107        str10   %10s                  
udca_108        str10   %10s                  
udca_109        str10   %10s                  
udca_110        str10   %10s                  
udca_111        str10   %10s                  
udca_112        str10   %10s                  
udca_113        str10   %10s                  
udca_114        str10   %10s                  
udca_115        str10   %10s                  
udca_116        str10   %10s                  
udca_117        str10   %10s                  
udca_118        str10   %10s                  
udca_119        str10   %10s                  
udca_120        str10   %10s                  
udca_121        str10   %10s                  
udca_122        str10   %10s                  
udca_123        str10   %10s                  
udca_124        str10   %10s                  
udca_125        str10   %10s                  
udca_126        str10   %10s                  
udca_127        str10   %10s                  
udca_128        str10   %10s                  
udca_129        str10   %10s                  
udca_130        str10   %10s                  
udca_131        str10   %10s                  
udca_132        str10   %10s                  
udca_133        str10   %10s                  
udca_134        str10   %10s                  
udca_135        str10   %10s                  
udca_136        str10   %10s                  
udca_137        str10   %10s                  
udca_138        str10   %10s                  
udca_139        str10   %10s                  
udca_140        str10   %10s                  
udca_141        str10   %10s                  
udca_142        str10   %10s                  
udca_143        str10   %10s                  
udca_144        str10   %10s                  
udca_145        str10   %10s                  
udca_146        str10   %10s                  
udca_147        str10   %10s                  
udca_148        str10   %10s                  
udca_149        str10   %10s                  
udca_150        str10   %10s                  
udca_151        str10   %10s                  
udca_152        str10   %10s                  
udca_153        str10   %10s                  
udca_154        str10   %10s                  
udca_155        str10   %10s                  
udca_156        str10   %10s                  
udca_157        str10   %10s                  
udca_158        str10   %10s                  
udca_159        str10   %10s                  
udca_160        str10   %10s                  
udca_161        str10   %10s                  
udca_162        str10   %10s                  
udca_163        str10   %10s                  
udca_164        str10   %10s                  
udca_165        str10   %10s                  
udca_166        str10   %10s                  
udca_167        str10   %10s                  
udca_168        str10   %10s                  
udca_169        str10   %10s                  
udca_170        str10   %10s                  
udca_171        str10   %10s                  
udca_172        str10   %10s                  
udca_173        str10   %10s                  
udca_174        str10   %10s                  
udca_175        str10   %10s                  
udca_176        str10   %10s                  
udca_177        str10   %10s                  
udca_178        str10   %10s                  
udca_179        str10   %10s                  
udca_180        str10   %10s                  
udca_181        str10   %10s                  
udca_182        str10   %10s                  
udca_183        str10   %10s                  
udca_184        str10   %10s                  
udca_185        str10   %10s                  
udca_186        str10   %10s                  
udca_187        str10   %10s                  
udca_188        str10   %10s                  
udca_189        str10   %10s                  
udca_190        str10   %10s                  
udca_191        str10   %10s                  
udca_192        str10   %10s                  
udca_193        str10   %10s                  
udca_194        str10   %10s                  
udca_195        str10   %10s                  
udca_196        str10   %10s                  
udca_197        str10   %10s                  
udca_198        str10   %10s                  
udca_199        str10   %10s                  
udca_200        str10   %10s                  
udca_201        str10   %10s                  
udca_202        str10   %10s                  
udca_203        str10   %10s                  
udca_204        str10   %10s                  
udca_205        str10   %10s                  
udca_206        str10   %10s                  
udca_207        str10   %10s                  
udca_208        str10   %10s                  
udca_209        str10   %10s                  
udca_210        str10   %10s                  
udca_211        str10   %10s                  
udca_212        str10   %10s                  
udca_213        str10   %10s                  
udca_214        str10   %10s                  
udca_215        str10   %10s                  
udca_216        str10   %10s                  
udca_217        str10   %10s                  
udca_218        str10   %10s                  
udca_219        str10   %10s                  
udca_220        str10   %10s                  
udca_221        str10   %10s                  
udca_222        str10   %10s                  
udca_223        str10   %10s                  
udca_224        str10   %10s                  
udca_225        str10   %10s                  
udca_226        str10   %10s                  
udca_227        str10   %10s                  
udca_228        str10   %10s                  
udca_229        str10   %10s                  
udca_230        str10   %10s                  
udca_231        str10   %10s                  
udca_232        str10   %10s                  
udca_233        str10   %10s                  
udca_234        str10   %10s                  
udca_235        str10   %10s                  
udca_236        str10   %10s                  
udca_237        str10   %10s                  
udca_238        str10   %10s                  
udca_239        str10   %10s                  
udca_240        str10   %10s                  
udca_241        str10   %10s                  
udca_242        str10   %10s                  
udca_243        str10   %10s                  
udca_244        str10   %10s                  
udca_245        str10   %10s                  
udca_246        str10   %10s                  
udca_247        str10   %10s                  
udca_248        str10   %10s                  
udca_249        str10   %10s                  
udca_250        str10   %10s                  
udca_251        str10   %10s                  
udca_252        str10   %10s                  
udca_253        str10   %10s                  
udca_254        str10   %10s                  
udca_255        str10   %10s                  
udca_256        str10   %10s                  
udca_257        str10   %10s                  
udca_258        str10   %10s                  
udca_259        str10   %10s                  
udca_260        str10   %10s                  
udca_261        str10   %10s                  
udca_262        str10   %10s                  
udca_263        str10   %10s                  
udca_264        str10   %10s                  
udca_265        str10   %10s                  
udca_266        str10   %10s                  
udca_267        str10   %10s                  
udca_268        str10   %10s                  
udca_269        str10   %10s                  
udca_270        str10   %10s                  
udca_271        str10   %10s                  
udca_272        str10   %10s                  
udca_273        str10   %10s                  
udca_274        str10   %10s                  
udca_275        str10   %10s                  
udca_276        str10   %10s                  
udca_277        str10   %10s                  
udca_278        str10   %10s                  
udca_279        str10   %10s                  
udca_280        str10   %10s                  
udca_281        str10   %10s                  
udca_282        str10   %10s                  
udca_283        str10   %10s                  
udca_284        str10   %10s                  
udca_285        str10   %10s                  
udca_286        str10   %10s                  
udca_287        str10   %10s                  
udca_288        str10   %10s                  
udca_289        str10   %10s                  
udca_290        str10   %10s                  
udca_291        str10   %10s                  
udca_292        str10   %10s                  
udca_293        str10   %10s                  
udca_294        str10   %10s                  
udca_295        str10   %10s                  
udca_296        str10   %10s                  
udca_297        str10   %10s                  
udca_298        str10   %10s                  
udca_299        str10   %10s                  
udca_300        str10   %10s                  
udca_301        str10   %10s                  
udca_302        str10   %10s                  
udca_303        str10   %10s                  
udca_304        str10   %10s                  
udca_305        str10   %10s                  
udca_306        str10   %10s                  
udca_307        str10   %10s                  
udca_308        str10   %10s                  
udca_309        str10   %10s                  
udca_310        str10   %10s                  
udca_311        str10   %10s                  
udca_312        str10   %10s                  
udca_313        str10   %10s                  
udca_314        str10   %10s                  
udca_315        str10   %10s                  
udca_316        str10   %10s                  
udca_317        str10   %10s                  
udca_318        str10   %10s                  
udca_319        str10   %10s                  
udca_320        str10   %10s                  
udca_321        str10   %10s                  
udca_322        str10   %10s                  
udca_323        str10   %10s                  
udca_324        str10   %10s                  
udca_325        str10   %10s                  
udca_326        str10   %10s                  
udca_327        str10   %10s                  
udca_328        str10   %10s                  
udca_329        str10   %10s                  
udca_330        str10   %10s                  
udca_331        str10   %10s                  
udca_332        str10   %10s                  
udca_333        str10   %10s                  
udca_334        str10   %10s                  
patient_id      int     %8.0g                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. 
. *missings report, minimum(12400)
. missings dropvars udca_*, force

Checking missings in udca_1 udca_2 udca_3 udca_4 udca_5 udca_6 udca_7 udca_8
    udca_9 udca_10 udca_11 udca_12 udca_13 udca_14 udca_15 udca_16 udca_17
    udca_18 udca_19 udca_20 udca_21 udca_22 udca_23 udca_24 udca_25 udca_26
    udca_27 udca_28 udca_29 udca_30 udca_31 udca_32 udca_33 udca_34 udca_35
    udca_36 udca_37 udca_38 udca_39 udca_40 udca_41 udca_42 udca_43 udca_44
    udca_45 udca_46 udca_47 udca_48 udca_49 udca_50 udca_51 udca_52 udca_53
    udca_54 udca_55 udca_56 udca_57 udca_58 udca_59 udca_60 udca_61 udca_62
    udca_63 udca_64 udca_65 udca_66 udca_67 udca_68 udca_69 udca_70 udca_71
    udca_72 udca_73 udca_74 udca_75 udca_76 udca_77 udca_78 udca_79 udca_80
    udca_81 udca_82 udca_83 udca_84 udca_85 udca_86 udca_87 udca_88 udca_89
    udca_90 udca_91 udca_92 udca_93 udca_94 udca_95 udca_96 udca_97 udca_98
    udca_99 udca_100 udca_101 udca_102 udca_103 udca_104 udca_105 udca_106
    udca_107 udca_108 udca_109 udca_110 udca_111 udca_112 udca_113 udca_114
    udca_115 udca_116 udca_117 udca_118 udca_119 udca_120 udca_121 udca_122
    udca_123 udca_124 udca_125 udca_126 udca_127 udca_128 udca_129 udca_130
    udca_131 udca_132 udca_133 udca_134 udca_135 udca_136 udca_137 udca_138
    udca_139 udca_140 udca_141 udca_142 udca_143 udca_144 udca_145 udca_146
    udca_147 udca_148 udca_149 udca_150 udca_151 udca_152 udca_153 udca_154
    udca_155 udca_156 udca_157 udca_158 udca_159 udca_160 udca_161 udca_162
    udca_163 udca_164 udca_165 udca_166 udca_167 udca_168 udca_169 udca_170
    udca_171 udca_172 udca_173 udca_174 udca_175 udca_176 udca_177 udca_178
    udca_179 udca_180 udca_181 udca_182 udca_183 udca_184 udca_185 udca_186
    udca_187 udca_188 udca_189 udca_190 udca_191 udca_192 udca_193 udca_194
    udca_195 udca_196 udca_197 udca_198 udca_199 udca_200 udca_201 udca_202
    udca_203 udca_204 udca_205 udca_206 udca_207 udca_208 udca_209 udca_210
    udca_211 udca_212 udca_213 udca_214 udca_215 udca_216 udca_217 udca_218
    udca_219 udca_220 udca_221 udca_222 udca_223 udca_224 udca_225 udca_226
    udca_227 udca_228 udca_229 udca_230 udca_231 udca_232 udca_233 udca_234
    udca_235 udca_236 udca_237 udca_238 udca_239 udca_240 udca_241 udca_242
    udca_243 udca_244 udca_245 udca_246 udca_247 udca_248 udca_249 udca_250
    udca_251 udca_252 udca_253 udca_254 udca_255 udca_256 udca_257 udca_258
    udca_259 udca_260 udca_261 udca_262 udca_263 udca_264 udca_265 udca_266
    udca_267 udca_268 udca_269 udca_270 udca_271 udca_272 udca_273 udca_274
    udca_275 udca_276 udca_277 udca_278 udca_279 udca_280 udca_281 udca_282
    udca_283 udca_284 udca_285 udca_286 udca_287 udca_288 udca_289 udca_290
    udca_291 udca_292 udca_293 udca_294 udca_295 udca_296 udca_297 udca_298
    udca_299 udca_300 udca_301 udca_302 udca_303 udca_304 udca_305 udca_306
    udca_307 udca_308 udca_309 udca_310 udca_311 udca_312 udca_313 udca_314
    udca_315 udca_316 udca_317 udca_318 udca_319 udca_320 udca_321 udca_322
    udca_323 udca_324 udca_325 udca_326 udca_327 udca_328 udca_329 udca_330
    udca_331 udca_332 udca_333 udca_334:
1000 observations with missing values

note: no variables qualify

. 
. * Format dates 187
. forvalues i=1/40 {
  2.     gen udcaA`i' = date(udca_`i', "YMD")
  3.     format udcaA`i' %dD/N/CY
  4.     drop udca_`i'
  5. }
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)

. 
. * Reshape to long format 
. reshape long udcaA, i(patient_id) j(presc_number)
(note: j = 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26
>  27 28 29 30 31 32 33 34 35 36 37 38 39 40)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                     1000   ->   40000
Number of variables                 335   ->     297
j variable (40 values)                    ->   presc_number
xij variables:
              udcaA1 udcaA2 ... udcaA40   ->   udcaA
-----------------------------------------------------------------------------

. 
. * Drop rows where there is no prescription
. drop if udcaA==.
(20,000 observations deleted)

. 
. * Check that prescriptions are in order
. gen order_flag = (udcaA<udcaA[_n-1] & patient_id==patient_id[_n-1])

. tab order_flag 

 order_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,487       52.44       52.44
          1 |      9,513       47.56      100.00
------------+-----------------------------------
      Total |     20,000      100.00

. * Create flag if any out of order prescriptions in the data - should only be 
> in dummy data 
. egen out_of_order = max(order_flag)

. tab out_of_order

out_of_orde |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     20,000      100.00      100.00
------------+-----------------------------------
      Total |     20,000      100.00

. 
. * Sort if out of order - should only apply to dummy data 
. sort patient_id udcaA 

. 
. drop order_flag

. * Check in order
. gen order_flag = (udcaA<udcaA[_n-1] & patient_id==patient_id[_n-1])

. tab order_flag

 order_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     20,000      100.00      100.00
------------+-----------------------------------
      Total |     20,000      100.00

. 
. * Identify prescriptions with the same date 
. bys patient_id: gen dup_presc = (udcaA==udcaA[_n-1])

. tab dup_presc 

  dup_presc |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     19,828       99.14       99.14
          1 |        172        0.86      100.00
------------+-----------------------------------
      Total |     20,000      100.00

. * Drop them 
. drop if dup_presc 
(172 observations deleted)

. 
. drop order_flag out_of_order dup_presc presc_number

. 
. * Re-count number of prescriptions 
. gen udca=1

. bys patient_id: egen total_no_presc = total(udca)

. sum total_no_presc, d

                       total_no_presc
-------------------------------------------------------------
      Percentiles      Smallest
 1%           13             10
 5%           15             10
10%           16             10       Obs              19,828
25%           18             10       Sum of Wgt.      19,828

50%           20                      Mean           20.34214
                        Largest       Std. Dev.      3.118504
75%           23             29
90%           24             29       Variance       9.725067
95%           25             29       Skewness      -.1119935
99%           28             29       Kurtosis       2.997995

. 
. * Determine length of time from previous prescription 
. bys patient_id (udcaA): gen time_previous = udcaA - udcaA[_n-1]
(1,000 missing values generated)

. sum time_previous, d 

                        time_previous
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            3              1
10%            6              1       Obs              18,828
25%           17              1       Sum of Wgt.      18,828

50%           39                      Mean           55.44205
                        Largest       Std. Dev.      53.68448
75%           77            437
90%          126            447       Variance       2882.024
95%          163            473       Skewness       1.874463
99%          249            572       Kurtosis       8.054157

. gen year = year(udcaA)

. bys year: sum time_previous, d

-------------------------------------------------------------------------------
-> year = 2020

                        time_previous
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            3              1
10%            5              1       Obs               4,336
25%           14              1       Sum of Wgt.       4,336

50%           32                      Mean           44.87523
                        Largest       Std. Dev.      40.91925
75%           64            251
90%          101            254       Variance       1674.385
95%          128            277       Skewness        1.49327
99%          179            286       Kurtosis         5.6798

-------------------------------------------------------------------------------
-> year = 2021

                        time_previous
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            4              1
10%            7              1       Obs               6,215
25%           18              1       Sum of Wgt.       6,215

50%           42                      Mean           59.14401
                        Largest       Std. Dev.      56.86728
75%           82            389
90%          134            393       Variance       3233.888
95%          171            407       Skewness       1.795457
99%          264            437       Kurtosis       7.191931

-------------------------------------------------------------------------------
-> year = 2022

                        time_previous
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            4              1
10%            7              1       Obs               6,256
25%           17              1       Sum of Wgt.       6,256

50%           41                      Mean            57.3563
                        Largest       Std. Dev.      55.41038
75%           80            418
90%          131            447       Variance        3070.31
95%          171            473       Skewness       1.917809
99%          250            572       Kurtosis       8.727874

-------------------------------------------------------------------------------
-> year = 2023

                        time_previous
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            4              1
10%            7              1       Obs               2,021
25%           18              1       Sum of Wgt.       2,021

50%           43                      Mean           60.80307
                        Largest       Std. Dev.      59.08084
75%           83            355
90%          141            358       Variance       3490.545
95%          186            371       Skewness       1.709416
99%          272            371       Kurtosis       6.415682


. 
. * Drop records in 2023 as this is after end of study
. drop if year==2023
(2,021 observations deleted)

. forvalues i = 60(30)180 {
  2.     preserve
  3.     * Assume end date is 60 to 180 days after prescription generated
.     gen stop_date = udcaA + `i'
  4.     format stop_date %dD/N/CY 
  5. 
.     * Drop rows where prescriptions ends prior to March 2020
.     count if stop_date <= date("01March2020", "DMY")
  6.     drop if stop_date <= date("01March2020", "DMY")
  7. 
.     * Collapse adjacent prescriptions that are continuous prescribing into on
> e period 
.     * Flag if start date is greater than assumed stop date of previous prescr
> iption 
.     bys patient_id (udcaA): gen spell = udcaA > stop_date[_n-1]
  8.     bys patient_id (udcaA): replace spell = 1 if _n==1
  9.     * Flag each row associated with each spell 
.     bys patient_id (udcaA): gen spell_sum = sum(spell) 
 10.     * Start date of spell 
.     bys patient_id spell_sum (udcaA): gen start = udcaA[1] 
 11.     bys patient_id spell_sum (udcaA): gen stop = stop_date[_N] 
 12.     format start stop %dD/N/CY
 13.     keep patient_id start stop udca total_no_presc
 14.     duplicates drop 
 15. 
.     * Add in rows where there are gaps in prescriptions 
.     bys patient_id (start): gen to_expand = 1 + (stop < start[_n+1])*(start[_
> n+1]~=.)
 16.     tab to_expand 
 17.     expand to_expand 
 18. 
.     * Flag new rows
.     bys patient_id start: gen new_record = (_n==2)
 19.     tab to_expand new_record 
 20. 
.     * Updating new rows 
.     sort patient_id start
 21.     replace udca=0 if new_record==1
 22.     replace start = stop if new_record==1
 23.     bys patient_id (start): replace stop = start[_n+1] if new_record==1
 24.     drop new_record to_expand
 25. 
.     * Checks 
.     count if stop<start 
 26.     sort patient_id start
 27.     count if stop[_n-1]>start & patient_id==patient_id[_n-1]
 28. 
.     * Update to match follow-up time
.     * merge variables from original study definition 
.     merge m:1 patient_id using `tempfile', keepusing(dereg_date died_date_ons
>  udca_count_bl) 
 29.     tab _merge
 30. 
.     * Update variables for people without prescriptions 
.     replace start = date("01/03/2020", "DMY") if _merge==2
 31.     replace udca = 0 if _merge==2
 32.     replace stop = date("31/12/2022", "DMY") if _merge==2
 33.     replace total_no_presc = 0 if _merge==2
 34. 
.     * Determine end of follow-up date
.     gen dereg_dateA = date(dereg_date, "YMD")
 35.     format %dD/N/CY dereg_dateA
 36.     drop dereg_date
 37.     gen died_dateA = date(died_date_ons, "YMD")
 38.     format %dD/N/CY died_dateA
 39.     drop died_date_ons
 40.     gen end_study = date("31/12/2022", "DMY")
 41.     egen end_date = rowmin(dereg_dateA end_study died_dateA)
 42.     * Count number of days of follow-up 
.     gen total_fu = end_date - date("01/03/2020", "DMY")
 43. 
.     ** Update start and end of follow-up for cohort
.     * Identify prescriptions that start prior to March 2020
.     gen start_prior = (start < date("01/03/2020", "DMY"))
 44.     replace start = date("01/03/2020", "DMY") if start_prior==1
 45. 
.     * Identify first prescriptions that start after March 2020
.     bys patient_id (start): gen start_after = 1 + (start > date("01/03/2020",
>  "DMY") & _n==1)
 46.     tab start_after
 47.     expand start_after
 48. 
.     * Flag new rows
.     bys patient_id start: gen new_record = (_n==2)
 49.     tab start_after new_record 
 50. 
.     * Updating new rows 
.     sort patient_id start
 51.     replace udca=0 if new_record==1
 52.     replace stop = start if new_record==1
 53.     replace start = date("01/03/2020", "DMY") if new_record==1
 54.     drop new_record start_after
 55. 
.     * Identify rows that end after study end date for person 
.     gen end_after = (stop > end_date )
 56.     gen end_before = (start > end_date) 
 57. 
.     tab end_after
 58.     tab end_before 
 59. 
.     * Drop whole rows that are after end_date 
.     drop if end_before 
 60. 
.     * Check those flagged as ending after are last row only 
.     bys patient_id (start): gen last = _n==_N
 61.     tab last end_after 
 62.     * Check how many records end after end date - should just be one
.     bys patient_id: egen tot_end_after = total(end_after)
 63. 
.     replace stop = end_date if end_after==1 & end_before==0
 64. 
.     * Identify prescriptions that end prior to end of follow-up 
.     bys patient_id (start): gen stop_prior = 1 + (stop < end_date & _n==_N)
 65.     tab stop_prior
 66.     expand stop_prior
 67. 
.     * Flag new rows
.     bys patient_id start: gen new_record = (_n==2)
 68.     tab stop_prior new_record 
 69. 
.     * Updating new rows 
.     sort patient_id start
 70.     replace udca=0 if new_record==1
 71.     replace start =  stop if new_record==1
 72.     replace stop = end_date if new_record==1
 73.     drop new_record stop_prior
 74. 
.     count if start > stop 
 75. 
.     * Check that time covered by prescriptions equals total follow-up
.     gen time = stop - start 
 76.     bys patient_id: egen total_time = total(time)
 77. 
.     gen total_time_unequal = total_time!=total_fu
 78.     tab total_time_unequal, m
 79. 
.     save ./output/time_varying_udca_all_vars_`i'
 80.     * Drop unnecessary variables
.     keep patient_id start stop udca 
 81. 
.     save ./output/time_varying_udca_`i'
 82.     restore
 83. }
  0
(0 observations deleted)
(1000 real changes made)

Duplicates in terms of all variables

(11,142 observations deleted)

  to_expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,000       15.00       15.00
          2 |      5,665       85.00      100.00
------------+-----------------------------------
      Total |      6,665      100.00
(5,665 observations created)

           |      new_record
 to_expand |         0          1 |     Total
-----------+----------------------+----------
         1 |     1,000          0 |     1,000 
         2 |     5,665      5,665 |    11,330 
-----------+----------------------+----------
     Total |     6,665      5,665 |    12,330 
(5,665 real changes made)
(5,665 real changes made)
(5665 real changes made)
  0
  0

    Result                           # of obs.
    -----------------------------------------
    not matched                        11,944
        from master                    11,051  (_merge==1)
        from using                        893  (_merge==2)

    matched                             1,279  (_merge==3)
    -----------------------------------------

                 _merge |      Freq.     Percent        Cum.
------------------------+-----------------------------------
        master only (1) |     11,051       83.57       83.57
         using only (2) |        893        6.75       90.33
            matched (3) |      1,279        9.67      100.00
------------------------+-----------------------------------
                  Total |     13,223      100.00
(893 real changes made)
(893 real changes made)
(893 real changes made)
(893 real changes made)
(12,117 missing values generated)
(12,159 missing values generated)
(0 real changes made)

start_after |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     12,223       92.44       92.44
          2 |      1,000        7.56      100.00
------------+-----------------------------------
      Total |     13,223      100.00
(1,000 observations created)

start_afte |      new_record
         r |         0          1 |     Total
-----------+----------------------+----------
         1 |    12,223          0 |    12,223 
         2 |     1,000      1,000 |     2,000 
-----------+----------------------+----------
     Total |    13,223      1,000 |    14,223 
(1,000 real changes made)
(1,000 real changes made)
(1,000 real changes made)

  end_after |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,493       87.84       87.84
          1 |      1,730       12.16      100.00
------------+-----------------------------------
      Total |     14,223      100.00

 end_before |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     13,747       96.65       96.65
          1 |        476        3.35      100.00
------------+-----------------------------------
      Total |     14,223      100.00
(476 observations deleted)

           |       end_after
      last |         0          1 |     Total
-----------+----------------------+----------
         0 |    11,854          0 |    11,854 
         1 |       639      1,254 |     1,893 
-----------+----------------------+----------
     Total |    12,493      1,254 |    13,747 
(1,254 real changes made)

 stop_prior |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     13,408       97.53       97.53
          2 |        339        2.47      100.00
------------+-----------------------------------
      Total |     13,747      100.00
(339 observations created)

           |      new_record
stop_prior |         0          1 |     Total
-----------+----------------------+----------
         1 |    13,408          0 |    13,408 
         2 |       339        339 |       678 
-----------+----------------------+----------
     Total |    13,747        339 |    14,086 
(339 real changes made)
(339 real changes made)
(339 real changes made)
  0

total_time_ |
    unequal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,086      100.00      100.00
------------+-----------------------------------
      Total |     14,086      100.00
file ./output/time_varying_udca_all_vars_60.dta saved
file ./output/time_varying_udca_60.dta saved
  0
(0 observations deleted)
(1000 real changes made)

Duplicates in terms of all variables

(13,609 observations deleted)

  to_expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,000       23.82       23.82
          2 |      3,198       76.18      100.00
------------+-----------------------------------
      Total |      4,198      100.00
(3,198 observations created)

           |      new_record
 to_expand |         0          1 |     Total
-----------+----------------------+----------
         1 |     1,000          0 |     1,000 
         2 |     3,198      3,198 |     6,396 
-----------+----------------------+----------
     Total |     4,198      3,198 |     7,396 
(3,198 real changes made)
(3,198 real changes made)
(3198 real changes made)
  0
  0

    Result                           # of obs.
    -----------------------------------------
    not matched                         7,502
        from master                     6,609  (_merge==1)
        from using                        893  (_merge==2)

    matched                               787  (_merge==3)
    -----------------------------------------

                 _merge |      Freq.     Percent        Cum.
------------------------+-----------------------------------
        master only (1) |      6,609       79.73       79.73
         using only (2) |        893       10.77       90.51
            matched (3) |        787        9.49      100.00
------------------------+-----------------------------------
                  Total |      8,289      100.00
(893 real changes made)
(893 real changes made)
(893 real changes made)
(893 real changes made)
(7,437 missing values generated)
(7,481 missing values generated)
(0 real changes made)

start_after |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      7,289       87.94       87.94
          2 |      1,000       12.06      100.00
------------+-----------------------------------
      Total |      8,289      100.00
(1,000 observations created)

start_afte |      new_record
         r |         0          1 |     Total
-----------+----------------------+----------
         1 |     7,289          0 |     7,289 
         2 |     1,000      1,000 |     2,000 
-----------+----------------------+----------
     Total |     8,289      1,000 |     9,289 
(1,000 real changes made)
(1,000 real changes made)
(1,000 real changes made)

  end_after |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,633       82.17       82.17
          1 |      1,656       17.83      100.00
------------+-----------------------------------
      Total |      9,289      100.00

 end_before |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      9,016       97.06       97.06
          1 |        273        2.94      100.00
------------+-----------------------------------
      Total |      9,289      100.00
(273 observations deleted)

           |       end_after
      last |         0          1 |     Total
-----------+----------------------+----------
         0 |     7,123          0 |     7,123 
         1 |       510      1,383 |     1,893 
-----------+----------------------+----------
     Total |     7,633      1,383 |     9,016 
(1,383 real changes made)

 stop_prior |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      8,800       97.60       97.60
          2 |        216        2.40      100.00
------------+-----------------------------------
      Total |      9,016      100.00
(216 observations created)

           |      new_record
stop_prior |         0          1 |     Total
-----------+----------------------+----------
         1 |     8,800          0 |     8,800 
         2 |       216        216 |       432 
-----------+----------------------+----------
     Total |     9,016        216 |     9,232 
(216 real changes made)
(216 real changes made)
(216 real changes made)
  0

total_time_ |
    unequal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      9,232      100.00      100.00
------------+-----------------------------------
      Total |      9,232      100.00
file ./output/time_varying_udca_all_vars_90.dta saved
file ./output/time_varying_udca_90.dta saved
  0
(0 observations deleted)
(1000 real changes made)

Duplicates in terms of all variables

(15,002 observations deleted)

  to_expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,000       35.65       35.65
          2 |      1,805       64.35      100.00
------------+-----------------------------------
      Total |      2,805      100.00
(1,805 observations created)

           |      new_record
 to_expand |         0          1 |     Total
-----------+----------------------+----------
         1 |     1,000          0 |     1,000 
         2 |     1,805      1,805 |     3,610 
-----------+----------------------+----------
     Total |     2,805      1,805 |     4,610 
(1,805 real changes made)
(1,805 real changes made)
(1805 real changes made)
  0
  0

    Result                           # of obs.
    -----------------------------------------
    not matched                         5,008
        from master                     4,115  (_merge==1)
        from using                        893  (_merge==2)

    matched                               495  (_merge==3)
    -----------------------------------------

                 _merge |      Freq.     Percent        Cum.
------------------------+-----------------------------------
        master only (1) |      4,115       74.78       74.78
         using only (2) |        893       16.23       91.00
            matched (3) |        495        9.00      100.00
------------------------+-----------------------------------
                  Total |      5,503      100.00
(893 real changes made)
(893 real changes made)
(893 real changes made)
(893 real changes made)
(4,809 missing values generated)
(4,819 missing values generated)
(0 real changes made)

start_after |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      4,503       81.83       81.83
          2 |      1,000       18.17      100.00
------------+-----------------------------------
      Total |      5,503      100.00
(1,000 observations created)

start_afte |      new_record
         r |         0          1 |     Total
-----------+----------------------+----------
         1 |     4,503          0 |     4,503 
         2 |     1,000      1,000 |     2,000 
-----------+----------------------+----------
     Total |     5,503      1,000 |     6,503 
(1,000 real changes made)
(1,000 real changes made)
(1,000 real changes made)

  end_after |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,870       74.89       74.89
          1 |      1,633       25.11      100.00
------------+-----------------------------------
      Total |      6,503      100.00

 end_before |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,338       97.46       97.46
          1 |        165        2.54      100.00
------------+-----------------------------------
      Total |      6,503      100.00
(165 observations deleted)

           |       end_after
      last |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,445          0 |     4,445 
         1 |       425      1,468 |     1,893 
-----------+----------------------+----------
     Total |     4,870      1,468 |     6,338 
(1,468 real changes made)

 stop_prior |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      6,208       97.95       97.95
          2 |        130        2.05      100.00
------------+-----------------------------------
      Total |      6,338      100.00
(130 observations created)

           |      new_record
stop_prior |         0          1 |     Total
-----------+----------------------+----------
         1 |     6,208          0 |     6,208 
         2 |       130        130 |       260 
-----------+----------------------+----------
     Total |     6,338        130 |     6,468 
(130 real changes made)
(130 real changes made)
(130 real changes made)
  0

total_time_ |
    unequal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,468      100.00      100.00
------------+-----------------------------------
      Total |      6,468      100.00
file ./output/time_varying_udca_all_vars_120.dta saved
file ./output/time_varying_udca_120.dta saved
  0
(0 observations deleted)
(1000 real changes made)

Duplicates in terms of all variables

(15,793 observations deleted)

  to_expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,000       49.65       49.65
          2 |      1,014       50.35      100.00
------------+-----------------------------------
      Total |      2,014      100.00
(1,014 observations created)

           |      new_record
 to_expand |         0          1 |     Total
-----------+----------------------+----------
         1 |     1,000          0 |     1,000 
         2 |     1,014      1,014 |     2,028 
-----------+----------------------+----------
     Total |     2,014      1,014 |     3,028 
(1,014 real changes made)
(1,014 real changes made)
(1014 real changes made)
  0
  0

    Result                           # of obs.
    -----------------------------------------
    not matched                         3,582
        from master                     2,689  (_merge==1)
        from using                        893  (_merge==2)

    matched                               339  (_merge==3)
    -----------------------------------------

                 _merge |      Freq.     Percent        Cum.
------------------------+-----------------------------------
        master only (1) |      2,689       68.58       68.58
         using only (2) |        893       22.77       91.35
            matched (3) |        339        8.65      100.00
------------------------+-----------------------------------
                  Total |      3,921      100.00
(893 real changes made)
(893 real changes made)
(893 real changes made)
(893 real changes made)
(3,313 missing values generated)
(3,303 missing values generated)
(0 real changes made)

start_after |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      2,921       74.50       74.50
          2 |      1,000       25.50      100.00
------------+-----------------------------------
      Total |      3,921      100.00
(1,000 observations created)

start_afte |      new_record
         r |         0          1 |     Total
-----------+----------------------+----------
         1 |     2,921          0 |     2,921 
         2 |     1,000      1,000 |     2,000 
-----------+----------------------+----------
     Total |     3,921      1,000 |     4,921 
(1,000 real changes made)
(1,000 real changes made)
(1,000 real changes made)

  end_after |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,303       67.12       67.12
          1 |      1,618       32.88      100.00
------------+-----------------------------------
      Total |      4,921      100.00

 end_before |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,820       97.95       97.95
          1 |        101        2.05      100.00
------------+-----------------------------------
      Total |      4,921      100.00
(101 observations deleted)

           |       end_after
      last |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,927          0 |     2,927 
         1 |       376      1,517 |     1,893 
-----------+----------------------+----------
     Total |     3,303      1,517 |     4,820 
(1,517 real changes made)

 stop_prior |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      4,740       98.34       98.34
          2 |         80        1.66      100.00
------------+-----------------------------------
      Total |      4,820      100.00
(80 observations created)

           |      new_record
stop_prior |         0          1 |     Total
-----------+----------------------+----------
         1 |     4,740          0 |     4,740 
         2 |        80         80 |       160 
-----------+----------------------+----------
     Total |     4,820         80 |     4,900 
(80 real changes made)
(80 real changes made)
(80 real changes made)
  0

total_time_ |
    unequal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,900      100.00      100.00
------------+-----------------------------------
      Total |      4,900      100.00
file ./output/time_varying_udca_all_vars_150.dta saved
file ./output/time_varying_udca_150.dta saved
  0
(0 observations deleted)
(1000 real changes made)

Duplicates in terms of all variables

(16,245 observations deleted)

  to_expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,000       64.02       64.02
          2 |        562       35.98      100.00
------------+-----------------------------------
      Total |      1,562      100.00
(562 observations created)

           |      new_record
 to_expand |         0          1 |     Total
-----------+----------------------+----------
         1 |     1,000          0 |     1,000 
         2 |       562        562 |     1,124 
-----------+----------------------+----------
     Total |     1,562        562 |     2,124 
(562 real changes made)
(562 real changes made)
(562 real changes made)
  0
  0

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,796
        from master                     1,903  (_merge==1)
        from using                        893  (_merge==2)

    matched                               221  (_merge==3)
    -----------------------------------------

                 _merge |      Freq.     Percent        Cum.
------------------------+-----------------------------------
        master only (1) |      1,903       63.08       63.08
         using only (2) |        893       29.60       92.67
            matched (3) |        221        7.33      100.00
------------------------+-----------------------------------
                  Total |      3,017      100.00
(893 real changes made)
(893 real changes made)
(893 real changes made)
(893 real changes made)
(2,461 missing values generated)
(2,463 missing values generated)
(0 real changes made)

start_after |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      2,017       66.85       66.85
          2 |      1,000       33.15      100.00
------------+-----------------------------------
      Total |      3,017      100.00
(1,000 observations created)

start_afte |      new_record
         r |         0          1 |     Total
-----------+----------------------+----------
         1 |     2,017          0 |     2,017 
         2 |     1,000      1,000 |     2,000 
-----------+----------------------+----------
     Total |     3,017      1,000 |     4,017 
(1,000 real changes made)
(1,000 real changes made)
(1,000 real changes made)

  end_after |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,405       59.87       59.87
          1 |      1,612       40.13      100.00
------------+-----------------------------------
      Total |      4,017      100.00

 end_before |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,955       98.46       98.46
          1 |         62        1.54      100.00
------------+-----------------------------------
      Total |      4,017      100.00
(62 observations deleted)

           |       end_after
      last |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,062          0 |     2,062 
         1 |       343      1,550 |     1,893 
-----------+----------------------+----------
     Total |     2,405      1,550 |     3,955 
(1,550 real changes made)

 stop_prior |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,905       98.74       98.74
          2 |         50        1.26      100.00
------------+-----------------------------------
      Total |      3,955      100.00
(50 observations created)

           |      new_record
stop_prior |         0          1 |     Total
-----------+----------------------+----------
         1 |     3,905          0 |     3,905 
         2 |        50         50 |       100 
-----------+----------------------+----------
     Total |     3,955         50 |     4,005 
(50 real changes made)
(50 real changes made)
(50 real changes made)
  0

total_time_ |
    unequal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,005      100.00      100.00
------------+-----------------------------------
      Total |      4,005      100.00
file ./output/time_varying_udca_all_vars_180.dta saved
file ./output/time_varying_udca_180.dta saved

. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
end of do-file

. . file open output using "/tmp/101_drug_prep.do.qvYd.out", write text replace

. . file write output "success" 

. . file close output

. 
end of do-file


