
. 
. ** First import udca population
. import delimited using ./output/input.csv
(12 vars, 1,000 obs)

. 
. * Format dates 
. foreach var in udca_last_date udca_first_after udca_first_history died_date_o
> ns {
  2.     gen `var'A = date(`var', "YMD")
  3.     format `var'A %dD/N/CY
  4.     list `var' `var'A in  1/5
  5.     drop `var'
  6. }
(500 missing values generated)

     +-------------------------+
     | udca_las~e   udca_las~A |
     |-------------------------|
  1. |                       . |
  2. |                       . |
  3. | 2020-02-26   26/02/2020 |
  4. | 2020-02-05   05/02/2020 |
  5. | 2019-12-26   26/12/2019 |
     +-------------------------+
(500 missing values generated)

     +-------------------------+
     | udca_fir~r   udca_fir~A |
     |-------------------------|
  1. |                       . |
  2. | 2020-04-15   15/04/2020 |
  3. |                       . |
  4. | 2021-09-10   10/09/2021 |
  5. |                       . |
     +-------------------------+
(500 missing values generated)

     +-------------------------+
     | udca_fir~y   udca_fi~yA |
     |-------------------------|
  1. |                       . |
  2. | 1991-09-30   30/09/1991 |
  3. |                       . |
  4. | 1992-05-01   01/05/1992 |
  5. |                       . |
     +-------------------------+
(500 missing values generated)

     +-------------------------+
     | died_dat~s   died_dat~A |
     |-------------------------|
  1. |                       . |
  2. | 2022-03-06   06/03/2022 |
  3. |                       . |
  4. |                       . |
  5. | 2022-12-14   14/12/2022 |
     +-------------------------+

. 
. /* DEMOGRAPHICS */ 
. 
. * Sex
. gen male = 1 if sex == "M"
(529 missing values generated)

. replace male = 0 if sex == "F"
(512 real changes made)

. 
. /*  Age variables  */ 
. 
. * Create categorised age
. recode age 18/39.9999 = 1 /// 
>            40/49.9999 = 2 ///
>                    50/59.9999 = 3 ///
>                60/69.9999 = 4 ///
>                    70/79.9999 = 5 ///
>                    80/max = 6, gen(agegroup) 
(760 differences between age and agegroup)

. 
. label define agegroup   1 "18-<40" ///
>                                                 2 "40-<50" ///
>                                                 3 "50-<60" ///
>                                                 4 "60-<70" ///
>                                                 5 "70-<80" ///
>                                                 6 "80+"

.                                                 
. label values agegroup agegroup

. 
. /* EXPOSURE INFORMATION ====================================================*
> /
. rename udca_last_date udca_date

. gen udca = 1 if udca_count != . & udca_count >= 2
(792 missing values generated)

. recode udca .=0
(udca: 792 changes made)

. 
. gen udca_sa = 1 if udca_count != . & udca_count >= 1 & udca_date != . & udca_
> date >= mdy(12,1,2019)
(946 missing values generated)

. recode udca_sa .=0
(udca_sa: 946 changes made)

. 
. tab1 udca udca_sa, m

-> tabulation of udca  

       udca |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        792       79.20       79.20
          1 |        208       20.80      100.00
------------+-----------------------------------
      Total |      1,000      100.00

-> tabulation of udca_sa  

    udca_sa |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        946       94.60       94.60
          1 |         54        5.40      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. tab udca udca_sa, m

           |        udca_sa
      udca |         0          1 |     Total
-----------+----------------------+----------
         0 |       781         11 |       792 
         1 |       165         43 |       208 
-----------+----------------------+----------
     Total |       946         54 |     1,000 

. 
. tab  udca_count udca, m

           |         udca
udca_count |         0          1 |     Total
-----------+----------------------+----------
        -2 |         2          0 |         2 
        -1 |         6          0 |         6 
         0 |       738          0 |       738 
         1 |        46          0 |        46 
         2 |         0         55 |        55 
         3 |         0         59 |        59 
         4 |         0         47 |        47 
         5 |         0         25 |        25 
         6 |         0         17 |        17 
         7 |         0          2 |         2 
         8 |         0          2 |         2 
         9 |         0          1 |         1 
-----------+----------------------+----------
     Total |       792        208 |     1,000 

. 
. * when was first udca Rx before index date
. gen udca_first = 0 if udca == 0
(208 missing values generated)

. replace udca_first = 1 if udca == 1 & udca_first_history >= mdy(9,1,2019) & u
> dca_first_history < mdy(3,1,2020) 
(0 real changes made)

. replace udca_first = 2 if udca == 1 & udca_first_history >= mdy(3,1,2019) & u
> dca_first_history < mdy(9,1,2019) 
(1 real change made)

. replace udca_first = 3 if udca == 1 & udca_first_history >= mdy(9,1,2018) & u
> dca_first_history < mdy(3,1,2019) 
(0 real changes made)

. replace udca_first = 4 if udca == 1 & udca_first_history >= mdy(9,1,2017) & u
> dca_first_history < mdy(9,1,2018) 
(1 real change made)

. replace udca_first = 5 if udca == 1 & udca_first_history >= mdy(9,1,2016) & u
> dca_first_history < mdy(9,1,2017) 
(0 real changes made)

. replace udca_first = 6 if udca == 1 & udca_first_history >= mdy(9,1,2015) & u
> dca_first_history < mdy(9,1,2016) 
(0 real changes made)

. replace udca_first = 7 if udca == 1 & udca_first_history >= mdy(9,1,2014) & u
> dca_first_history < mdy(9,1,2015) 
(0 real changes made)

. replace udca_first = 8 if udca == 1 &                                        
>                                      udca_first_history < mdy(9,1,2014) 
(109 real changes made)

. 
. label define udca_first         0 "unexposed"                                
>                            ///
>                                                 1 "within exposure window"   
>                                    ///
>                                                 2 "up to 6 mos before exposur
> e window"          ///
>                                                 3 "6 mos to 1 yr before expos
> ure window"        ///
>                                                 4 "1 to 2 yr before exposure 
> window"            ///
>                                                 5 "2 to 3 yr before exposure 
> window"            ///
>                                                 6 "3 to 4 yr before exposure 
> window"            ///
>                                                 7 "4 to 5 yr before exposure 
> window"            ///
>                                                 8 "5+ yr before exposure wind
> ow"

. label values udca_first udca_first

. 
. * Flag if died
. gen died_flag = died_date_onsA!=.

. * Generate date if died of covid
. gen died_date_onscovid = died_date_onsA if died_ons_covid_flag_any == 1
(749 missing values generated)

. 
. gen died_covid_2020 = (died_date_onscovid<date("31Dec2020", "DMY") & died_fla
> g==1)

. 
. **** Summary INFORMATION
. ** Currently dataset includes all people with at least one udca prescription
. * Tabulate pbc diagnosis vs those with 2+ prescriptions in 6 months prior
. tab has_pbc udca, m 

           |         udca
   has_pbc |         0          1 |     Total
-----------+----------------------+----------
         0 |       400        100 |       500 
         1 |       392        108 |       500 
-----------+----------------------+----------
     Total |       792        208 |     1,000 

. 
. * Tabulating time since first prescription by whether have 2+ prescriptions i
> n the last 6 months
. tab udca_first udca, m

                      |         udca
           udca_first |         0          1 |     Total
----------------------+----------------------+----------
            unexposed |       792          0 |       792 
up to 6 mos before ex |         0          1 |         1 
1 to 2 yr before expo |         0          1 |         1 
5+ yr before exposure |         0        109 |       109 
                    . |         0         97 |        97 
----------------------+----------------------+----------
                Total |       792        208 |     1,000 

. 
. bys udca: sum udca_count

-------------------------------------------------------------------------------
-> udca = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  udca_count |        792    .0454545    .2716332         -2          1

-------------------------------------------------------------------------------
-> udca = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  udca_count |        208      3.5625     1.40253          2          9


. 
. * How many COVID-19 deaths in those with pbc and 2+ prescriptions
. tab died_ons_covid_flag_any if has_pbc==1 & udca==1

died_ons_co |
vid_flag_an |
          y |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         57       52.78       52.78
          1 |         51       47.22      100.00
------------+-----------------------------------
      Total |        108      100.00

. tab died_covid_2020 if has_pbc==1 & udca==1

died_covid_ |
       2020 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         98       90.74       90.74
          1 |         10        9.26      100.00
------------+-----------------------------------
      Total |        108      100.00

. tab died_flag if has_pbc==1 & udca==1

  died_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         48       44.44       44.44
          1 |         60       55.56      100.00
------------+-----------------------------------
      Total |        108      100.00

. 
. * Summary demographics
. tab agegroup udca, col row m 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

 RECODE of |         udca
       age |         0          1 |     Total
-----------+----------------------+----------
         0 |        11          1 |        12 
           |     91.67       8.33 |    100.00 
           |      1.39       0.48 |      1.20 
-----------+----------------------+----------
    18-<40 |       238         63 |       301 
           |     79.07      20.93 |    100.00 
           |     30.05      30.29 |     30.10 
-----------+----------------------+----------
    40-<50 |        95         35 |       130 
           |     73.08      26.92 |    100.00 
           |     11.99      16.83 |     13.00 
-----------+----------------------+----------
    50-<60 |       127         24 |       151 
           |     84.11      15.89 |    100.00 
           |     16.04      11.54 |     15.10 
-----------+----------------------+----------
    60-<70 |        73         19 |        92 
           |     79.35      20.65 |    100.00 
           |      9.22       9.13 |      9.20 
-----------+----------------------+----------
    70-<80 |        79         18 |        97 
           |     81.44      18.56 |    100.00 
           |      9.97       8.65 |      9.70 
-----------+----------------------+----------
       80+ |        51         13 |        64 
           |     79.69      20.31 |    100.00 
           |      6.44       6.25 |      6.40 
-----------+----------------------+----------
         7 |        10          1 |        11 
           |     90.91       9.09 |    100.00 
           |      1.26       0.48 |      1.10 
-----------+----------------------+----------
         8 |         9          4 |        13 
           |     69.23      30.77 |    100.00 
           |      1.14       1.92 |      1.30 
-----------+----------------------+----------
         9 |        17          4 |        21 
           |     80.95      19.05 |    100.00 
           |      2.15       1.92 |      2.10 
-----------+----------------------+----------
        10 |        12          5 |        17 
           |     70.59      29.41 |    100.00 
           |      1.52       2.40 |      1.70 
-----------+----------------------+----------
        11 |        11          5 |        16 
           |     68.75      31.25 |    100.00 
           |      1.39       2.40 |      1.60 
-----------+----------------------+----------
        12 |         6          4 |        10 
           |     60.00      40.00 |    100.00 
           |      0.76       1.92 |      1.00 
-----------+----------------------+----------
        13 |         7          1 |         8 
           |     87.50      12.50 |    100.00 
           |      0.88       0.48 |      0.80 
-----------+----------------------+----------
        14 |        12          1 |        13 
           |     92.31       7.69 |    100.00 
           |      1.52       0.48 |      1.30 
-----------+----------------------+----------
        15 |        11          3 |        14 
           |     78.57      21.43 |    100.00 
           |      1.39       1.44 |      1.40 
-----------+----------------------+----------
        16 |        10          3 |        13 
           |     76.92      23.08 |    100.00 
           |      1.26       1.44 |      1.30 
-----------+----------------------+----------
        17 |        13          4 |        17 
           |     76.47      23.53 |    100.00 
           |      1.64       1.92 |      1.70 
-----------+----------------------+----------
     Total |       792        208 |     1,000 
           |     79.20      20.80 |    100.00 
           |    100.00     100.00 |    100.00 

. tab sex udca, col row m 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

           |         udca
       sex |         0          1 |     Total
-----------+----------------------+----------
         F |       404        108 |       512 
           |     78.91      21.09 |    100.00 
           |     51.01      51.92 |     51.20 
-----------+----------------------+----------
         M |       372         99 |       471 
           |     78.98      21.02 |    100.00 
           |     46.97      47.60 |     47.10 
-----------+----------------------+----------
         U |        16          1 |        17 
           |     94.12       5.88 |    100.00 
           |      2.02       0.48 |      1.70 
-----------+----------------------+----------
     Total |       792        208 |     1,000 
           |     79.20      20.80 |    100.00 
           |    100.00     100.00 |    100.00 

. 
. ** Next import the PBC population
. 
. import delimited using ./output/input_pbc.csv, clear
(12 vars, 1,000 obs)

. 
. * Format dates 
. foreach var in udca_last_date udca_first_after udca_first_history died_date_o
> ns {
  2.     gen `var'A = date(`var', "YMD")
  3.     format `var'A %dD/N/CY
  4.     list `var' `var'A in  1/5
  5.     drop `var'
  6. }
(500 missing values generated)

     +-------------------------+
     | udca_las~e   udca_las~A |
     |-------------------------|
  1. | 2019-11-19   19/11/2019 |
  2. |                       . |
  3. |                       . |
  4. | 2019-10-17   17/10/2019 |
  5. |                       . |
     +-------------------------+
(500 missing values generated)

     +-------------------------+
     | udca_fir~r   udca_fir~A |
     |-------------------------|
  1. | 2022-02-02   02/02/2022 |
  2. |                       . |
  3. |                       . |
  4. | 2020-12-17   17/12/2020 |
  5. |                       . |
     +-------------------------+
(500 missing values generated)

     +-------------------------+
     | udca_fir~y   udca_fi~yA |
     |-------------------------|
  1. |                       . |
  2. |                       . |
  3. |                       . |
  4. | 1925-05-04   04/05/1925 |
  5. | 1903-11-03   03/11/1903 |
     +-------------------------+
(500 missing values generated)

     +-------------------------+
     | died_dat~s   died_dat~A |
     |-------------------------|
  1. | 2020-11-19   19/11/2020 |
  2. |                       . |
  3. |                       . |
  4. |                       . |
  5. |                       . |
     +-------------------------+

. 
. /* DEMOGRAPHICS */ 
. 
. * Sex
. gen male = 1 if sex == "M"
(527 missing values generated)

. replace male = 0 if sex == "F"
(517 real changes made)

. 
. /*  Age variables  */ 
. 
. * Create categorised age
. recode age 18/39.9999 = 1 /// 
>            40/49.9999 = 2 ///
>                    50/59.9999 = 3 ///
>                60/69.9999 = 4 ///
>                    70/79.9999 = 5 ///
>                    80/max = 6, gen(agegroup) 
(807 differences between age and agegroup)

. 
. label define agegroup   1 "18-<40" ///
>                                                 2 "40-<50" ///
>                                                 3 "50-<60" ///
>                                                 4 "60-<70" ///
>                                                 5 "70-<80" ///
>                                                 6 "80+"

.                                                 
. label values agegroup agegroup

. 
. /* EXPOSURE INFORMATION ====================================================*
> /
. rename udca_last_date udca_date

. gen udca = 1 if udca_count != . & udca_count >= 2
(798 missing values generated)

. recode udca .=0
(udca: 798 changes made)

. 
. gen udca_sa = 1 if udca_count != . & udca_count >= 1 & udca_date != . & udca_
> date >= mdy(12,1,2019)
(939 missing values generated)

. recode udca_sa .=0
(udca_sa: 939 changes made)

. 
. tab1 udca udca_sa, m

-> tabulation of udca  

       udca |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        798       79.80       79.80
          1 |        202       20.20      100.00
------------+-----------------------------------
      Total |      1,000      100.00

-> tabulation of udca_sa  

    udca_sa |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        939       93.90       93.90
          1 |         61        6.10      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. tab udca udca_sa, m

           |        udca_sa
      udca |         0          1 |     Total
-----------+----------------------+----------
         0 |       786         12 |       798 
         1 |       153         49 |       202 
-----------+----------------------+----------
     Total |       939         61 |     1,000 

. 
. tab  udca_count udca, m

           |         udca
udca_count |         0          1 |     Total
-----------+----------------------+----------
        -3 |         1          0 |         1 
        -2 |         1          0 |         1 
        -1 |         3          0 |         3 
         0 |       738          0 |       738 
         1 |        55          0 |        55 
         2 |         0         59 |        59 
         3 |         0         48 |        48 
         4 |         0         53 |        53 
         5 |         0         22 |        22 
         6 |         0         14 |        14 
         7 |         0          4 |         4 
         8 |         0          2 |         2 
-----------+----------------------+----------
     Total |       798        202 |     1,000 

. 
. * when was first udca Rx before index date
. gen udca_first = 0 if udca == 0
(202 missing values generated)

. replace udca_first = 1 if udca == 1 & udca_first_history >= mdy(9,1,2019) & u
> dca_first_history < mdy(3,1,2020) 
(0 real changes made)

. replace udca_first = 2 if udca == 1 & udca_first_history >= mdy(3,1,2019) & u
> dca_first_history < mdy(9,1,2019) 
(2 real changes made)

. replace udca_first = 3 if udca == 1 & udca_first_history >= mdy(9,1,2018) & u
> dca_first_history < mdy(3,1,2019) 
(1 real change made)

. replace udca_first = 4 if udca == 1 & udca_first_history >= mdy(9,1,2017) & u
> dca_first_history < mdy(9,1,2018) 
(2 real changes made)

. replace udca_first = 5 if udca == 1 & udca_first_history >= mdy(9,1,2016) & u
> dca_first_history < mdy(9,1,2017) 
(1 real change made)

. replace udca_first = 6 if udca == 1 & udca_first_history >= mdy(9,1,2015) & u
> dca_first_history < mdy(9,1,2016) 
(1 real change made)

. replace udca_first = 7 if udca == 1 & udca_first_history >= mdy(9,1,2014) & u
> dca_first_history < mdy(9,1,2015) 
(1 real change made)

. replace udca_first = 8 if udca == 1 &                                        
>                                      udca_first_history < mdy(9,1,2014) 
(94 real changes made)

. 
. label define udca_first         0 "unexposed"                                
>                            ///
>                                                 1 "within exposure window"   
>                                    ///
>                                                 2 "up to 6 mos before exposur
> e window"          ///
>                                                 3 "6 mos to 1 yr before expos
> ure window"        ///
>                                                 4 "1 to 2 yr before exposure 
> window"            ///
>                                                 5 "2 to 3 yr before exposure 
> window"            ///
>                                                 6 "3 to 4 yr before exposure 
> window"            ///
>                                                 7 "4 to 5 yr before exposure 
> window"            ///
>                                                 8 "5+ yr before exposure wind
> ow"

. label values udca_first udca_first

. 
. * Flag if died
. gen died_flag = died_date_onsA!=.

. * Generate date if died of covid
. gen died_date_onscovid = died_date_onsA if died_ons_covid_flag_any == 1
(752 missing values generated)

. gen died_covid_2020 = (died_date_onscovid<date("31Dec2020", "DMY") & died_fla
> g==1)

. 
. **** Summary INFORMATION
. ** Currently dataset includes all people with a pbc diagnosis, how many have 
> 2+ udca prescription
. * Tabulate pbc diagnosis vs those with 2+ prescriptions in 6 months prior
. tab udca, m 

       udca |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        798       79.80       79.80
          1 |        202       20.20      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. 
. * Tabulating time since first prescription by whether have 2+ prescriptions i
> n the last 6 months
. tab udca_first udca, m

                      |         udca
           udca_first |         0          1 |     Total
----------------------+----------------------+----------
            unexposed |       798          0 |       798 
up to 6 mos before ex |         0          2 |         2 
6 mos to 1 yr before  |         0          1 |         1 
1 to 2 yr before expo |         0          2 |         2 
2 to 3 yr before expo |         0          1 |         1 
3 to 4 yr before expo |         0          1 |         1 
4 to 5 yr before expo |         0          1 |         1 
5+ yr before exposure |         0         94 |        94 
                    . |         0        100 |       100 
----------------------+----------------------+----------
                Total |       798        202 |     1,000 

. 
. * Check number of prescriptions
. bys udca: sum udca_count

-------------------------------------------------------------------------------
-> udca = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  udca_count |        798    .0588972    .2925933         -3          1

-------------------------------------------------------------------------------
-> udca = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  udca_count |        202    3.524752    1.382866          2          8


. 
. * How many COVID-19 deaths by whether had 2+ prescriptions
. tab died_ons_covid_flag_any udca

died_ons_c |
ovid_flag_ |         udca
       any |         0          1 |     Total
-----------+----------------------+----------
         0 |       397        103 |       500 
         1 |       401         99 |       500 
-----------+----------------------+----------
     Total |       798        202 |     1,000 

. tab died_covid_2020 if has_pbc==1 & udca==1

died_covid_ |
       2020 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         94       94.95       94.95
          1 |          5        5.05      100.00
------------+-----------------------------------
      Total |         99      100.00

. tab died_flag if has_pbc==1 & udca==1

  died_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         49       49.49       49.49
          1 |         50       50.51      100.00
------------+-----------------------------------
      Total |         99      100.00

. 
. 
. * Summary demographics
. tab agegroup udca, col row m 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

 RECODE of |         udca
       age |         0          1 |     Total
-----------+----------------------+----------
         0 |        11          0 |        11 
           |    100.00       0.00 |    100.00 
           |      1.38       0.00 |      1.10 
-----------+----------------------+----------
    18-<40 |       245         64 |       309 
           |     79.29      20.71 |    100.00 
           |     30.70      31.68 |     30.90 
-----------+----------------------+----------
    40-<50 |       117         26 |       143 
           |     81.82      18.18 |    100.00 
           |     14.66      12.87 |     14.30 
-----------+----------------------+----------
    50-<60 |       112         29 |       141 
           |     79.43      20.57 |    100.00 
           |     14.04      14.36 |     14.10 
-----------+----------------------+----------
    60-<70 |        88         33 |       121 
           |     72.73      27.27 |    100.00 
           |     11.03      16.34 |     12.10 
-----------+----------------------+----------
    70-<80 |        86         19 |       105 
           |     81.90      18.10 |    100.00 
           |     10.78       9.41 |     10.50 
-----------+----------------------+----------
       80+ |        49          9 |        58 
           |     84.48      15.52 |    100.00 
           |      6.14       4.46 |      5.80 
-----------+----------------------+----------
         7 |         5          0 |         5 
           |    100.00       0.00 |    100.00 
           |      0.63       0.00 |      0.50 
-----------+----------------------+----------
         8 |         6          3 |         9 
           |     66.67      33.33 |    100.00 
           |      0.75       1.49 |      0.90 
-----------+----------------------+----------
         9 |         7          2 |         9 
           |     77.78      22.22 |    100.00 
           |      0.88       0.99 |      0.90 
-----------+----------------------+----------
        10 |        12          3 |        15 
           |     80.00      20.00 |    100.00 
           |      1.50       1.49 |      1.50 
-----------+----------------------+----------
        11 |        11          2 |        13 
           |     84.62      15.38 |    100.00 
           |      1.38       0.99 |      1.30 
-----------+----------------------+----------
        12 |         8          4 |        12 
           |     66.67      33.33 |    100.00 
           |      1.00       1.98 |      1.20 
-----------+----------------------+----------
        13 |         9          1 |        10 
           |     90.00      10.00 |    100.00 
           |      1.13       0.50 |      1.00 
-----------+----------------------+----------
        14 |         6          3 |         9 
           |     66.67      33.33 |    100.00 
           |      0.75       1.49 |      0.90 
-----------+----------------------+----------
        15 |         6          2 |         8 
           |     75.00      25.00 |    100.00 
           |      0.75       0.99 |      0.80 
-----------+----------------------+----------
        16 |         9          1 |        10 
           |     90.00      10.00 |    100.00 
           |      1.13       0.50 |      1.00 
-----------+----------------------+----------
        17 |        11          1 |        12 
           |     91.67       8.33 |    100.00 
           |      1.38       0.50 |      1.20 
-----------+----------------------+----------
     Total |       798        202 |     1,000 
           |     79.80      20.20 |    100.00 
           |    100.00     100.00 |    100.00 

. tab sex udca, col row m 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

           |         udca
       sex |         0          1 |     Total
-----------+----------------------+----------
         F |       422         95 |       517 
           |     81.62      18.38 |    100.00 
           |     52.88      47.03 |     51.70 
-----------+----------------------+----------
         M |       368        105 |       473 
           |     77.80      22.20 |    100.00 
           |     46.12      51.98 |     47.30 
-----------+----------------------+----------
         U |         8          2 |        10 
           |     80.00      20.00 |    100.00 
           |      1.00       0.99 |      1.00 
-----------+----------------------+----------
     Total |       798        202 |     1,000 
           |     79.80      20.20 |    100.00 
           |    100.00     100.00 |    100.00 

. 
. 
. 
. 
. 
end of do-file

. . file open output using "/tmp/feasibility.do.LjMS.out", write text replace

. . file write output "success" 

. . file close output

. 
end of do-file


