
. 
. ** First import udca population
. import delimited using ./output/input.csv
(12 vars, 1,000 obs)

. 
. * Format dates 
. foreach var in udca_last_date udca_first_after udca_first_history died_date_o
> ns {
  2.     gen `var'A = date(`var', "YMD")
  3.     format `var'A %dD/N/CY
  4.     *list `var' `var'A in  1/5
.     drop `var'
  5. }
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)

. 
. /* DEMOGRAPHICS */ 
. 
. * Sex
. gen male = 1 if sex == "M"
(529 missing values generated)

. replace male = 0 if sex == "F"
(512 real changes made)

. 
. /*  Age variables  */ 
. 
. * Create categorised age
. recode age 18/39.9999 = 1 /// 
>            40/49.9999 = 2 ///
>                    50/59.9999 = 3 ///
>                60/69.9999 = 4 ///
>                    70/79.9999 = 5 ///
>                    80/max = 6, gen(agegroup) 
(760 differences between age and agegroup)

. 
. label define agegroup   1 "18-<40" ///
>                                                 2 "40-<50" ///
>                                                 3 "50-<60" ///
>                                                 4 "60-<70" ///
>                                                 5 "70-<80" ///
>                                                 6 "80+"

.                                                 
. label values agegroup agegroup

. 
. /* EXPOSURE INFORMATION ====================================================*
> /
. rename udca_last_date udca_date

. gen udca = 1 if udca_count != . & udca_count >= 2
(792 missing values generated)

. recode udca .=0
(udca: 792 changes made)

. 
. gen udca_sa = 1 if udca_count != . & udca_count >= 1 & udca_date != . & udca_
> date >= mdy(12,1,2019)
(946 missing values generated)

. recode udca_sa .=0
(udca_sa: 946 changes made)

. 
. tab1 udca udca_sa, m

-> tabulation of udca  

       udca |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        792       79.20       79.20
          1 |        208       20.80      100.00
------------+-----------------------------------
      Total |      1,000      100.00

-> tabulation of udca_sa  

    udca_sa |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        946       94.60       94.60
          1 |         54        5.40      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. tab udca udca_sa, m

           |        udca_sa
      udca |         0          1 |     Total
-----------+----------------------+----------
         0 |       781         11 |       792 
         1 |       165         43 |       208 
-----------+----------------------+----------
     Total |       946         54 |     1,000 

. 
. *tab  udca_count udca, m
. 
. * when was first udca Rx before index date
. gen udca_first = 0 if udca == 0
(208 missing values generated)

. replace udca_first = 1 if udca == 1 & udca_first_history >= mdy(9,1,2019) & u
> dca_first_history < mdy(3,1,2020) 
(0 real changes made)

. replace udca_first = 2 if udca == 1 & udca_first_history >= mdy(3,1,2019) & u
> dca_first_history < mdy(9,1,2019) 
(1 real change made)

. replace udca_first = 3 if udca == 1 & udca_first_history >= mdy(9,1,2018) & u
> dca_first_history < mdy(3,1,2019) 
(0 real changes made)

. replace udca_first = 4 if udca == 1 & udca_first_history >= mdy(9,1,2017) & u
> dca_first_history < mdy(9,1,2018) 
(1 real change made)

. replace udca_first = 5 if udca == 1 & udca_first_history >= mdy(9,1,2016) & u
> dca_first_history < mdy(9,1,2017) 
(0 real changes made)

. replace udca_first = 6 if udca == 1 & udca_first_history >= mdy(9,1,2015) & u
> dca_first_history < mdy(9,1,2016) 
(0 real changes made)

. replace udca_first = 7 if udca == 1 & udca_first_history >= mdy(9,1,2014) & u
> dca_first_history < mdy(9,1,2015) 
(0 real changes made)

. replace udca_first = 8 if udca == 1 &                                        
>                                      udca_first_history < mdy(9,1,2014) 
(109 real changes made)

. 
. label define udca_first         0 "unexposed"                                
>                            ///
>                                                 1 "within exposure window"   
>                                    ///
>                                                 2 "up to 6 mos before exposur
> e window"          ///
>                                                 3 "6 mos to 1 yr before expos
> ure window"        ///
>                                                 4 "1 to 2 yr before exposure 
> window"            ///
>                                                 5 "2 to 3 yr before exposure 
> window"            ///
>                                                 6 "3 to 4 yr before exposure 
> window"            ///
>                                                 7 "4 to 5 yr before exposure 
> window"            ///
>                                                 8 "5+ yr before exposure wind
> ow"

. label values udca_first udca_first

. 
. * Flag if died
. gen died_flag = died_date_onsA!=.

. * Generate date if died of covid
. gen died_date_onscovid = died_date_onsA if died_ons_covid_flag_any == 1
(749 missing values generated)

. 
. gen died_covid_2020 = (died_date_onscovid<date("31Dec2020", "DMY") & died_fla
> g==1)

. 
. **** Summary INFORMATION
. ** Currently dataset includes all people with at least one udca prescription
. * Tabulate pbc diagnosis vs those with 2+ prescriptions in 6 months prior
. tab has_pbc udca, m 

           |         udca
   has_pbc |         0          1 |     Total
-----------+----------------------+----------
         0 |       400        100 |       500 
         1 |       392        108 |       500 
-----------+----------------------+----------
     Total |       792        208 |     1,000 

. 
. * Tabulating time since first prescription by whether have 2+ prescriptions i
> n the last 6 months
. tab udca_first udca, m

                      |         udca
           udca_first |         0          1 |     Total
----------------------+----------------------+----------
            unexposed |       792          0 |       792 
up to 6 mos before ex |         0          1 |         1 
1 to 2 yr before expo |         0          1 |         1 
5+ yr before exposure |         0        109 |       109 
                    . |         0         97 |        97 
----------------------+----------------------+----------
                Total |       792        208 |     1,000 

. 
. bys udca: sum udca_count

-------------------------------------------------------------------------------
-> udca = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  udca_count |        792    .0454545    .2716332         -2          1

-------------------------------------------------------------------------------
-> udca = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  udca_count |        208      3.5625     1.40253          2          9


. 
. * How many COVID-19 deaths in those with pbc and 2+ prescriptions
. tab died_ons_covid_flag_any has_pbc if udca==1

died_ons_c |
ovid_flag_ |        has_pbc
       any |         0          1 |     Total
-----------+----------------------+----------
         0 |        45         57 |       102 
         1 |        55         51 |       106 
-----------+----------------------+----------
     Total |       100        108 |       208 

. tab died_covid_2020 has_pbc if udca==1

died_covid |        has_pbc
     _2020 |         0          1 |     Total
-----------+----------------------+----------
         0 |        92         98 |       190 
         1 |         8         10 |        18 
-----------+----------------------+----------
     Total |       100        108 |       208 

. tab died_flag has_pbc if udca==1

           |        has_pbc
 died_flag |         0          1 |     Total
-----------+----------------------+----------
         0 |        49         48 |        97 
         1 |        51         60 |       111 
-----------+----------------------+----------
     Total |       100        108 |       208 

. 
. * Summary demographics
. tab agegroup has_pbc if udca==1, col row m 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

 RECODE of |        has_pbc
       age |         0          1 |     Total
-----------+----------------------+----------
         0 |         1          0 |         1 
           |    100.00       0.00 |    100.00 
           |      1.00       0.00 |      0.48 
-----------+----------------------+----------
    18-<40 |        38         25 |        63 
           |     60.32      39.68 |    100.00 
           |     38.00      23.15 |     30.29 
-----------+----------------------+----------
    40-<50 |        15         20 |        35 
           |     42.86      57.14 |    100.00 
           |     15.00      18.52 |     16.83 
-----------+----------------------+----------
    50-<60 |         9         15 |        24 
           |     37.50      62.50 |    100.00 
           |      9.00      13.89 |     11.54 
-----------+----------------------+----------
    60-<70 |         8         11 |        19 
           |     42.11      57.89 |    100.00 
           |      8.00      10.19 |      9.13 
-----------+----------------------+----------
    70-<80 |         7         11 |        18 
           |     38.89      61.11 |    100.00 
           |      7.00      10.19 |      8.65 
-----------+----------------------+----------
       80+ |         7          6 |        13 
           |     53.85      46.15 |    100.00 
           |      7.00       5.56 |      6.25 
-----------+----------------------+----------
         7 |         1          0 |         1 
           |    100.00       0.00 |    100.00 
           |      1.00       0.00 |      0.48 
-----------+----------------------+----------
         8 |         1          3 |         4 
           |     25.00      75.00 |    100.00 
           |      1.00       2.78 |      1.92 
-----------+----------------------+----------
         9 |         1          3 |         4 
           |     25.00      75.00 |    100.00 
           |      1.00       2.78 |      1.92 
-----------+----------------------+----------
        10 |         2          3 |         5 
           |     40.00      60.00 |    100.00 
           |      2.00       2.78 |      2.40 
-----------+----------------------+----------
        11 |         3          2 |         5 
           |     60.00      40.00 |    100.00 
           |      3.00       1.85 |      2.40 
-----------+----------------------+----------
        12 |         2          2 |         4 
           |     50.00      50.00 |    100.00 
           |      2.00       1.85 |      1.92 
-----------+----------------------+----------
        13 |         0          1 |         1 
           |      0.00     100.00 |    100.00 
           |      0.00       0.93 |      0.48 
-----------+----------------------+----------
        14 |         1          0 |         1 
           |    100.00       0.00 |    100.00 
           |      1.00       0.00 |      0.48 
-----------+----------------------+----------
        15 |         1          2 |         3 
           |     33.33      66.67 |    100.00 
           |      1.00       1.85 |      1.44 
-----------+----------------------+----------
        16 |         2          1 |         3 
           |     66.67      33.33 |    100.00 
           |      2.00       0.93 |      1.44 
-----------+----------------------+----------
        17 |         1          3 |         4 
           |     25.00      75.00 |    100.00 
           |      1.00       2.78 |      1.92 
-----------+----------------------+----------
     Total |       100        108 |       208 
           |     48.08      51.92 |    100.00 
           |    100.00     100.00 |    100.00 

. tab sex has_pbc if udca==1, col row m 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

           |        has_pbc
       sex |         0          1 |     Total
-----------+----------------------+----------
         F |        57         51 |       108 
           |     52.78      47.22 |    100.00 
           |     57.00      47.22 |     51.92 
-----------+----------------------+----------
         M |        43         56 |        99 
           |     43.43      56.57 |    100.00 
           |     43.00      51.85 |     47.60 
-----------+----------------------+----------
         U |         0          1 |         1 
           |      0.00     100.00 |    100.00 
           |      0.00       0.93 |      0.48 
-----------+----------------------+----------
     Total |       100        108 |       208 
           |     48.08      51.92 |    100.00 
           |    100.00     100.00 |    100.00 

. 
. ** Next import the PBC population
. 
. import delimited using ./output/input_pbc.csv, clear
(12 vars, 1,000 obs)

. 
. * Format dates 
. foreach var in udca_last_date udca_first_after udca_first_history died_date_o
> ns {
  2.     gen `var'A = date(`var', "YMD")
  3.     format `var'A %dD/N/CY
  4.     *list `var' `var'A in  1/5
.     drop `var'
  5. }
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)

. 
. /* DEMOGRAPHICS */ 
. 
. * Sex
. gen male = 1 if sex == "M"
(527 missing values generated)

. replace male = 0 if sex == "F"
(517 real changes made)

. 
. /*  Age variables  */ 
. 
. * Create categorised age
. recode age 18/39.9999 = 1 /// 
>            40/49.9999 = 2 ///
>                    50/59.9999 = 3 ///
>                60/69.9999 = 4 ///
>                    70/79.9999 = 5 ///
>                    80/max = 6, gen(agegroup) 
(807 differences between age and agegroup)

. 
. label define agegroup   1 "18-<40" ///
>                                                 2 "40-<50" ///
>                                                 3 "50-<60" ///
>                                                 4 "60-<70" ///
>                                                 5 "70-<80" ///
>                                                 6 "80+"

.                                                 
. label values agegroup agegroup

. 
. /* EXPOSURE INFORMATION ====================================================*
> /
. rename udca_last_date udca_date

. gen udca = 1 if udca_count != . & udca_count >= 2
(798 missing values generated)

. recode udca .=0
(udca: 798 changes made)

. 
. gen udca_sa = 1 if udca_count != . & udca_count >= 1 & udca_date != . & udca_
> date >= mdy(12,1,2019)
(939 missing values generated)

. recode udca_sa .=0
(udca_sa: 939 changes made)

. 
. tab1 udca udca_sa, m

-> tabulation of udca  

       udca |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        798       79.80       79.80
          1 |        202       20.20      100.00
------------+-----------------------------------
      Total |      1,000      100.00

-> tabulation of udca_sa  

    udca_sa |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        939       93.90       93.90
          1 |         61        6.10      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. tab udca udca_sa, m

           |        udca_sa
      udca |         0          1 |     Total
-----------+----------------------+----------
         0 |       786         12 |       798 
         1 |       153         49 |       202 
-----------+----------------------+----------
     Total |       939         61 |     1,000 

. 
. *tab  udca_count udca, m
. 
. * when was first udca Rx before index date
. gen udca_first = 0 if udca == 0
(202 missing values generated)

. replace udca_first = 1 if udca == 1 & udca_first_history >= mdy(9,1,2019) & u
> dca_first_history < mdy(3,1,2020) 
(0 real changes made)

. replace udca_first = 2 if udca == 1 & udca_first_history >= mdy(3,1,2019) & u
> dca_first_history < mdy(9,1,2019) 
(2 real changes made)

. replace udca_first = 3 if udca == 1 & udca_first_history >= mdy(9,1,2018) & u
> dca_first_history < mdy(3,1,2019) 
(1 real change made)

. replace udca_first = 4 if udca == 1 & udca_first_history >= mdy(9,1,2017) & u
> dca_first_history < mdy(9,1,2018) 
(2 real changes made)

. replace udca_first = 5 if udca == 1 & udca_first_history >= mdy(9,1,2016) & u
> dca_first_history < mdy(9,1,2017) 
(1 real change made)

. replace udca_first = 6 if udca == 1 & udca_first_history >= mdy(9,1,2015) & u
> dca_first_history < mdy(9,1,2016) 
(1 real change made)

. replace udca_first = 7 if udca == 1 & udca_first_history >= mdy(9,1,2014) & u
> dca_first_history < mdy(9,1,2015) 
(1 real change made)

. replace udca_first = 8 if udca == 1 &                                        
>                                      udca_first_history < mdy(9,1,2014) 
(94 real changes made)

. 
. label define udca_first         0 "unexposed"                                
>                            ///
>                                                 1 "within exposure window"   
>                                    ///
>                                                 2 "up to 6 mos before exposur
> e window"          ///
>                                                 3 "6 mos to 1 yr before expos
> ure window"        ///
>                                                 4 "1 to 2 yr before exposure 
> window"            ///
>                                                 5 "2 to 3 yr before exposure 
> window"            ///
>                                                 6 "3 to 4 yr before exposure 
> window"            ///
>                                                 7 "4 to 5 yr before exposure 
> window"            ///
>                                                 8 "5+ yr before exposure wind
> ow"

. label values udca_first udca_first

. 
. * Flag if died
. gen died_flag = died_date_onsA!=.

. * Generate date if died of covid
. gen died_date_onscovid = died_date_onsA if died_ons_covid_flag_any == 1
(752 missing values generated)

. gen died_covid_2020 = (died_date_onscovid<date("31Dec2020", "DMY") & died_fla
> g==1)

. 
. **** Summary INFORMATION
. ** Currently dataset includes all people with a pbc diagnosis, how many have 
> 2+ udca prescription
. * Tabulate pbc diagnosis vs those with 2+ prescriptions in 6 months prior
. tab udca, m 

       udca |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        798       79.80       79.80
          1 |        202       20.20      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. 
. * Tabulating time since first prescription by whether have 2+ prescriptions i
> n the last 6 months
. tab udca_first udca, m

                      |         udca
           udca_first |         0          1 |     Total
----------------------+----------------------+----------
            unexposed |       798          0 |       798 
up to 6 mos before ex |         0          2 |         2 
6 mos to 1 yr before  |         0          1 |         1 
1 to 2 yr before expo |         0          2 |         2 
2 to 3 yr before expo |         0          1 |         1 
3 to 4 yr before expo |         0          1 |         1 
4 to 5 yr before expo |         0          1 |         1 
5+ yr before exposure |         0         94 |        94 
                    . |         0        100 |       100 
----------------------+----------------------+----------
                Total |       798        202 |     1,000 

. 
. * Check number of prescriptions
. bys udca: sum udca_count

-------------------------------------------------------------------------------
-> udca = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  udca_count |        798    .0588972    .2925933         -3          1

-------------------------------------------------------------------------------
-> udca = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  udca_count |        202    3.524752    1.382866          2          8


. 
. * How many COVID-19 deaths by whether had 2+ prescriptions
. tab died_ons_covid_flag_any udca

died_ons_c |
ovid_flag_ |         udca
       any |         0          1 |     Total
-----------+----------------------+----------
         0 |       397        103 |       500 
         1 |       401         99 |       500 
-----------+----------------------+----------
     Total |       798        202 |     1,000 

. tab died_covid_2020 if has_pbc==1 & udca==1

died_covid_ |
       2020 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         94       94.95       94.95
          1 |          5        5.05      100.00
------------+-----------------------------------
      Total |         99      100.00

. tab died_flag if has_pbc==1 & udca==1

  died_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         49       49.49       49.49
          1 |         50       50.51      100.00
------------+-----------------------------------
      Total |         99      100.00

. 
. 
. * Summary demographics
. tab agegroup udca, col row m 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

 RECODE of |         udca
       age |         0          1 |     Total
-----------+----------------------+----------
         0 |        11          0 |        11 
           |    100.00       0.00 |    100.00 
           |      1.38       0.00 |      1.10 
-----------+----------------------+----------
    18-<40 |       245         64 |       309 
           |     79.29      20.71 |    100.00 
           |     30.70      31.68 |     30.90 
-----------+----------------------+----------
    40-<50 |       117         26 |       143 
           |     81.82      18.18 |    100.00 
           |     14.66      12.87 |     14.30 
-----------+----------------------+----------
    50-<60 |       112         29 |       141 
           |     79.43      20.57 |    100.00 
           |     14.04      14.36 |     14.10 
-----------+----------------------+----------
    60-<70 |        88         33 |       121 
           |     72.73      27.27 |    100.00 
           |     11.03      16.34 |     12.10 
-----------+----------------------+----------
    70-<80 |        86         19 |       105 
           |     81.90      18.10 |    100.00 
           |     10.78       9.41 |     10.50 
-----------+----------------------+----------
       80+ |        49          9 |        58 
           |     84.48      15.52 |    100.00 
           |      6.14       4.46 |      5.80 
-----------+----------------------+----------
         7 |         5          0 |         5 
           |    100.00       0.00 |    100.00 
           |      0.63       0.00 |      0.50 
-----------+----------------------+----------
         8 |         6          3 |         9 
           |     66.67      33.33 |    100.00 
           |      0.75       1.49 |      0.90 
-----------+----------------------+----------
         9 |         7          2 |         9 
           |     77.78      22.22 |    100.00 
           |      0.88       0.99 |      0.90 
-----------+----------------------+----------
        10 |        12          3 |        15 
           |     80.00      20.00 |    100.00 
           |      1.50       1.49 |      1.50 
-----------+----------------------+----------
        11 |        11          2 |        13 
           |     84.62      15.38 |    100.00 
           |      1.38       0.99 |      1.30 
-----------+----------------------+----------
        12 |         8          4 |        12 
           |     66.67      33.33 |    100.00 
           |      1.00       1.98 |      1.20 
-----------+----------------------+----------
        13 |         9          1 |        10 
           |     90.00      10.00 |    100.00 
           |      1.13       0.50 |      1.00 
-----------+----------------------+----------
        14 |         6          3 |         9 
           |     66.67      33.33 |    100.00 
           |      0.75       1.49 |      0.90 
-----------+----------------------+----------
        15 |         6          2 |         8 
           |     75.00      25.00 |    100.00 
           |      0.75       0.99 |      0.80 
-----------+----------------------+----------
        16 |         9          1 |        10 
           |     90.00      10.00 |    100.00 
           |      1.13       0.50 |      1.00 
-----------+----------------------+----------
        17 |        11          1 |        12 
           |     91.67       8.33 |    100.00 
           |      1.38       0.50 |      1.20 
-----------+----------------------+----------
     Total |       798        202 |     1,000 
           |     79.80      20.20 |    100.00 
           |    100.00     100.00 |    100.00 

. tab sex udca, col row m 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

           |         udca
       sex |         0          1 |     Total
-----------+----------------------+----------
         F |       422         95 |       517 
           |     81.62      18.38 |    100.00 
           |     52.88      47.03 |     51.70 
-----------+----------------------+----------
         M |       368        105 |       473 
           |     77.80      22.20 |    100.00 
           |     46.12      51.98 |     47.30 
-----------+----------------------+----------
         U |         8          2 |        10 
           |     80.00      20.00 |    100.00 
           |      1.00       0.99 |      1.00 
-----------+----------------------+----------
     Total |       798        202 |     1,000 
           |     79.80      20.20 |    100.00 
           |    100.00     100.00 |    100.00 

. 
. 
. 
. 
. 
end of do-file

. . file open output using "/tmp/feasibility.do.SdSW.out", write text replace

. . file write output "success" 

. . file close output

. 
end of do-file


