
. 
. cap mkdir ./output/tables/

. 
. ** First import udca population
. import delimited using ./output/input.csv
(12 vars, 1,000 obs)

. 
. * Format dates 
. foreach var in udca_last_date udca_first_after udca_first_history died_date_o
> ns {
  2.     gen `var'A = date(`var', "YMD")
  3.     format `var'A %dD/N/CY
  4.     *list `var' `var'A in  1/5
.     drop `var'
  5. }
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)

. 
. /* DEMOGRAPHICS */ 
. 
. * Sex
. gen male = 1 if sex == "M"
(512 missing values generated)

. replace male = 0 if sex == "F"
(508 real changes made)

. 
. /*  Age variables  */ 
. 
. * Create categorised age
. recode age 18/39.9999 = 1 /// 
>            40/49.9999 = 2 ///
>                    50/59.9999 = 3 ///
>                60/69.9999 = 4 ///
>                    70/79.9999 = 5 ///
>                    80/max = 6, gen(agegroup) 
(781 differences between age and agegroup)

. 
. label define agegroup   1 "18-<40" ///
>                                                 2 "40-<50" ///
>                                                 3 "50-<60" ///
>                                                 4 "60-<70" ///
>                                                 5 "70-<80" ///
>                                                 6 "80+"

.                                                 
. label values agegroup agegroup

. 
. /* EXPOSURE INFORMATION ====================================================*
> /
. rename udca_last_date udca_date

. gen udca = 1 if udca_count != . & udca_count >= 2
(796 missing values generated)

. recode udca .=0
(udca: 796 changes made)

. 
. gen udca_sa = 1 if udca_count != . & udca_count >= 1 & udca_date != . & udca_
> date >= mdy(12,1,2019)
(934 missing values generated)

. recode udca_sa .=0
(udca_sa: 934 changes made)

. 
. tab1 udca udca_sa, m

-> tabulation of udca  

       udca |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        796       79.60       79.60
          1 |        204       20.40      100.00
------------+-----------------------------------
      Total |      1,000      100.00

-> tabulation of udca_sa  

    udca_sa |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        934       93.40       93.40
          1 |         66        6.60      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. tab udca udca_sa, m

           |        udca_sa
      udca |         0          1 |     Total
-----------+----------------------+----------
         0 |       785         11 |       796 
         1 |       149         55 |       204 
-----------+----------------------+----------
     Total |       934         66 |     1,000 

. 
. *tab  udca_count udca, m
. 
. * when was first udca Rx before index date
. gen udca_first = 0 if udca == 0
(204 missing values generated)

. replace udca_first = 1 if udca == 1 & udca_first_history >= mdy(9,1,2019) & u
> dca_first_history < mdy(3,1,2020) 
(0 real changes made)

. replace udca_first = 2 if udca == 1 & udca_first_history >= mdy(3,1,2019) & u
> dca_first_history < mdy(9,1,2019) 
(0 real changes made)

. replace udca_first = 3 if udca == 1 & udca_first_history >= mdy(9,1,2018) & u
> dca_first_history < mdy(3,1,2019) 
(0 real changes made)

. replace udca_first = 4 if udca == 1 & udca_first_history >= mdy(9,1,2017) & u
> dca_first_history < mdy(9,1,2018) 
(0 real changes made)

. replace udca_first = 5 if udca == 1 & udca_first_history >= mdy(9,1,2016) & u
> dca_first_history < mdy(9,1,2017) 
(2 real changes made)

. replace udca_first = 6 if udca == 1 & udca_first_history >= mdy(9,1,2015) & u
> dca_first_history < mdy(9,1,2016) 
(0 real changes made)

. replace udca_first = 7 if udca == 1 & udca_first_history >= mdy(9,1,2014) & u
> dca_first_history < mdy(9,1,2015) 
(0 real changes made)

. replace udca_first = 8 if udca == 1 &                                        
>                                      udca_first_history < mdy(9,1,2014) 
(98 real changes made)

. 
. label define udca_first         0 "unexposed"                                
>                            ///
>                                                 1 "within exposure window"   
>                                    ///
>                                                 2 "up to 6 mos before exposur
> e window"          ///
>                                                 3 "6 mos to 1 yr before expos
> ure window"        ///
>                                                 4 "1 to 2 yr before exposure 
> window"            ///
>                                                 5 "2 to 3 yr before exposure 
> window"            ///
>                                                 6 "3 to 4 yr before exposure 
> window"            ///
>                                                 7 "4 to 5 yr before exposure 
> window"            ///
>                                                 8 "5+ yr before exposure wind
> ow"

. label values udca_first udca_first

. 
. * Flag if died
. gen died_flag = died_date_onsA!=.

. * Generate date if died of covid
. gen died_date_onscovid = died_date_onsA if died_ons_covid_flag_any == 1
(752 missing values generated)

. 
. gen died_covid_2020 = (died_date_onscovid<date("31Dec2020", "DMY") & died_fla
> g==1)

. 
. **** Summary INFORMATION
. ** Currently dataset includes all people with at least one udca prescription
. * Tabulate pbc diagnosis vs those with 2+ prescriptions in 6 months prior
. tab has_pbc udca, m 

           |         udca
   has_pbc |         0          1 |     Total
-----------+----------------------+----------
         0 |       400        100 |       500 
         1 |       396        104 |       500 
-----------+----------------------+----------
     Total |       796        204 |     1,000 

. 
. * Tabulating time since first prescription by whether have 2+ prescriptions i
> n the last 6 months
. tab udca_first udca, m col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |         udca
           udca_first |         0          1 |     Total
----------------------+----------------------+----------
            unexposed |       796          0 |       796 
                      |    100.00       0.00 |     79.60 
----------------------+----------------------+----------
2 to 3 yr before expo |         0          2 |         2 
                      |      0.00       0.98 |      0.20 
----------------------+----------------------+----------
5+ yr before exposure |         0         98 |        98 
                      |      0.00      48.04 |      9.80 
----------------------+----------------------+----------
                    . |         0        104 |       104 
                      |      0.00      50.98 |     10.40 
----------------------+----------------------+----------
                Total |       796        204 |     1,000 
                      |    100.00     100.00 |    100.00 

. 
. bys udca: sum udca_count

-------------------------------------------------------------------------------
-> udca = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  udca_count |        796    .0452261    .2662856         -2          1

-------------------------------------------------------------------------------
-> udca = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  udca_count |        204    3.642157    1.358929          2          8


. 
. * Export to table 
. preserve

. table1_mc, by(udca) vars(has_pbc bin) saving(./output/tables/udca_all.xlsx, r
> eplace)

  +---------------------------------+
  | factor    N_0   N_1   m_0   m_1 |
  |---------------------------------|
  | has_pbc   796   204     0     0 |
  +---------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +-----------------------------------------------+
  |           udca = 0      udca = 1      p-value |
  |-----------------------------------------------|
  |           N=796         N=204                 |
  |-----------------------------------------------|
  | has_pbc   396 (49.7%)   104 (51.0%)    0.75   |
  +-----------------------------------------------+
Data are presented as n (%).
 
file ./output/tables/udca_all.xlsx saved

. restore 

. 
. * How many COVID-19 deaths in those with pbc and 2+ prescriptions
. tab died_ons_covid_flag_any has_pbc if udca==1, row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

died_ons_c |
ovid_flag_ |        has_pbc
       any |         0          1 |     Total
-----------+----------------------+----------
         0 |        58         47 |       105 
           |     55.24      44.76 |    100.00 
-----------+----------------------+----------
         1 |        42         57 |        99 
           |     42.42      57.58 |    100.00 
-----------+----------------------+----------
     Total |       100        104 |       204 
           |     49.02      50.98 |    100.00 

. tab died_covid_2020 has_pbc if udca==1, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

died_covid |        has_pbc
     _2020 |         0          1 |     Total
-----------+----------------------+----------
         0 |        96         93 |       189 
           |     50.79      49.21 |    100.00 
           |     96.00      89.42 |     92.65 
-----------+----------------------+----------
         1 |         4         11 |        15 
           |     26.67      73.33 |    100.00 
           |      4.00      10.58 |      7.35 
-----------+----------------------+----------
     Total |       100        104 |       204 
           |     49.02      50.98 |    100.00 
           |    100.00     100.00 |    100.00 

. tab died_flag has_pbc if udca==1, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

           |        has_pbc
 died_flag |         0          1 |     Total
-----------+----------------------+----------
         0 |        54         61 |       115 
           |     46.96      53.04 |    100.00 
           |     54.00      58.65 |     56.37 
-----------+----------------------+----------
         1 |        46         43 |        89 
           |     51.69      48.31 |    100.00 
           |     46.00      41.35 |     43.63 
-----------+----------------------+----------
     Total |       100        104 |       204 
           |     49.02      50.98 |    100.00 
           |    100.00     100.00 |    100.00 

. 
. * Summary demographics
. tab agegroup has_pbc if udca==1, row col m 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

 RECODE of |        has_pbc
       age |         0          1 |     Total
-----------+----------------------+----------
         0 |         3          2 |         5 
           |     60.00      40.00 |    100.00 
           |      3.00       1.92 |      2.45 
-----------+----------------------+----------
    18-<40 |        30         29 |        59 
           |     50.85      49.15 |    100.00 
           |     30.00      27.88 |     28.92 
-----------+----------------------+----------
    40-<50 |        10         20 |        30 
           |     33.33      66.67 |    100.00 
           |     10.00      19.23 |     14.71 
-----------+----------------------+----------
    50-<60 |        13         14 |        27 
           |     48.15      51.85 |    100.00 
           |     13.00      13.46 |     13.24 
-----------+----------------------+----------
    60-<70 |         9         10 |        19 
           |     47.37      52.63 |    100.00 
           |      9.00       9.62 |      9.31 
-----------+----------------------+----------
    70-<80 |         8          7 |        15 
           |     53.33      46.67 |    100.00 
           |      8.00       6.73 |      7.35 
-----------+----------------------+----------
       80+ |         9          8 |        17 
           |     52.94      47.06 |    100.00 
           |      9.00       7.69 |      8.33 
-----------+----------------------+----------
         7 |         0          1 |         1 
           |      0.00     100.00 |    100.00 
           |      0.00       0.96 |      0.49 
-----------+----------------------+----------
         8 |         2          3 |         5 
           |     40.00      60.00 |    100.00 
           |      2.00       2.88 |      2.45 
-----------+----------------------+----------
         9 |         4          2 |         6 
           |     66.67      33.33 |    100.00 
           |      4.00       1.92 |      2.94 
-----------+----------------------+----------
        10 |         1          0 |         1 
           |    100.00       0.00 |    100.00 
           |      1.00       0.00 |      0.49 
-----------+----------------------+----------
        11 |         1          2 |         3 
           |     33.33      66.67 |    100.00 
           |      1.00       1.92 |      1.47 
-----------+----------------------+----------
        12 |         1          1 |         2 
           |     50.00      50.00 |    100.00 
           |      1.00       0.96 |      0.98 
-----------+----------------------+----------
        13 |         2          2 |         4 
           |     50.00      50.00 |    100.00 
           |      2.00       1.92 |      1.96 
-----------+----------------------+----------
        14 |         3          1 |         4 
           |     75.00      25.00 |    100.00 
           |      3.00       0.96 |      1.96 
-----------+----------------------+----------
        15 |         1          0 |         1 
           |    100.00       0.00 |    100.00 
           |      1.00       0.00 |      0.49 
-----------+----------------------+----------
        16 |         1          0 |         1 
           |    100.00       0.00 |    100.00 
           |      1.00       0.00 |      0.49 
-----------+----------------------+----------
        17 |         2          2 |         4 
           |     50.00      50.00 |    100.00 
           |      2.00       1.92 |      1.96 
-----------+----------------------+----------
     Total |       100        104 |       204 
           |     49.02      50.98 |    100.00 
           |    100.00     100.00 |    100.00 

. tab sex has_pbc if udca==1, row col m 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

           |        has_pbc
       sex |         0          1 |     Total
-----------+----------------------+----------
         F |        50         55 |       105 
           |     47.62      52.38 |    100.00 
           |     50.00      52.88 |     51.47 
-----------+----------------------+----------
         M |        49         49 |        98 
           |     50.00      50.00 |    100.00 
           |     49.00      47.12 |     48.04 
-----------+----------------------+----------
         U |         1          0 |         1 
           |    100.00       0.00 |    100.00 
           |      1.00       0.00 |      0.49 
-----------+----------------------+----------
     Total |       100        104 |       204 
           |     49.02      50.98 |    100.00 
           |    100.00     100.00 |    100.00 

. 
. * Export to table 
. keep if udca==1
(796 observations deleted)

. table1_mc, by(has_pbc) vars(died_ons_covid_flag_any bin \ died_covid_2020 bin
>  \ died_flag bin \ agegroup cate \ male bin \ udca_first cate) saving(./outpu
> t/tables/udca_only.xlsx, replace)

  +-------------------------------------------------+
  | factor                    N_0   N_1   m_0   m_1 |
  |-------------------------------------------------|
  | died_ons_covid_flag_any   100   104     0     0 |
  |-------------------------------------------------|
  | died_covid_2020           100   104     0     0 |
  |-------------------------------------------------|
  | died_flag                 100   104     0     0 |
  |-------------------------------------------------|
  | RECODE of age             100   104     0     0 |
  |-------------------------------------------------|
  | male                       99   104     1     0 |
  |-------------------------------------------------|
  | udca_first                 49    51    51    53 |
  +-------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> ----------------------+
  |                                                              has_pbc = 0   
> has_pbc = 1   p-value |
  |----------------------------------------------------------------------------
> ----------------------|
  |                                                              N=100         
> N=104                 |
  |----------------------------------------------------------------------------
> ----------------------|
  | died_ons_covid_flag_any                                      42 (42.0%)    
> 57 (54.8%)     0.067  |
  |----------------------------------------------------------------------------
> ----------------------|
  | died_covid_2020                                              4 ( 4.0%)     
> 11 (10.6%)     0.072  |
  |----------------------------------------------------------------------------
> ----------------------|
  | died_flag                                                    46 (46.0%)    
> 43 (41.3%)     0.50   |
  |----------------------------------------------------------------------------
> ----------------------|
  | RECODE of age             0                                  3 ( 3.0%)     
> 2 ( 1.9%)      0.95   |
  |                           18-<40                             30 (30.0%)    
> 29 (27.9%)            |
  |                           40-<50                             10 (10.0%)    
> 20 (19.2%)            |
  |                           50-<60                             13 (13.0%)    
> 14 (13.5%)            |
  |                           60-<70                             9 ( 9.0%)     
> 10 ( 9.6%)            |
  |                           70-<80                             8 ( 8.0%)     
> 7 ( 6.7%)             |
  |                           80+                                9 ( 9.0%)     
> 8 ( 7.7%)             |
  |                           7                                  0 ( 0.0%)     
> 1 ( 1.0%)             |
  |                           8                                  2 ( 2.0%)     
> 3 ( 2.9%)             |
  |                           9                                  4 ( 4.0%)     
> 2 ( 1.9%)             |
  |                           10                                 1 ( 1.0%)     
> 0 ( 0.0%)             |
  |                           11                                 1 ( 1.0%)     
> 2 ( 1.9%)             |
  |                           12                                 1 ( 1.0%)     
> 1 ( 1.0%)             |
  |                           13                                 2 ( 2.0%)     
> 2 ( 1.9%)             |
  |                           14                                 3 ( 3.0%)     
> 1 ( 1.0%)             |
  |                           15                                 1 ( 1.0%)     
> 0 ( 0.0%)             |
  |                           16                                 1 ( 1.0%)     
> 0 ( 0.0%)             |
  |                           17                                 2 ( 2.0%)     
> 2 ( 1.9%)             |
  |----------------------------------------------------------------------------
> ----------------------|
  | male                                                         49 (49.5%)    
> 49 (47.1%)     0.73   |
  |----------------------------------------------------------------------------
> ----------------------|
  | udca_first                2 to 3 yr before exposure window   0 ( 0%)       
> 2 ( 4%)        0.50   |
  |                           5+ yr before exposure window       49 (100%)     
> 49 (96%)              |
  +----------------------------------------------------------------------------
> ----------------------+
Data are presented as n (%).
 
file ./output/tables/udca_only.xlsx saved

. 
. table1_mc, by(has_pbc) vars(udca_first cate) saving(./output/tables/udca_firs
> t_only.xlsx, replace)

  +------------------------------------+
  | factor       N_0   N_1   m_0   m_1 |
  |------------------------------------|
  | udca_first    49    51    51    53 |
  +------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> ---------+
  |                                                 has_pbc = 0   has_pbc = 1  
>  p-value |
  |----------------------------------------------------------------------------
> ---------|
  |                                                 N=100         N=104        
>          |
  |----------------------------------------------------------------------------
> ---------|
  | udca_first   2 to 3 yr before exposure window   0 ( 0%)       2 ( 4%)      
>   0.50   |
  |              5+ yr before exposure window       49 (100%)     49 (96%)     
>          |
  +----------------------------------------------------------------------------
> ---------+
Data are presented as n (%).
 
file ./output/tables/udca_first_only.xlsx saved

. 
. ** Next import the PBC population
. 
. import delimited using ./output/input_pbc.csv, clear
(12 vars, 1,000 obs)

. 
. * Format dates 
. foreach var in udca_last_date udca_first_after udca_first_history died_date_o
> ns {
  2.     gen `var'A = date(`var', "YMD")
  3.     format `var'A %dD/N/CY
  4.     *list `var' `var'A in  1/5
.     drop `var'
  5. }
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)

. 
. /* DEMOGRAPHICS */ 
. 
. * Sex
. gen male = 1 if sex == "M"
(506 missing values generated)

. replace male = 0 if sex == "F"
(500 real changes made)

. 
. /*  Age variables  */ 
. 
. * Create categorised age
. recode age 18/39.9999 = 1 /// 
>            40/49.9999 = 2 ///
>                    50/59.9999 = 3 ///
>                60/69.9999 = 4 ///
>                    70/79.9999 = 5 ///
>                    80/max = 6, gen(agegroup) 
(771 differences between age and agegroup)

. 
. label define agegroup   1 "18-<40" ///
>                                                 2 "40-<50" ///
>                                                 3 "50-<60" ///
>                                                 4 "60-<70" ///
>                                                 5 "70-<80" ///
>                                                 6 "80+"

.                                                 
. label values agegroup agegroup

. 
. /* EXPOSURE INFORMATION ====================================================*
> /
. rename udca_last_date udca_date

. gen udca = 1 if udca_count != . & udca_count >= 2
(801 missing values generated)

. recode udca .=0
(udca: 801 changes made)

. 
. gen udca_sa = 1 if udca_count != . & udca_count >= 1 & udca_date != . & udca_
> date >= mdy(12,1,2019)
(944 missing values generated)

. recode udca_sa .=0
(udca_sa: 944 changes made)

. 
. tab1 udca udca_sa, m

-> tabulation of udca  

       udca |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        801       80.10       80.10
          1 |        199       19.90      100.00
------------+-----------------------------------
      Total |      1,000      100.00

-> tabulation of udca_sa  

    udca_sa |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        944       94.40       94.40
          1 |         56        5.60      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. tab udca udca_sa, m

           |        udca_sa
      udca |         0          1 |     Total
-----------+----------------------+----------
         0 |       792          9 |       801 
         1 |       152         47 |       199 
-----------+----------------------+----------
     Total |       944         56 |     1,000 

. 
. *tab  udca_count udca, m
. 
. * when was first udca Rx before index date
. gen udca_first = 0 if udca == 0
(199 missing values generated)

. replace udca_first = 1 if udca == 1 & udca_first_history >= mdy(9,1,2019) & u
> dca_first_history < mdy(3,1,2020) 
(0 real changes made)

. replace udca_first = 2 if udca == 1 & udca_first_history >= mdy(3,1,2019) & u
> dca_first_history < mdy(9,1,2019) 
(1 real change made)

. replace udca_first = 3 if udca == 1 & udca_first_history >= mdy(9,1,2018) & u
> dca_first_history < mdy(3,1,2019) 
(0 real changes made)

. replace udca_first = 4 if udca == 1 & udca_first_history >= mdy(9,1,2017) & u
> dca_first_history < mdy(9,1,2018) 
(0 real changes made)

. replace udca_first = 5 if udca == 1 & udca_first_history >= mdy(9,1,2016) & u
> dca_first_history < mdy(9,1,2017) 
(1 real change made)

. replace udca_first = 6 if udca == 1 & udca_first_history >= mdy(9,1,2015) & u
> dca_first_history < mdy(9,1,2016) 
(1 real change made)

. replace udca_first = 7 if udca == 1 & udca_first_history >= mdy(9,1,2014) & u
> dca_first_history < mdy(9,1,2015) 
(0 real changes made)

. replace udca_first = 8 if udca == 1 &                                        
>                                      udca_first_history < mdy(9,1,2014) 
(96 real changes made)

. 
. label define udca_first         0 "unexposed"                                
>                            ///
>                                                 1 "within exposure window"   
>                                    ///
>                                                 2 "up to 6 mos before exposur
> e window"          ///
>                                                 3 "6 mos to 1 yr before expos
> ure window"        ///
>                                                 4 "1 to 2 yr before exposure 
> window"            ///
>                                                 5 "2 to 3 yr before exposure 
> window"            ///
>                                                 6 "3 to 4 yr before exposure 
> window"            ///
>                                                 7 "4 to 5 yr before exposure 
> window"            ///
>                                                 8 "5+ yr before exposure wind
> ow"

. label values udca_first udca_first

. 
. * Flag if died
. gen died_flag = died_date_onsA!=.

. * Generate date if died of covid
. gen died_date_onscovid = died_date_onsA if died_ons_covid_flag_any == 1
(746 missing values generated)

. gen died_covid_2020 = (died_date_onscovid<date("31Dec2020", "DMY") & died_fla
> g==1)

. 
. **** Summary INFORMATION
. ** Currently dataset includes all people with a pbc diagnosis, how many have 
> 2+ udca prescription
. * Tabulate pbc diagnosis vs those with 2+ prescriptions in 6 months prior
. tab udca, m 

       udca |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        801       80.10       80.10
          1 |        199       19.90      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. 
. * Tabulating time since first prescription by whether have 2+ prescriptions i
> n the last 6 months
. tab udca_first udca, col m

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |         udca
           udca_first |         0          1 |     Total
----------------------+----------------------+----------
            unexposed |       801          0 |       801 
                      |    100.00       0.00 |     80.10 
----------------------+----------------------+----------
up to 6 mos before ex |         0          1 |         1 
                      |      0.00       0.50 |      0.10 
----------------------+----------------------+----------
2 to 3 yr before expo |         0          1 |         1 
                      |      0.00       0.50 |      0.10 
----------------------+----------------------+----------
3 to 4 yr before expo |         0          1 |         1 
                      |      0.00       0.50 |      0.10 
----------------------+----------------------+----------
5+ yr before exposure |         0         96 |        96 
                      |      0.00      48.24 |      9.60 
----------------------+----------------------+----------
                    . |         0        100 |       100 
                      |      0.00      50.25 |     10.00 
----------------------+----------------------+----------
                Total |       801        199 |     1,000 
                      |    100.00     100.00 |    100.00 

. 
. * Check number of prescriptions
. bys udca: sum udca_count

-------------------------------------------------------------------------------
-> udca = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  udca_count |        801    .0461923    .2532067         -2          1

-------------------------------------------------------------------------------
-> udca = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  udca_count |        199    3.437186    1.372465          2          9


. 
. * How many COVID-19 deaths by whether had 2+ prescriptions
. tab died_ons_covid_flag_any udca, row col 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

died_ons_c |
ovid_flag_ |         udca
       any |         0          1 |     Total
-----------+----------------------+----------
         0 |       399        101 |       500 
           |     79.80      20.20 |    100.00 
           |     49.81      50.75 |     50.00 
-----------+----------------------+----------
         1 |       402         98 |       500 
           |     80.40      19.60 |    100.00 
           |     50.19      49.25 |     50.00 
-----------+----------------------+----------
     Total |       801        199 |     1,000 
           |     80.10      19.90 |    100.00 
           |    100.00     100.00 |    100.00 

. tab died_covid_2020 udca, row col 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

died_covid |         udca
     _2020 |         0          1 |     Total
-----------+----------------------+----------
         0 |       741        190 |       931 
           |     79.59      20.41 |    100.00 
           |     92.51      95.48 |     93.10 
-----------+----------------------+----------
         1 |        60          9 |        69 
           |     86.96      13.04 |    100.00 
           |      7.49       4.52 |      6.90 
-----------+----------------------+----------
     Total |       801        199 |     1,000 
           |     80.10      19.90 |    100.00 
           |    100.00     100.00 |    100.00 

. tab died_flag udca, row col 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

           |         udca
 died_flag |         0          1 |     Total
-----------+----------------------+----------
         0 |       402         98 |       500 
           |     80.40      19.60 |    100.00 
           |     50.19      49.25 |     50.00 
-----------+----------------------+----------
         1 |       399        101 |       500 
           |     79.80      20.20 |    100.00 
           |     49.81      50.75 |     50.00 
-----------+----------------------+----------
     Total |       801        199 |     1,000 
           |     80.10      19.90 |    100.00 
           |    100.00     100.00 |    100.00 

. 
. 
. * Summary demographics
. tab agegroup udca, row col m 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

 RECODE of |         udca
       age |         0          1 |     Total
-----------+----------------------+----------
         0 |        11          4 |        15 
           |     73.33      26.67 |    100.00 
           |      1.37       2.01 |      1.50 
-----------+----------------------+----------
    18-<40 |       240         60 |       300 
           |     80.00      20.00 |    100.00 
           |     29.96      30.15 |     30.00 
-----------+----------------------+----------
    40-<50 |       119         23 |       142 
           |     83.80      16.20 |    100.00 
           |     14.86      11.56 |     14.20 
-----------+----------------------+----------
    50-<60 |       116         22 |       138 
           |     84.06      15.94 |    100.00 
           |     14.48      11.06 |     13.80 
-----------+----------------------+----------
    60-<70 |        89         32 |       121 
           |     73.55      26.45 |    100.00 
           |     11.11      16.08 |     12.10 
-----------+----------------------+----------
    70-<80 |        65         19 |        84 
           |     77.38      22.62 |    100.00 
           |      8.11       9.55 |      8.40 
-----------+----------------------+----------
       80+ |        53         15 |        68 
           |     77.94      22.06 |    100.00 
           |      6.62       7.54 |      6.80 
-----------+----------------------+----------
         7 |        10          4 |        14 
           |     71.43      28.57 |    100.00 
           |      1.25       2.01 |      1.40 
-----------+----------------------+----------
         8 |         7          4 |        11 
           |     63.64      36.36 |    100.00 
           |      0.87       2.01 |      1.10 
-----------+----------------------+----------
         9 |         9          3 |        12 
           |     75.00      25.00 |    100.00 
           |      1.12       1.51 |      1.20 
-----------+----------------------+----------
        10 |         6          0 |         6 
           |    100.00       0.00 |    100.00 
           |      0.75       0.00 |      0.60 
-----------+----------------------+----------
        11 |        12          2 |        14 
           |     85.71      14.29 |    100.00 
           |      1.50       1.01 |      1.40 
-----------+----------------------+----------
        12 |        12          1 |        13 
           |     92.31       7.69 |    100.00 
           |      1.50       0.50 |      1.30 
-----------+----------------------+----------
        13 |        10          4 |        14 
           |     71.43      28.57 |    100.00 
           |      1.25       2.01 |      1.40 
-----------+----------------------+----------
        14 |        11          0 |        11 
           |    100.00       0.00 |    100.00 
           |      1.37       0.00 |      1.10 
-----------+----------------------+----------
        15 |        13          3 |        16 
           |     81.25      18.75 |    100.00 
           |      1.62       1.51 |      1.60 
-----------+----------------------+----------
        16 |         9          2 |        11 
           |     81.82      18.18 |    100.00 
           |      1.12       1.01 |      1.10 
-----------+----------------------+----------
        17 |         9          1 |        10 
           |     90.00      10.00 |    100.00 
           |      1.12       0.50 |      1.00 
-----------+----------------------+----------
     Total |       801        199 |     1,000 
           |     80.10      19.90 |    100.00 
           |    100.00     100.00 |    100.00 

. tab sex udca, row col m 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

           |         udca
       sex |         0          1 |     Total
-----------+----------------------+----------
         F |       399        101 |       500 
           |     79.80      20.20 |    100.00 
           |     49.81      50.75 |     50.00 
-----------+----------------------+----------
         M |       396         98 |       494 
           |     80.16      19.84 |    100.00 
           |     49.44      49.25 |     49.40 
-----------+----------------------+----------
         U |         6          0 |         6 
           |    100.00       0.00 |    100.00 
           |      0.75       0.00 |      0.60 
-----------+----------------------+----------
     Total |       801        199 |     1,000 
           |     80.10      19.90 |    100.00 
           |    100.00     100.00 |    100.00 

. 
. * Export to table 
. * First drop out categories that will not be in real data > should be zero on
>  server
. drop if agegroup<1 | agegroup>6
(147 observations deleted)

. table1_mc, by(udca) vars(udca_first cate \ died_ons_covid_flag_any bin \ died
> _covid_2020 bin \ died_flag bin \ agegroup cate \ male bin) saving(./output/t
> ables/udca_pbc.xlsx, replace)

  +-------------------------------------------------+
  | factor                    N_0   N_1   m_0   m_1 |
  |-------------------------------------------------|
  | udca_first                682    82     0    89 |
  |-------------------------------------------------|
  | died_ons_covid_flag_any   682   171     0     0 |
  |-------------------------------------------------|
  | died_covid_2020           682   171     0     0 |
  |-------------------------------------------------|
  | died_flag                 682   171     0     0 |
  |-------------------------------------------------|
  | RECODE of age             682   171     0     0 |
  |-------------------------------------------------|
  | male                      677   171     5     0 |
  +-------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> ----------------------+
  |                                                              udca = 0      
>  udca = 1     p-value |
  |----------------------------------------------------------------------------
> ----------------------|
  |                                                              N=682         
>  N=171                |
  |----------------------------------------------------------------------------
> ----------------------|
  | udca_first                unexposed                          682 (100.0%)  
>  0 ( 0.0%)    <0.001  |
  |                           2 to 3 yr before exposure window   0 ( 0.0%)     
>  1 ( 1.2%)            |
  |                           3 to 4 yr before exposure window   0 ( 0.0%)     
>  1 ( 1.2%)            |
  |                           5+ yr before exposure window       0 ( 0.0%)     
>  80 (97.6%)           |
  |----------------------------------------------------------------------------
> ----------------------|
  | died_ons_covid_flag_any                                      338 (49.6%)   
>  88 (51.5%)    0.66   |
  |----------------------------------------------------------------------------
> ----------------------|
  | died_covid_2020                                              50 ( 7.3%)    
>  9 ( 5.3%)     0.34   |
  |----------------------------------------------------------------------------
> ----------------------|
  | died_flag                                                    345 (50.6%)   
>  86 (50.3%)    0.95   |
  |----------------------------------------------------------------------------
> ----------------------|
  | RECODE of age             18-<40                             240 (35.2%)   
>  60 (35.1%)    0.27   |
  |                           40-<50                             119 (17.4%)   
>  23 (13.5%)           |
  |                           50-<60                             116 (17.0%)   
>  22 (12.9%)           |
  |                           60-<70                             89 (13.0%)    
>  32 (18.7%)           |
  |                           70-<80                             65 ( 9.5%)    
>  19 (11.1%)           |
  |                           80+                                53 ( 7.8%)    
>  15 ( 8.8%)           |
  |----------------------------------------------------------------------------
> ----------------------|
  | male                                                         337 (49.8%)   
>  86 (50.3%)    0.90   |
  +----------------------------------------------------------------------------
> ----------------------+
Data are presented as n (%).
 
file ./output/tables/udca_pbc.xlsx saved

. 
. foreach var in all only pbc first_only {
  2.         import excel using ./output/tables/udca_`var'.xlsx, clear
  3.         export delimited using ./output/tables/udca_`var'.csv, replace 
  4. }
(12 vars, 3 obs)
(note: file ./output/tables/udca_all.csv not found)
file ./output/tables/udca_all.csv saved
(13 vars, 26 obs)
(note: file ./output/tables/udca_only.csv not found)
file ./output/tables/udca_only.csv saved
(13 vars, 16 obs)
(note: file ./output/tables/udca_pbc.csv not found)
file ./output/tables/udca_pbc.csv saved
(13 vars, 4 obs)
(note: file ./output/tables/udca_first_only.csv not found)
file ./output/tables/udca_first_only.csv saved

. 
. 
. 
. 
. 
end of do-file

. . file open output using "/tmp/feasibility.do.YZMC.out", write text replace

. . file write output "success" 

. . file close output

. 
end of do-file


