
. 
. cap mkdir ./output/tables/

. 
. ** First import udca population
. import delimited using ./output/input.csv
(15 vars, 1,000 obs)

. 
. * Format dates 
. foreach var in udca_last_date udca_first_after udca_first_history died_date_o
> ns {
  2.     gen `var'A = date(`var', "YMD")
  3.     format `var'A %dD/N/CY
  4.     *list `var' `var'A in  1/5
.     drop `var'
  5. }
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)

. 
. /* DEMOGRAPHICS */ 
. 
. * Sex
. gen male = 1 if sex == "M"
(494 missing values generated)

. replace male = 0 if sex == "F"
(488 real changes made)

. 
. /*  Age variables  */ 
. 
. * Create categorised age
. recode age 18/39.9999 = 1 /// 
>            40/49.9999 = 2 ///
>                    50/59.9999 = 3 ///
>                60/69.9999 = 4 ///
>                    70/79.9999 = 5 ///
>                    80/max = 6, gen(agegroup) 
(775 differences between age and agegroup)

. 
. label define agegroup   1 "18-<40" ///
>                                                 2 "40-<50" ///
>                                                 3 "50-<60" ///
>                                                 4 "60-<70" ///
>                                                 5 "70-<80" ///
>                                                 6 "80+"

.                                                 
. label values agegroup agegroup

. 
. /* EXPOSURE INFORMATION ====================================================*
> /
. rename udca_last_date udca_date

. gen udca = 1 if udca_count != . & udca_count >= 2
(789 missing values generated)

. recode udca .=0
(udca: 789 changes made)

. 
. gen udca_sa = 1 if udca_count != . & udca_count >= 1 & udca_date != . & udca_
> date >= mdy(12,1,2019)
(932 missing values generated)

. recode udca_sa .=0
(udca_sa: 932 changes made)

. 
. tab1 udca udca_sa, m

-> tabulation of udca  

       udca |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        789       78.90       78.90
          1 |        211       21.10      100.00
------------+-----------------------------------
      Total |      1,000      100.00

-> tabulation of udca_sa  

    udca_sa |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        932       93.20       93.20
          1 |         68        6.80      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. tab udca udca_sa, m

           |        udca_sa
      udca |         0          1 |     Total
-----------+----------------------+----------
         0 |       778         11 |       789 
         1 |       154         57 |       211 
-----------+----------------------+----------
     Total |       932         68 |     1,000 

. 
. *tab  udca_count udca, m
. 
. * when was first udca Rx before index date
. gen udca_first = 0 if udca == 0
(211 missing values generated)

. replace udca_first = 1 if udca == 1 & udca_first_history >= mdy(9,1,2019) & u
> dca_first_history < mdy(3,1,2020) 
(1 real change made)

. replace udca_first = 2 if udca == 1 & udca_first_history >= mdy(3,1,2019) & u
> dca_first_history < mdy(9,1,2019) 
(3 real changes made)

. replace udca_first = 3 if udca == 1 & udca_first_history >= mdy(9,1,2018) & u
> dca_first_history < mdy(3,1,2019) 
(1 real change made)

. replace udca_first = 4 if udca == 1 & udca_first_history >= mdy(9,1,2017) & u
> dca_first_history < mdy(9,1,2018) 
(1 real change made)

. replace udca_first = 5 if udca == 1 & udca_first_history >= mdy(9,1,2016) & u
> dca_first_history < mdy(9,1,2017) 
(0 real changes made)

. replace udca_first = 6 if udca == 1 & udca_first_history >= mdy(9,1,2015) & u
> dca_first_history < mdy(9,1,2016) 
(1 real change made)

. replace udca_first = 7 if udca == 1 & udca_first_history >= mdy(9,1,2014) & u
> dca_first_history < mdy(9,1,2015) 
(3 real changes made)

. replace udca_first = 8 if udca == 1 &                                        
>                                      udca_first_history < mdy(9,1,2014) 
(102 real changes made)

. 
. label define udca_first         0 "unexposed"                                
>                            ///
>                                                 1 "within exposure window"   
>                                    ///
>                                                 2 "up to 6 mos before exposur
> e window"          ///
>                                                 3 "6 mos to 1 yr before expos
> ure window"        ///
>                                                 4 "1 to 2 yr before exposure 
> window"            ///
>                                                 5 "2 to 3 yr before exposure 
> window"            ///
>                                                 6 "3 to 4 yr before exposure 
> window"            ///
>                                                 7 "4 to 5 yr before exposure 
> window"            ///
>                                                 8 "5+ yr before exposure wind
> ow"

. label values udca_first udca_first

. 
. * Flag if died
. gen died_flag = died_date_onsA!=.

. * Generate date if died of covid
. gen died_date_onscovid = died_date_onsA if died_ons_covid_flag_any == 1
(752 missing values generated)

. 
. gen died_covid_2020 = (died_date_onscovid<date("31Dec2020", "DMY") & died_fla
> g==1)

. 
. **** Summary INFORMATION
. ** Currently dataset includes all people with at least one udca prescription
. * Tabulate pbc diagnosis vs those with 2+ prescriptions in 6 months prior
. tab has_pbc udca, m 

           |         udca
   has_pbc |         0          1 |     Total
-----------+----------------------+----------
         0 |       388        112 |       500 
         1 |       401         99 |       500 
-----------+----------------------+----------
     Total |       789        211 |     1,000 

. 
. * Tabulating time since first prescription by whether have 2+ prescriptions i
> n the last 6 months
. tab udca_first udca, m col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |         udca
           udca_first |         0          1 |     Total
----------------------+----------------------+----------
            unexposed |       789          0 |       789 
                      |    100.00       0.00 |     78.90 
----------------------+----------------------+----------
within exposure windo |         0          1 |         1 
                      |      0.00       0.47 |      0.10 
----------------------+----------------------+----------
up to 6 mos before ex |         0          3 |         3 
                      |      0.00       1.42 |      0.30 
----------------------+----------------------+----------
6 mos to 1 yr before  |         0          1 |         1 
                      |      0.00       0.47 |      0.10 
----------------------+----------------------+----------
1 to 2 yr before expo |         0          1 |         1 
                      |      0.00       0.47 |      0.10 
----------------------+----------------------+----------
3 to 4 yr before expo |         0          1 |         1 
                      |      0.00       0.47 |      0.10 
----------------------+----------------------+----------
4 to 5 yr before expo |         0          3 |         3 
                      |      0.00       1.42 |      0.30 
----------------------+----------------------+----------
5+ yr before exposure |         0        102 |       102 
                      |      0.00      48.34 |     10.20 
----------------------+----------------------+----------
                    . |         0         99 |        99 
                      |      0.00      46.92 |      9.90 
----------------------+----------------------+----------
                Total |       789        211 |     1,000 
                      |    100.00     100.00 |    100.00 

. 
. bys udca: sum udca_count

-------------------------------------------------------------------------------
-> udca = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  udca_count |        789    .0468948    .2648266         -2          1

-------------------------------------------------------------------------------
-> udca = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  udca_count |        211    3.535545      1.3981          2          8


. 
. * Export to table 
. preserve

. table1_mc, by(udca) vars(has_pbc bin has_psc bin) saving(./output/tables/udca
> _all.xlsx, replace)

  +---------------------------------+
  | factor    N_0   N_1   m_0   m_1 |
  |---------------------------------|
  | has_pbc   789   211     0     0 |
  +---------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +-----------------------------------------+
  |           udca = 0   udca = 1   p-value |
  |-----------------------------------------|
  |           N=789      N=211              |
  |-----------------------------------------|
  | has_pbc   401 (%)    99 (%)      0.31   |
  +-----------------------------------------+
Data are presented as n (%).
 
file ./output/tables/udca_all.xlsx saved

. restore 

. 
. * How many COVID-19 deaths in those with pbc and 2+ prescriptions
. tab died_ons_covid_flag_any has_pbc if udca==1, row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

died_ons_c |
ovid_flag_ |        has_pbc
       any |         0          1 |     Total
-----------+----------------------+----------
         0 |        50         48 |        98 
           |     51.02      48.98 |    100.00 
-----------+----------------------+----------
         1 |        62         51 |       113 
           |     54.87      45.13 |    100.00 
-----------+----------------------+----------
     Total |       112         99 |       211 
           |     53.08      46.92 |    100.00 

. tab died_covid_2020 has_pbc if udca==1, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

died_covid |        has_pbc
     _2020 |         0          1 |     Total
-----------+----------------------+----------
         0 |       100         93 |       193 
           |     51.81      48.19 |    100.00 
           |     89.29      93.94 |     91.47 
-----------+----------------------+----------
         1 |        12          6 |        18 
           |     66.67      33.33 |    100.00 
           |     10.71       6.06 |      8.53 
-----------+----------------------+----------
     Total |       112         99 |       211 
           |     53.08      46.92 |    100.00 
           |    100.00     100.00 |    100.00 

. tab died_flag has_pbc if udca==1, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

           |        has_pbc
 died_flag |         0          1 |     Total
-----------+----------------------+----------
         0 |        62         52 |       114 
           |     54.39      45.61 |    100.00 
           |     55.36      52.53 |     54.03 
-----------+----------------------+----------
         1 |        50         47 |        97 
           |     51.55      48.45 |    100.00 
           |     44.64      47.47 |     45.97 
-----------+----------------------+----------
     Total |       112         99 |       211 
           |     53.08      46.92 |    100.00 
           |    100.00     100.00 |    100.00 

. 
. * How many COVID-19 deaths in those with psc and 2+ prescriptions
. tab died_ons_covid_flag_any has_psc if udca==1, row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

died_ons_c |
ovid_flag_ |        has_psc
       any |         0          1 |     Total
-----------+----------------------+----------
         0 |        52         46 |        98 
           |     53.06      46.94 |    100.00 
-----------+----------------------+----------
         1 |        53         60 |       113 
           |     46.90      53.10 |    100.00 
-----------+----------------------+----------
     Total |       105        106 |       211 
           |     49.76      50.24 |    100.00 

. tab died_covid_2020 has_psc if udca==1, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

died_covid |        has_psc
     _2020 |         0          1 |     Total
-----------+----------------------+----------
         0 |        98         95 |       193 
           |     50.78      49.22 |    100.00 
           |     93.33      89.62 |     91.47 
-----------+----------------------+----------
         1 |         7         11 |        18 
           |     38.89      61.11 |    100.00 
           |      6.67      10.38 |      8.53 
-----------+----------------------+----------
     Total |       105        106 |       211 
           |     49.76      50.24 |    100.00 
           |    100.00     100.00 |    100.00 

. tab died_flag has_psc if udca==1, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

           |        has_psc
 died_flag |         0          1 |     Total
-----------+----------------------+----------
         0 |        54         60 |       114 
           |     47.37      52.63 |    100.00 
           |     51.43      56.60 |     54.03 
-----------+----------------------+----------
         1 |        51         46 |        97 
           |     52.58      47.42 |    100.00 
           |     48.57      43.40 |     45.97 
-----------+----------------------+----------
     Total |       105        106 |       211 
           |     49.76      50.24 |    100.00 
           |    100.00     100.00 |    100.00 

. 
. * Summary demographics
. tab agegroup has_pbc if udca==1, row col m 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

 RECODE of |        has_pbc
       age |         0          1 |     Total
-----------+----------------------+----------
         0 |         3          0 |         3 
           |    100.00       0.00 |    100.00 
           |      2.68       0.00 |      1.42 
-----------+----------------------+----------
    18-<40 |        37         31 |        68 
           |     54.41      45.59 |    100.00 
           |     33.04      31.31 |     32.23 
-----------+----------------------+----------
    40-<50 |         9          6 |        15 
           |     60.00      40.00 |    100.00 
           |      8.04       6.06 |      7.11 
-----------+----------------------+----------
    50-<60 |        17         16 |        33 
           |     51.52      48.48 |    100.00 
           |     15.18      16.16 |     15.64 
-----------+----------------------+----------
    60-<70 |        15          7 |        22 
           |     68.18      31.82 |    100.00 
           |     13.39       7.07 |     10.43 
-----------+----------------------+----------
    70-<80 |        13         10 |        23 
           |     56.52      43.48 |    100.00 
           |     11.61      10.10 |     10.90 
-----------+----------------------+----------
       80+ |         4          8 |        12 
           |     33.33      66.67 |    100.00 
           |      3.57       8.08 |      5.69 
-----------+----------------------+----------
         7 |         2          0 |         2 
           |    100.00       0.00 |    100.00 
           |      1.79       0.00 |      0.95 
-----------+----------------------+----------
         8 |         2          2 |         4 
           |     50.00      50.00 |    100.00 
           |      1.79       2.02 |      1.90 
-----------+----------------------+----------
         9 |         1          4 |         5 
           |     20.00      80.00 |    100.00 
           |      0.89       4.04 |      2.37 
-----------+----------------------+----------
        10 |         2          3 |         5 
           |     40.00      60.00 |    100.00 
           |      1.79       3.03 |      2.37 
-----------+----------------------+----------
        11 |         1          1 |         2 
           |     50.00      50.00 |    100.00 
           |      0.89       1.01 |      0.95 
-----------+----------------------+----------
        12 |         1          2 |         3 
           |     33.33      66.67 |    100.00 
           |      0.89       2.02 |      1.42 
-----------+----------------------+----------
        13 |         1          1 |         2 
           |     50.00      50.00 |    100.00 
           |      0.89       1.01 |      0.95 
-----------+----------------------+----------
        14 |         2          3 |         5 
           |     40.00      60.00 |    100.00 
           |      1.79       3.03 |      2.37 
-----------+----------------------+----------
        15 |         1          3 |         4 
           |     25.00      75.00 |    100.00 
           |      0.89       3.03 |      1.90 
-----------+----------------------+----------
        16 |         1          0 |         1 
           |    100.00       0.00 |    100.00 
           |      0.89       0.00 |      0.47 
-----------+----------------------+----------
        17 |         0          2 |         2 
           |      0.00     100.00 |    100.00 
           |      0.00       2.02 |      0.95 
-----------+----------------------+----------
     Total |       112         99 |       211 
           |     53.08      46.92 |    100.00 
           |    100.00     100.00 |    100.00 

. tab sex has_pbc if udca==1, row col m 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

           |        has_pbc
       sex |         0          1 |     Total
-----------+----------------------+----------
         F |        59         46 |       105 
           |     56.19      43.81 |    100.00 
           |     52.68      46.46 |     49.76 
-----------+----------------------+----------
         M |        52         52 |       104 
           |     50.00      50.00 |    100.00 
           |     46.43      52.53 |     49.29 
-----------+----------------------+----------
         U |         1          1 |         2 
           |     50.00      50.00 |    100.00 
           |      0.89       1.01 |      0.95 
-----------+----------------------+----------
     Total |       112         99 |       211 
           |     53.08      46.92 |    100.00 
           |    100.00     100.00 |    100.00 

. 
. tab agegroup has_psc if udca==1, row col m 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

 RECODE of |        has_psc
       age |         0          1 |     Total
-----------+----------------------+----------
         0 |         1          2 |         3 
           |     33.33      66.67 |    100.00 
           |      0.95       1.89 |      1.42 
-----------+----------------------+----------
    18-<40 |        29         39 |        68 
           |     42.65      57.35 |    100.00 
           |     27.62      36.79 |     32.23 
-----------+----------------------+----------
    40-<50 |        11          4 |        15 
           |     73.33      26.67 |    100.00 
           |     10.48       3.77 |      7.11 
-----------+----------------------+----------
    50-<60 |        18         15 |        33 
           |     54.55      45.45 |    100.00 
           |     17.14      14.15 |     15.64 
-----------+----------------------+----------
    60-<70 |        12         10 |        22 
           |     54.55      45.45 |    100.00 
           |     11.43       9.43 |     10.43 
-----------+----------------------+----------
    70-<80 |        14          9 |        23 
           |     60.87      39.13 |    100.00 
           |     13.33       8.49 |     10.90 
-----------+----------------------+----------
       80+ |         6          6 |        12 
           |     50.00      50.00 |    100.00 
           |      5.71       5.66 |      5.69 
-----------+----------------------+----------
         7 |         1          1 |         2 
           |     50.00      50.00 |    100.00 
           |      0.95       0.94 |      0.95 
-----------+----------------------+----------
         8 |         0          4 |         4 
           |      0.00     100.00 |    100.00 
           |      0.00       3.77 |      1.90 
-----------+----------------------+----------
         9 |         3          2 |         5 
           |     60.00      40.00 |    100.00 
           |      2.86       1.89 |      2.37 
-----------+----------------------+----------
        10 |         3          2 |         5 
           |     60.00      40.00 |    100.00 
           |      2.86       1.89 |      2.37 
-----------+----------------------+----------
        11 |         0          2 |         2 
           |      0.00     100.00 |    100.00 
           |      0.00       1.89 |      0.95 
-----------+----------------------+----------
        12 |         2          1 |         3 
           |     66.67      33.33 |    100.00 
           |      1.90       0.94 |      1.42 
-----------+----------------------+----------
        13 |         1          1 |         2 
           |     50.00      50.00 |    100.00 
           |      0.95       0.94 |      0.95 
-----------+----------------------+----------
        14 |         2          3 |         5 
           |     40.00      60.00 |    100.00 
           |      1.90       2.83 |      2.37 
-----------+----------------------+----------
        15 |         1          3 |         4 
           |     25.00      75.00 |    100.00 
           |      0.95       2.83 |      1.90 
-----------+----------------------+----------
        16 |         0          1 |         1 
           |      0.00     100.00 |    100.00 
           |      0.00       0.94 |      0.47 
-----------+----------------------+----------
        17 |         1          1 |         2 
           |     50.00      50.00 |    100.00 
           |      0.95       0.94 |      0.95 
-----------+----------------------+----------
     Total |       105        106 |       211 
           |     49.76      50.24 |    100.00 
           |    100.00     100.00 |    100.00 

. tab sex has_psc if udca==1, row col m 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

           |        has_psc
       sex |         0          1 |     Total
-----------+----------------------+----------
         F |        51         54 |       105 
           |     48.57      51.43 |    100.00 
           |     48.57      50.94 |     49.76 
-----------+----------------------+----------
         M |        53         51 |       104 
           |     50.96      49.04 |    100.00 
           |     50.48      48.11 |     49.29 
-----------+----------------------+----------
         U |         1          1 |         2 
           |     50.00      50.00 |    100.00 
           |      0.95       0.94 |      0.95 
-----------+----------------------+----------
     Total |       105        106 |       211 
           |     49.76      50.24 |    100.00 
           |    100.00     100.00 |    100.00 

. 
. * Export to table 
. keep if udca==1
(789 observations deleted)

. table1_mc, by(has_pbc) vars(died_ons_covid_flag_any bin \ died_covid_2020 bin
>  \ died_flag bin \ agegroup cat \ male bin) saving(./output/tables/udca_only.
> xlsx, replace)

  +-------------------------------------------------+
  | factor                    N_0   N_1   m_0   m_1 |
  |-------------------------------------------------|
  | died_ons_covid_flag_any   112    99     0     0 |
  |-------------------------------------------------|
  | died_covid_2020           112    99     0     0 |
  |-------------------------------------------------|
  | died_flag                 112    99     0     0 |
  |-------------------------------------------------|
  | RECODE of age             112    99     0     0 |
  |-------------------------------------------------|
  | male                      111    98     1     1 |
  +-------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +------------------------------------------------------------------------+
  |                                    has_pbc = 0   has_pbc = 1   p-value |
  |------------------------------------------------------------------------|
  |                                    N=112         N=99                  |
  |------------------------------------------------------------------------|
  | died_ons_covid_flag_any            62 (55.4%)    51 (51.5%)     0.58   |
  |------------------------------------------------------------------------|
  | died_covid_2020                    12 (10.7%)    6 ( 6.1%)      0.23   |
  |------------------------------------------------------------------------|
  | died_flag                          50 (44.6%)    47 (47.5%)     0.68   |
  |------------------------------------------------------------------------|
  | RECODE of age             0        3 ( 2.7%)     0 ( 0.0%)      0.48   |
  |                           18-<40   37 (33.0%)    31 (31.3%)            |
  |                           40-<50   9 ( 8.0%)     6 ( 6.1%)             |
  |                           50-<60   17 (15.2%)    16 (16.2%)            |
  |                           60-<70   15 (13.4%)    7 ( 7.1%)             |
  |                           70-<80   13 (11.6%)    10 (10.1%)            |
  |                           80+      4 ( 3.6%)     8 ( 8.1%)             |
  |                           7        2 ( 1.8%)     0 ( 0.0%)             |
  |                           8        2 ( 1.8%)     2 ( 2.0%)             |
  |                           9        1 ( 0.9%)     4 ( 4.0%)             |
  |                           10       2 ( 1.8%)     3 ( 3.0%)             |
  |                           11       1 ( 0.9%)     1 ( 1.0%)             |
  |                           12       1 ( 0.9%)     2 ( 2.0%)             |
  |                           13       1 ( 0.9%)     1 ( 1.0%)             |
  |                           14       2 ( 1.8%)     3 ( 3.0%)             |
  |                           15       1 ( 0.9%)     3 ( 3.0%)             |
  |                           16       1 ( 0.9%)     0 ( 0.0%)             |
  |                           17       0 ( 0.0%)     2 ( 2.0%)             |
  |------------------------------------------------------------------------|
  | male                               52 (46.8%)    52 (53.1%)     0.37   |
  +------------------------------------------------------------------------+
Data are presented as n (%).
 
file ./output/tables/udca_only.xlsx saved

. 
. table1_mc, by(has_pbc) vars(udca_first cat) saving(./output/tables/udca_first
> _only.xlsx, replace)

  +------------------------------------+
  | factor       N_0   N_1   m_0   m_1 |
  |------------------------------------|
  | udca_first    59    53    53    46 |
  +------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> -------------+
  |                                                     has_pbc = 0   has_pbc =
>  1   p-value |
  |----------------------------------------------------------------------------
> -------------|
  |                                                     N=112         N=99     
>              |
  |----------------------------------------------------------------------------
> -------------|
  | udca_first   within exposure window                 1 ( 2%)       0 ( 0%)  
>       0.58   |
  |              up to 6 mos before exposure window     2 ( 3%)       1 ( 2%)  
>              |
  |              6 mos to 1 yr before exposure window   0 ( 0%)       1 ( 2%)  
>              |
  |              1 to 2 yr before exposure window       0 ( 0%)       1 ( 2%)  
>              |
  |              3 to 4 yr before exposure window       0 ( 0%)       1 ( 2%)  
>              |
  |              4 to 5 yr before exposure window       2 ( 3%)       1 ( 2%)  
>              |
  |              5+ yr before exposure window           54 (92%)      48 (91%) 
>              |
  +----------------------------------------------------------------------------
> -------------+
Data are presented as n (%).
 
file ./output/tables/udca_first_only.xlsx saved

. 
. table1_mc, by(has_psc) vars(died_ons_covid_flag_any bin \ died_covid_2020 bin
>  \ died_flag bin \ agegroup cat \ male bin) saving(./output/tables/udca_only.
> xlsx, replace)

  +-------------------------------------------------+
  | factor                    N_0   N_1   m_0   m_1 |
  |-------------------------------------------------|
  | died_ons_covid_flag_any   105   106     0     0 |
  |-------------------------------------------------|
  | died_covid_2020           105   106     0     0 |
  |-------------------------------------------------|
  | died_flag                 105   106     0     0 |
  |-------------------------------------------------|
  | RECODE of age             105   106     0     0 |
  |-------------------------------------------------|
  | male                      104   105     1     1 |
  +-------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +------------------------------------------------------------------------+
  |                                    has_psc = 0   has_psc = 1   p-value |
  |------------------------------------------------------------------------|
  |                                    N=105         N=106                 |
  |------------------------------------------------------------------------|
  | died_ons_covid_flag_any            53 (50.5%)    60 (56.6%)     0.37   |
  |------------------------------------------------------------------------|
  | died_covid_2020                    7 ( 6.7%)     11 (10.4%)     0.33   |
  |------------------------------------------------------------------------|
  | died_flag                          51 (48.6%)    46 (43.4%)     0.45   |
  |------------------------------------------------------------------------|
  | RECODE of age             0        1 ( 1.0%)     2 ( 1.9%)      0.56   |
  |                           18-<40   29 (27.6%)    39 (36.8%)            |
  |                           40-<50   11 (10.5%)    4 ( 3.8%)             |
  |                           50-<60   18 (17.1%)    15 (14.2%)            |
  |                           60-<70   12 (11.4%)    10 ( 9.4%)            |
  |                           70-<80   14 (13.3%)    9 ( 8.5%)             |
  |                           80+      6 ( 5.7%)     6 ( 5.7%)             |
  |                           7        1 ( 1.0%)     1 ( 0.9%)             |
  |                           8        0 ( 0.0%)     4 ( 3.8%)             |
  |                           9        3 ( 2.9%)     2 ( 1.9%)             |
  |                           10       3 ( 2.9%)     2 ( 1.9%)             |
  |                           11       0 ( 0.0%)     2 ( 1.9%)             |
  |                           12       2 ( 1.9%)     1 ( 0.9%)             |
  |                           13       1 ( 1.0%)     1 ( 0.9%)             |
  |                           14       2 ( 1.9%)     3 ( 2.8%)             |
  |                           15       1 ( 1.0%)     3 ( 2.8%)             |
  |                           16       0 ( 0.0%)     1 ( 0.9%)             |
  |                           17       1 ( 1.0%)     1 ( 0.9%)             |
  |------------------------------------------------------------------------|
  | male                               53 (51.0%)    51 (48.6%)     0.73   |
  +------------------------------------------------------------------------+
Data are presented as n (%).
 
file ./output/tables/udca_only.xlsx saved

. 
. table1_mc, by(has_psc) vars(udca_first cat) saving(./output/tables/udca_first
> _only.xlsx, replace)

  +------------------------------------+
  | factor       N_0   N_1   m_0   m_1 |
  |------------------------------------|
  | udca_first    55    57    50    49 |
  +------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> -------------+
  |                                                     has_psc = 0   has_psc =
>  1   p-value |
  |----------------------------------------------------------------------------
> -------------|
  |                                                     N=105         N=106    
>              |
  |----------------------------------------------------------------------------
> -------------|
  | udca_first   within exposure window                 0 ( 0%)       1 ( 2%)  
>       0.59   |
  |              up to 6 mos before exposure window     2 ( 4%)       1 ( 2%)  
>              |
  |              6 mos to 1 yr before exposure window   0 ( 0%)       1 ( 2%)  
>              |
  |              1 to 2 yr before exposure window       1 ( 2%)       0 ( 0%)  
>              |
  |              3 to 4 yr before exposure window       0 ( 0%)       1 ( 2%)  
>              |
  |              4 to 5 yr before exposure window       2 ( 4%)       1 ( 2%)  
>              |
  |              5+ yr before exposure window           50 (91%)      52 (91%) 
>              |
  +----------------------------------------------------------------------------
> -------------+
Data are presented as n (%).
 
file ./output/tables/udca_first_only.xlsx saved

. 
. * Deaths in those prescribed OBA with PBC 
. keep if has_pbc 
(112 observations deleted)

. table1_mc, by(oba) vars(died_ons_covid_flag_any bin \ died_covid_2020 bin \ d
> ied_flag bin \ agegroup cat \ male bin) saving(./output/tables/oba_only.xlsx,
>  replace) 

  +-------------------------------------------------+
  | factor                    N_0   N_1   m_0   m_1 |
  |-------------------------------------------------|
  | died_ons_covid_flag_any    52    47     0     0 |
  |-------------------------------------------------|
  | died_covid_2020            52    47     0     0 |
  |-------------------------------------------------|
  | died_flag                  52    47     0     0 |
  |-------------------------------------------------|
  | RECODE of age              52    47     0     0 |
  |-------------------------------------------------|
  | male                       51    47     1     0 |
  +-------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +------------------------------------------------------------------+
  |                                    oba = 0    oba = 1    p-value |
  |------------------------------------------------------------------|
  |                                    N=52       N=47               |
  |------------------------------------------------------------------|
  | died_ons_covid_flag_any            27 (52%)   24 (51%)    0.93   |
  |------------------------------------------------------------------|
  | died_covid_2020                    6 (12%)    0 ( 0%)     0.016  |
  |------------------------------------------------------------------|
  | died_flag                          24 (46%)   23 (49%)    0.78   |
  |------------------------------------------------------------------|
  | RECODE of age             18-<40   16 (31%)   15 (32%)    0.23   |
  |                           40-<50   3 ( 6%)    3 ( 6%)            |
  |                           50-<60   7 (13%)    9 (19%)            |
  |                           60-<70   6 (12%)    1 ( 2%)            |
  |                           70-<80   2 ( 4%)    8 (17%)            |
  |                           80+      3 ( 6%)    5 (11%)            |
  |                           8        2 ( 4%)    0 ( 0%)            |
  |                           9        2 ( 4%)    2 ( 4%)            |
  |                           10       2 ( 4%)    1 ( 2%)            |
  |                           11       1 ( 2%)    0 ( 0%)            |
  |                           12       1 ( 2%)    1 ( 2%)            |
  |                           13       1 ( 2%)    0 ( 0%)            |
  |                           14       1 ( 2%)    2 ( 4%)            |
  |                           15       3 ( 6%)    0 ( 0%)            |
  |                           17       2 ( 4%)    0 ( 0%)            |
  |------------------------------------------------------------------|
  | male                               28 (55%)   24 (51%)    0.70   |
  +------------------------------------------------------------------+
Data are presented as n (%).
 
file ./output/tables/oba_only.xlsx saved

. 
. ** Next import the PBC population
. 
. import delimited using ./output/input_pbc.csv, clear
(15 vars, 1,000 obs)

. 
. * Format dates 
. foreach var in udca_last_date udca_first_after udca_first_history died_date_o
> ns {
  2.     gen `var'A = date(`var', "YMD")
  3.     format `var'A %dD/N/CY
  4.     *list `var' `var'A in  1/5
.     drop `var'
  5. }
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)

. 
. /* DEMOGRAPHICS */ 
. 
. * Sex
. gen male = 1 if sex == "M"
(498 missing values generated)

. replace male = 0 if sex == "F"
(492 real changes made)

. 
. /*  Age variables  */ 
. 
. * Create categorised age
. recode age 18/39.9999 = 1 /// 
>            40/49.9999 = 2 ///
>                    50/59.9999 = 3 ///
>                60/69.9999 = 4 ///
>                    70/79.9999 = 5 ///
>                    80/max = 6, gen(agegroup) 
(771 differences between age and agegroup)

. 
. label define agegroup   1 "18-<40" ///
>                                                 2 "40-<50" ///
>                                                 3 "50-<60" ///
>                                                 4 "60-<70" ///
>                                                 5 "70-<80" ///
>                                                 6 "80+"

.                                                 
. label values agegroup agegroup

. 
. /* EXPOSURE INFORMATION ====================================================*
> /
. rename udca_last_date udca_date

. gen udca = 1 if udca_count != . & udca_count >= 2
(801 missing values generated)

. recode udca .=0
(udca: 801 changes made)

. 
. gen udca_sa = 1 if udca_count != . & udca_count >= 1 & udca_date != . & udca_
> date >= mdy(12,1,2019)
(931 missing values generated)

. recode udca_sa .=0
(udca_sa: 931 changes made)

. 
. tab1 udca udca_sa, m

-> tabulation of udca  

       udca |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        801       80.10       80.10
          1 |        199       19.90      100.00
------------+-----------------------------------
      Total |      1,000      100.00

-> tabulation of udca_sa  

    udca_sa |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        931       93.10       93.10
          1 |         69        6.90      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. tab udca udca_sa, m

           |        udca_sa
      udca |         0          1 |     Total
-----------+----------------------+----------
         0 |       784         17 |       801 
         1 |       147         52 |       199 
-----------+----------------------+----------
     Total |       931         69 |     1,000 

. 
. *tab  udca_count udca, m
. 
. * when was first udca Rx before index date
. gen udca_first = 0 if udca == 0
(199 missing values generated)

. replace udca_first = 1 if udca == 1 & udca_first_history >= mdy(9,1,2019) & u
> dca_first_history < mdy(3,1,2020) 
(0 real changes made)

. replace udca_first = 2 if udca == 1 & udca_first_history >= mdy(3,1,2019) & u
> dca_first_history < mdy(9,1,2019) 
(0 real changes made)

. replace udca_first = 3 if udca == 1 & udca_first_history >= mdy(9,1,2018) & u
> dca_first_history < mdy(3,1,2019) 
(0 real changes made)

. replace udca_first = 4 if udca == 1 & udca_first_history >= mdy(9,1,2017) & u
> dca_first_history < mdy(9,1,2018) 
(2 real changes made)

. replace udca_first = 5 if udca == 1 & udca_first_history >= mdy(9,1,2016) & u
> dca_first_history < mdy(9,1,2017) 
(0 real changes made)

. replace udca_first = 6 if udca == 1 & udca_first_history >= mdy(9,1,2015) & u
> dca_first_history < mdy(9,1,2016) 
(0 real changes made)

. replace udca_first = 7 if udca == 1 & udca_first_history >= mdy(9,1,2014) & u
> dca_first_history < mdy(9,1,2015) 
(0 real changes made)

. replace udca_first = 8 if udca == 1 &                                        
>                                      udca_first_history < mdy(9,1,2014) 
(98 real changes made)

. 
. label define udca_first         0 "unexposed"                                
>                            ///
>                                                 1 "within exposure window"   
>                                    ///
>                                                 2 "up to 6 mos before exposur
> e window"          ///
>                                                 3 "6 mos to 1 yr before expos
> ure window"        ///
>                                                 4 "1 to 2 yr before exposure 
> window"            ///
>                                                 5 "2 to 3 yr before exposure 
> window"            ///
>                                                 6 "3 to 4 yr before exposure 
> window"            ///
>                                                 7 "4 to 5 yr before exposure 
> window"            ///
>                                                 8 "5+ yr before exposure wind
> ow"

. label values udca_first udca_first

. 
. * Flag if died
. gen died_flag = died_date_onsA!=.

. * Generate date if died of covid
. gen died_date_onscovid = died_date_onsA if died_ons_covid_flag_any == 1
(753 missing values generated)

. gen died_covid_2020 = (died_date_onscovid<date("31Dec2020", "DMY") & died_fla
> g==1)

. 
. **** Summary INFORMATION
. ** Currently dataset includes all people with a pbc or psc diagnosis, how man
> y have 2+ udca prescription
. * Tabulate pbc or psc diagnosis vs those with 2+ prescriptions in 6 months pr
> ior
. tab udca, m 

       udca |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        801       80.10       80.10
          1 |        199       19.90      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. 
. * Determine number with psc vs pbc with 2+ prescriptions
. tab has_pbc has_psc if udca==1

           |        has_psc
   has_pbc |         0          1 |     Total
-----------+----------------------+----------
         0 |        50         51 |       101 
         1 |        47         51 |        98 
-----------+----------------------+----------
     Total |        97        102 |       199 

. 
. * Tabulating time since first prescription by whether have 2+ prescriptions i
> n the last 6 months
. tab udca_first udca, col m

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |         udca
           udca_first |         0          1 |     Total
----------------------+----------------------+----------
            unexposed |       801          0 |       801 
                      |    100.00       0.00 |     80.10 
----------------------+----------------------+----------
1 to 2 yr before expo |         0          2 |         2 
                      |      0.00       1.01 |      0.20 
----------------------+----------------------+----------
5+ yr before exposure |         0         98 |        98 
                      |      0.00      49.25 |      9.80 
----------------------+----------------------+----------
                    . |         0         99 |        99 
                      |      0.00      49.75 |      9.90 
----------------------+----------------------+----------
                Total |       801        199 |     1,000 
                      |    100.00     100.00 |    100.00 

. 
. * Check number of prescriptions
. bys udca: sum udca_count

-------------------------------------------------------------------------------
-> udca = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  udca_count |        801    .0349563    .2574423         -2          1

-------------------------------------------------------------------------------
-> udca = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  udca_count |        199    3.376884    1.360952          2          8


. 
. * How many COVID-19 deaths by whether had 2+ prescriptions
. tab died_ons_covid_flag_any udca, row col 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

died_ons_c |
ovid_flag_ |         udca
       any |         0          1 |     Total
-----------+----------------------+----------
         0 |       395        105 |       500 
           |     79.00      21.00 |    100.00 
           |     49.31      52.76 |     50.00 
-----------+----------------------+----------
         1 |       406         94 |       500 
           |     81.20      18.80 |    100.00 
           |     50.69      47.24 |     50.00 
-----------+----------------------+----------
     Total |       801        199 |     1,000 
           |     80.10      19.90 |    100.00 
           |    100.00     100.00 |    100.00 

. tab died_covid_2020 udca, row col 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

died_covid |         udca
     _2020 |         0          1 |     Total
-----------+----------------------+----------
         0 |       737        184 |       921 
           |     80.02      19.98 |    100.00 
           |     92.01      92.46 |     92.10 
-----------+----------------------+----------
         1 |        64         15 |        79 
           |     81.01      18.99 |    100.00 
           |      7.99       7.54 |      7.90 
-----------+----------------------+----------
     Total |       801        199 |     1,000 
           |     80.10      19.90 |    100.00 
           |    100.00     100.00 |    100.00 

. tab died_flag udca, row col 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

           |         udca
 died_flag |         0          1 |     Total
-----------+----------------------+----------
         0 |       391        109 |       500 
           |     78.20      21.80 |    100.00 
           |     48.81      54.77 |     50.00 
-----------+----------------------+----------
         1 |       410         90 |       500 
           |     82.00      18.00 |    100.00 
           |     51.19      45.23 |     50.00 
-----------+----------------------+----------
     Total |       801        199 |     1,000 
           |     80.10      19.90 |    100.00 
           |    100.00     100.00 |    100.00 

. 
. 
. * Summary demographics
. tab agegroup udca, row col m 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

 RECODE of |         udca
       age |         0          1 |     Total
-----------+----------------------+----------
         0 |        11          4 |        15 
           |     73.33      26.67 |    100.00 
           |      1.37       2.01 |      1.50 
-----------+----------------------+----------
    18-<40 |       234         52 |       286 
           |     81.82      18.18 |    100.00 
           |     29.21      26.13 |     28.60 
-----------+----------------------+----------
    40-<50 |       112         30 |       142 
           |     78.87      21.13 |    100.00 
           |     13.98      15.08 |     14.20 
-----------+----------------------+----------
    50-<60 |       111         27 |       138 
           |     80.43      19.57 |    100.00 
           |     13.86      13.57 |     13.80 
-----------+----------------------+----------
    60-<70 |        96         20 |       116 
           |     82.76      17.24 |    100.00 
           |     11.99      10.05 |     11.60 
-----------+----------------------+----------
    70-<80 |        78         22 |       100 
           |     78.00      22.00 |    100.00 
           |      9.74      11.06 |     10.00 
-----------+----------------------+----------
       80+ |        48         14 |        62 
           |     77.42      22.58 |    100.00 
           |      5.99       7.04 |      6.20 
-----------+----------------------+----------
         7 |         7          2 |         9 
           |     77.78      22.22 |    100.00 
           |      0.87       1.01 |      0.90 
-----------+----------------------+----------
         8 |        18          2 |        20 
           |     90.00      10.00 |    100.00 
           |      2.25       1.01 |      2.00 
-----------+----------------------+----------
         9 |        10          3 |        13 
           |     76.92      23.08 |    100.00 
           |      1.25       1.51 |      1.30 
-----------+----------------------+----------
        10 |         7          4 |        11 
           |     63.64      36.36 |    100.00 
           |      0.87       2.01 |      1.10 
-----------+----------------------+----------
        11 |        12          5 |        17 
           |     70.59      29.41 |    100.00 
           |      1.50       2.51 |      1.70 
-----------+----------------------+----------
        12 |         8          2 |        10 
           |     80.00      20.00 |    100.00 
           |      1.00       1.01 |      1.00 
-----------+----------------------+----------
        13 |         2          5 |         7 
           |     28.57      71.43 |    100.00 
           |      0.25       2.51 |      0.70 
-----------+----------------------+----------
        14 |         7          1 |         8 
           |     87.50      12.50 |    100.00 
           |      0.87       0.50 |      0.80 
-----------+----------------------+----------
        15 |        13          2 |        15 
           |     86.67      13.33 |    100.00 
           |      1.62       1.01 |      1.50 
-----------+----------------------+----------
        16 |        11          3 |        14 
           |     78.57      21.43 |    100.00 
           |      1.37       1.51 |      1.40 
-----------+----------------------+----------
        17 |        16          1 |        17 
           |     94.12       5.88 |    100.00 
           |      2.00       0.50 |      1.70 
-----------+----------------------+----------
     Total |       801        199 |     1,000 
           |     80.10      19.90 |    100.00 
           |    100.00     100.00 |    100.00 

. tab sex udca, row col m 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

           |         udca
       sex |         0          1 |     Total
-----------+----------------------+----------
         F |       407         85 |       492 
           |     82.72      17.28 |    100.00 
           |     50.81      42.71 |     49.20 
-----------+----------------------+----------
         M |       390        112 |       502 
           |     77.69      22.31 |    100.00 
           |     48.69      56.28 |     50.20 
-----------+----------------------+----------
         U |         4          2 |         6 
           |     66.67      33.33 |    100.00 
           |      0.50       1.01 |      0.60 
-----------+----------------------+----------
     Total |       801        199 |     1,000 
           |     80.10      19.90 |    100.00 
           |    100.00     100.00 |    100.00 

. tab oba udca, row col m 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

           |         udca
       oba |         0          1 |     Total
-----------+----------------------+----------
         0 |       401         99 |       500 
           |     80.20      19.80 |    100.00 
           |     50.06      49.75 |     50.00 
-----------+----------------------+----------
         1 |       400        100 |       500 
           |     80.00      20.00 |    100.00 
           |     49.94      50.25 |     50.00 
-----------+----------------------+----------
     Total |       801        199 |     1,000 
           |     80.10      19.90 |    100.00 
           |    100.00     100.00 |    100.00 

. 
. * Export to table 
. * First drop out categories that will not be in real data > should be zero on
>  server
. drop if agegroup<1 | agegroup>6
(156 observations deleted)

. table1_mc, by(udca) vars(has_pbc bin \ died_ons_covid_flag_any bin \ died_cov
> id_2020 bin \ died_flag bin \ agegroup cat \ male bin) saving(./output/tables
> /udca_pbc.xlsx, replace)

  +-------------------------------------------------+
  | factor                    N_0   N_1   m_0   m_1 |
  |-------------------------------------------------|
  | has_pbc                   679   165     0     0 |
  |-------------------------------------------------|
  | died_ons_covid_flag_any   679   165     0     0 |
  |-------------------------------------------------|
  | died_covid_2020           679   165     0     0 |
  |-------------------------------------------------|
  | died_flag                 679   165     0     0 |
  |-------------------------------------------------|
  | RECODE of age             679   165     0     0 |
  |-------------------------------------------------|
  | male                      676   163     3     2 |
  +-------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +-----------------------------------------------------------------------+
  |                                    udca = 0      udca = 1     p-value |
  |-----------------------------------------------------------------------|
  |                                    N=679         N=165                |
  |-----------------------------------------------------------------------|
  | has_pbc                            339 (49.9%)   84 (50.9%)    0.82   |
  |-----------------------------------------------------------------------|
  | died_ons_covid_flag_any            350 (51.5%)   80 (48.5%)    0.48   |
  |-----------------------------------------------------------------------|
  | died_covid_2020                    57 ( 8.4%)    14 ( 8.5%)    0.97   |
  |-----------------------------------------------------------------------|
  | died_flag                          347 (51.1%)   74 (44.8%)    0.15   |
  |-----------------------------------------------------------------------|
  | RECODE of age             18-<40   234 (34.5%)   52 (31.5%)    0.89   |
  |                           40-<50   112 (16.5%)   30 (18.2%)           |
  |                           50-<60   111 (16.3%)   27 (16.4%)           |
  |                           60-<70   96 (14.1%)    20 (12.1%)           |
  |                           70-<80   78 (11.5%)    22 (13.3%)           |
  |                           80+      48 ( 7.1%)    14 ( 8.5%)           |
  |-----------------------------------------------------------------------|
  | male                               341 (50.4%)   97 (59.5%)    0.038  |
  +-----------------------------------------------------------------------+
Data are presented as n (%).
 
file ./output/tables/udca_pbc.xlsx saved

. 
. foreach var in all only pbc first_only {
  2.         import excel using ./output/tables/udca_`var'.xlsx, clear
  3.         export delimited using ./output/tables/udca_`var'.csv, replace 
  4. }
(12 vars, 3 obs)
(note: file ./output/tables/udca_all.csv not found)
file ./output/tables/udca_all.csv saved
(13 vars, 24 obs)
(note: file ./output/tables/udca_only.csv not found)
file ./output/tables/udca_only.csv saved
(13 vars, 13 obs)
(note: file ./output/tables/udca_pbc.csv not found)
file ./output/tables/udca_pbc.csv saved
(13 vars, 9 obs)
(note: file ./output/tables/udca_first_only.csv not found)
file ./output/tables/udca_first_only.csv saved

. 
. import excel using ./output/tables/oba_only.xlsx, clear 
(13 vars, 21 obs)

. export delimited using ./output/tables/oba_only.csv, replace 
(note: file ./output/tables/oba_only.csv not found)
file ./output/tables/oba_only.csv saved

. 
. 
. 
. 
end of do-file

. . file open output using "/tmp/feasibility.do.Pg9G.out", write text replace

. . file write output "success" 

. . file close output

. 
end of do-file


