
. 
. ** First import udca population
. import delimited using ./output/input.csv
(12 vars, 1,000 obs)

. 
. * Format dates 
. foreach var in udca_last_date udca_first_after udca_first_history died_date_o
> ns {
  2.     gen `var'A = date(`var', "YMD")
  3.     format `var'A %dD/N/CY
  4.     list `var' `var'A in  1/5
  5.     drop `var'
  6. }
(500 missing values generated)

     +-------------------------+
     | udca_las~e   udca_las~A |
     |-------------------------|
  1. |                       . |
  2. |                       . |
  3. | 2020-02-26   26/02/2020 |
  4. | 2020-02-05   05/02/2020 |
  5. | 2019-12-26   26/12/2019 |
     +-------------------------+
(500 missing values generated)

     +-------------------------+
     | udca_fir~r   udca_fir~A |
     |-------------------------|
  1. |                       . |
  2. | 2020-04-15   15/04/2020 |
  3. |                       . |
  4. | 2021-09-10   10/09/2021 |
  5. |                       . |
     +-------------------------+
(500 missing values generated)

     +-------------------------+
     | udca_fir~y   udca_fi~yA |
     |-------------------------|
  1. |                       . |
  2. | 1991-09-30   30/09/1991 |
  3. |                       . |
  4. | 1992-05-01   01/05/1992 |
  5. |                       . |
     +-------------------------+
(500 missing values generated)

     +-------------------------+
     | died_dat~s   died_dat~A |
     |-------------------------|
  1. |                       . |
  2. | 2022-03-06   06/03/2022 |
  3. |                       . |
  4. |                       . |
  5. | 2022-12-14   14/12/2022 |
     +-------------------------+

. 
. /* DEMOGRAPHICS */ 
. 
. * Sex
. gen male = 1 if sex == "M"
(529 missing values generated)

. replace male = 0 if sex == "F"
(512 real changes made)

. 
. /*  Age variables  */ 
. 
. * Create categorised age
. recode age 18/39.9999 = 1 /// 
>            40/49.9999 = 2 ///
>                    50/59.9999 = 3 ///
>                60/69.9999 = 4 ///
>                    70/79.9999 = 5 ///
>                    80/max = 6, gen(agegroup) 
(760 differences between age and agegroup)

. 
. label define agegroup   1 "18-<40" ///
>                                                 2 "40-<50" ///
>                                                 3 "50-<60" ///
>                                                 4 "60-<70" ///
>                                                 5 "70-<80" ///
>                                                 6 "80+"

.                                                 
. label values agegroup agegroup

. 
. /* EXPOSURE INFORMATION ====================================================*
> /
. rename udca_last_date udca_date

. gen udca = 1 if udca_count != . & udca_count >= 2
(792 missing values generated)

. recode udca .=0
(udca: 792 changes made)

. 
. gen udca_sa = 1 if udca_count != . & udca_count >= 1 & udca_date != . & udca_
> date >= mdy(12,1,2019)
(946 missing values generated)

. recode udca_sa .=0
(udca_sa: 946 changes made)

. 
. tab1 udca udca_sa, m

-> tabulation of udca  

       udca |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        792       79.20       79.20
          1 |        208       20.80      100.00
------------+-----------------------------------
      Total |      1,000      100.00

-> tabulation of udca_sa  

    udca_sa |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        946       94.60       94.60
          1 |         54        5.40      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. tab udca udca_sa, m

           |        udca_sa
      udca |         0          1 |     Total
-----------+----------------------+----------
         0 |       781         11 |       792 
         1 |       165         43 |       208 
-----------+----------------------+----------
     Total |       946         54 |     1,000 

. 
. tab  udca_count udca, m

           |         udca
udca_count |         0          1 |     Total
-----------+----------------------+----------
        -2 |         2          0 |         2 
        -1 |         6          0 |         6 
         0 |       738          0 |       738 
         1 |        46          0 |        46 
         2 |         0         55 |        55 
         3 |         0         59 |        59 
         4 |         0         47 |        47 
         5 |         0         25 |        25 
         6 |         0         17 |        17 
         7 |         0          2 |         2 
         8 |         0          2 |         2 
         9 |         0          1 |         1 
-----------+----------------------+----------
     Total |       792        208 |     1,000 

. 
. * when was first udca Rx before index date
. gen udca_first = 0 if udca == 0
(208 missing values generated)

. replace udca_first = 1 if udca == 1 & udca_first_history >= mdy(9,1,2019) & u
> dca_first_history < mdy(3,1,2020) 
(0 real changes made)

. replace udca_first = 2 if udca == 1 & udca_first_history >= mdy(3,1,2019) & u
> dca_first_history < mdy(9,1,2019) 
(1 real change made)

. replace udca_first = 3 if udca == 1 & udca_first_history >= mdy(9,1,2018) & u
> dca_first_history < mdy(3,1,2019) 
(0 real changes made)

. replace udca_first = 4 if udca == 1 & udca_first_history >= mdy(9,1,2017) & u
> dca_first_history < mdy(9,1,2018) 
(1 real change made)

. replace udca_first = 5 if udca == 1 & udca_first_history >= mdy(9,1,2016) & u
> dca_first_history < mdy(9,1,2017) 
(0 real changes made)

. replace udca_first = 6 if udca == 1 & udca_first_history >= mdy(9,1,2015) & u
> dca_first_history < mdy(9,1,2016) 
(0 real changes made)

. replace udca_first = 7 if udca == 1 & udca_first_history >= mdy(9,1,2014) & u
> dca_first_history < mdy(9,1,2015) 
(0 real changes made)

. replace udca_first = 8 if udca == 1 &                                        
>                                      udca_first_history < mdy(9,1,2014) 
(109 real changes made)

. 
. label define udca_first         0 "unexposed"                                
>                            ///
>                                                 1 "within exposure window"   
>                                    ///
>                                                 2 "up to 6 mos before exposur
> e window"          ///
>                                                 3 "6 mos to 1 yr before expos
> ure window"        ///
>                                                 4 "1 to 2 yr before exposure 
> window"            ///
>                                                 5 "2 to 3 yr before exposure 
> window"            ///
>                                                 6 "3 to 4 yr before exposure 
> window"            ///
>                                                 7 "4 to 5 yr before exposure 
> window"            ///
>                                                 8 "5+ yr before exposure wind
> ow"

. label values udca_first udca_first

. tab udca_first udca, m

                      |         udca
           udca_first |         0          1 |     Total
----------------------+----------------------+----------
            unexposed |       792          0 |       792 
up to 6 mos before ex |         0          1 |         1 
1 to 2 yr before expo |         0          1 |         1 
5+ yr before exposure |         0        109 |       109 
                    . |         0         97 |        97 
----------------------+----------------------+----------
                Total |       792        208 |     1,000 

. 
. * Flag if died
. gen died_flag = died_date_onsA!=.

. * Generate date if died of covid
. gen died_date_onscovid = died_date_onsA if died_ons_covid_flag_any == 1
(749 missing values generated)

. 
. **** Summary INFORMATION
. ** Currently dataset includes all people with at least one udca prescription
. * Tabulate pbc diagnosis vs those with 2+ prescriptions in 6 months prior
. tab has_pbc udca, m 

           |         udca
   has_pbc |         0          1 |     Total
-----------+----------------------+----------
         0 |       400        100 |       500 
         1 |       392        108 |       500 
-----------+----------------------+----------
     Total |       792        208 |     1,000 

. 
. * How many COVID-19 deaths in those with pbc and 2+ prescriptions
. tab died_ons_covid_flag_any if has_pbc==1 & udca==1

died_ons_co |
vid_flag_an |
          y |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         57       52.78       52.78
          1 |         51       47.22      100.00
------------+-----------------------------------
      Total |        108      100.00

. 
. ** Next import the PBC population
. 
. import delimited using ./output/input_pbc.csv, clear
(12 vars, 1,000 obs)

. 
. * Format dates 
. foreach var in udca_last_date udca_first_after udca_first_history died_date_o
> ns {
  2.     gen `var'A = date(`var', "YMD")
  3.     format `var'A %dD/N/CY
  4.     list `var' `var'A in  1/5
  5.     drop `var'
  6. }
(500 missing values generated)

     +-------------------------+
     | udca_las~e   udca_las~A |
     |-------------------------|
  1. | 2019-11-19   19/11/2019 |
  2. |                       . |
  3. |                       . |
  4. | 2019-10-17   17/10/2019 |
  5. |                       . |
     +-------------------------+
(500 missing values generated)

     +-------------------------+
     | udca_fir~r   udca_fir~A |
     |-------------------------|
  1. | 2022-02-02   02/02/2022 |
  2. |                       . |
  3. |                       . |
  4. | 2020-12-17   17/12/2020 |
  5. |                       . |
     +-------------------------+
(500 missing values generated)

     +-------------------------+
     | udca_fir~y   udca_fi~yA |
     |-------------------------|
  1. |                       . |
  2. |                       . |
  3. |                       . |
  4. | 1925-05-04   04/05/1925 |
  5. | 1903-11-03   03/11/1903 |
     +-------------------------+
(500 missing values generated)

     +-------------------------+
     | died_dat~s   died_dat~A |
     |-------------------------|
  1. | 2020-11-19   19/11/2020 |
  2. |                       . |
  3. |                       . |
  4. |                       . |
  5. |                       . |
     +-------------------------+

. 
. /* DEMOGRAPHICS */ 
. 
. * Sex
. gen male = 1 if sex == "M"
(527 missing values generated)

. replace male = 0 if sex == "F"
(517 real changes made)

. 
. /*  Age variables  */ 
. 
. * Create categorised age
. recode age 18/39.9999 = 1 /// 
>            40/49.9999 = 2 ///
>                    50/59.9999 = 3 ///
>                60/69.9999 = 4 ///
>                    70/79.9999 = 5 ///
>                    80/max = 6, gen(agegroup) 
(807 differences between age and agegroup)

. 
. label define agegroup   1 "18-<40" ///
>                                                 2 "40-<50" ///
>                                                 3 "50-<60" ///
>                                                 4 "60-<70" ///
>                                                 5 "70-<80" ///
>                                                 6 "80+"

.                                                 
. label values agegroup agegroup

. 
. /* EXPOSURE INFORMATION ====================================================*
> /
. rename udca_last_date udca_date

. gen udca = 1 if udca_count != . & udca_count >= 2
(798 missing values generated)

. recode udca .=0
(udca: 798 changes made)

. 
. gen udca_sa = 1 if udca_count != . & udca_count >= 1 & udca_date != . & udca_
> date >= mdy(12,1,2019)
(939 missing values generated)

. recode udca_sa .=0
(udca_sa: 939 changes made)

. 
. tab1 udca udca_sa, m

-> tabulation of udca  

       udca |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        798       79.80       79.80
          1 |        202       20.20      100.00
------------+-----------------------------------
      Total |      1,000      100.00

-> tabulation of udca_sa  

    udca_sa |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        939       93.90       93.90
          1 |         61        6.10      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. tab udca udca_sa, m

           |        udca_sa
      udca |         0          1 |     Total
-----------+----------------------+----------
         0 |       786         12 |       798 
         1 |       153         49 |       202 
-----------+----------------------+----------
     Total |       939         61 |     1,000 

. 
. tab  udca_count udca, m

           |         udca
udca_count |         0          1 |     Total
-----------+----------------------+----------
        -3 |         1          0 |         1 
        -2 |         1          0 |         1 
        -1 |         3          0 |         3 
         0 |       738          0 |       738 
         1 |        55          0 |        55 
         2 |         0         59 |        59 
         3 |         0         48 |        48 
         4 |         0         53 |        53 
         5 |         0         22 |        22 
         6 |         0         14 |        14 
         7 |         0          4 |         4 
         8 |         0          2 |         2 
-----------+----------------------+----------
     Total |       798        202 |     1,000 

. 
. * when was first udca Rx before index date
. gen udca_first = 0 if udca == 0
(202 missing values generated)

. replace udca_first = 1 if udca == 1 & udca_first_history >= mdy(9,1,2019) & u
> dca_first_history < mdy(3,1,2020) 
(0 real changes made)

. replace udca_first = 2 if udca == 1 & udca_first_history >= mdy(3,1,2019) & u
> dca_first_history < mdy(9,1,2019) 
(2 real changes made)

. replace udca_first = 3 if udca == 1 & udca_first_history >= mdy(9,1,2018) & u
> dca_first_history < mdy(3,1,2019) 
(1 real change made)

. replace udca_first = 4 if udca == 1 & udca_first_history >= mdy(9,1,2017) & u
> dca_first_history < mdy(9,1,2018) 
(2 real changes made)

. replace udca_first = 5 if udca == 1 & udca_first_history >= mdy(9,1,2016) & u
> dca_first_history < mdy(9,1,2017) 
(1 real change made)

. replace udca_first = 6 if udca == 1 & udca_first_history >= mdy(9,1,2015) & u
> dca_first_history < mdy(9,1,2016) 
(1 real change made)

. replace udca_first = 7 if udca == 1 & udca_first_history >= mdy(9,1,2014) & u
> dca_first_history < mdy(9,1,2015) 
(1 real change made)

. replace udca_first = 8 if udca == 1 &                                        
>                                      udca_first_history < mdy(9,1,2014) 
(94 real changes made)

. 
. label define udca_first         0 "unexposed"                                
>                            ///
>                                                 1 "within exposure window"   
>                                    ///
>                                                 2 "up to 6 mos before exposur
> e window"          ///
>                                                 3 "6 mos to 1 yr before expos
> ure window"        ///
>                                                 4 "1 to 2 yr before exposure 
> window"            ///
>                                                 5 "2 to 3 yr before exposure 
> window"            ///
>                                                 6 "3 to 4 yr before exposure 
> window"            ///
>                                                 7 "4 to 5 yr before exposure 
> window"            ///
>                                                 8 "5+ yr before exposure wind
> ow"

. label values udca_first udca_first

. tab udca_first udca, m

                      |         udca
           udca_first |         0          1 |     Total
----------------------+----------------------+----------
            unexposed |       798          0 |       798 
up to 6 mos before ex |         0          2 |         2 
6 mos to 1 yr before  |         0          1 |         1 
1 to 2 yr before expo |         0          2 |         2 
2 to 3 yr before expo |         0          1 |         1 
3 to 4 yr before expo |         0          1 |         1 
4 to 5 yr before expo |         0          1 |         1 
5+ yr before exposure |         0         94 |        94 
                    . |         0        100 |       100 
----------------------+----------------------+----------
                Total |       798        202 |     1,000 

. 
. * Flag if died
. gen died_flag = died_date_onsA!=.

. * Generate date if died of covid
. gen died_date_onscovid = died_date_ons if died_ons_covid_flag_any == 1
(752 missing values generated)

. 
. **** Summary INFORMATION
. ** Currently dataset includes all people with a pbc diagnosis, how many have 
> 2+ udca prescription
. * Tabulate pbc diagnosis vs those with 2+ prescriptions in 6 months prior
. tab udca, m 

       udca |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        798       79.80       79.80
          1 |        202       20.20      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. 
. * How many COVID-19 deaths by whether had 2+ prescriptions
. tab died_ons_covid_flag_any udca

died_ons_c |
ovid_flag_ |         udca
       any |         0          1 |     Total
-----------+----------------------+----------
         0 |       397        103 |       500 
         1 |       401         99 |       500 
-----------+----------------------+----------
     Total |       798        202 |     1,000 

. 
. * Summary demographics
. tab agegroup udca, m 

 RECODE of |         udca
       age |         0          1 |     Total
-----------+----------------------+----------
         0 |        11          0 |        11 
    18-<40 |       245         64 |       309 
    40-<50 |       117         26 |       143 
    50-<60 |       112         29 |       141 
    60-<70 |        88         33 |       121 
    70-<80 |        86         19 |       105 
       80+ |        49          9 |        58 
         7 |         5          0 |         5 
         8 |         6          3 |         9 
         9 |         7          2 |         9 
        10 |        12          3 |        15 
        11 |        11          2 |        13 
        12 |         8          4 |        12 
        13 |         9          1 |        10 
        14 |         6          3 |         9 
        15 |         6          2 |         8 
        16 |         9          1 |        10 
        17 |        11          1 |        12 
-----------+----------------------+----------
     Total |       798        202 |     1,000 

. tab sex udca, m 

           |         udca
       sex |         0          1 |     Total
-----------+----------------------+----------
         F |       422         95 |       517 
         M |       368        105 |       473 
         U |         8          2 |        10 
-----------+----------------------+----------
     Total |       798        202 |     1,000 

. 
. 
. 
. 
. 
end of do-file

. . file open output using "/tmp/tmp.CUICD1kr8V", write text replace

. . file write output "success" 

. . file close output

. 
end of do-file


