
. 
. cap mkdir ./output/tables/

. 
. ** First import udca population
. import delimited using ./output/input.csv
(12 vars, 1,000 obs)

. 
. * Format dates 
. foreach var in udca_last_date udca_first_after udca_first_history died_date_o
> ns {
  2.     gen `var'A = date(`var', "YMD")
  3.     format `var'A %dD/N/CY
  4.     *list `var' `var'A in  1/5
.     drop `var'
  5. }
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)

. 
. /* DEMOGRAPHICS */ 
. 
. * Sex
. gen male = 1 if sex == "M"
(529 missing values generated)

. replace male = 0 if sex == "F"
(512 real changes made)

. 
. /*  Age variables  */ 
. 
. * Create categorised age
. recode age 18/39.9999 = 1 /// 
>            40/49.9999 = 2 ///
>                    50/59.9999 = 3 ///
>                60/69.9999 = 4 ///
>                    70/79.9999 = 5 ///
>                    80/max = 6, gen(agegroup) 
(760 differences between age and agegroup)

. 
. label define agegroup   1 "18-<40" ///
>                                                 2 "40-<50" ///
>                                                 3 "50-<60" ///
>                                                 4 "60-<70" ///
>                                                 5 "70-<80" ///
>                                                 6 "80+"

.                                                 
. label values agegroup agegroup

. 
. /* EXPOSURE INFORMATION ====================================================*
> /
. rename udca_last_date udca_date

. gen udca = 1 if udca_count != . & udca_count >= 2
(792 missing values generated)

. recode udca .=0
(udca: 792 changes made)

. 
. gen udca_sa = 1 if udca_count != . & udca_count >= 1 & udca_date != . & udca_
> date >= mdy(12,1,2019)
(946 missing values generated)

. recode udca_sa .=0
(udca_sa: 946 changes made)

. 
. tab1 udca udca_sa, m

-> tabulation of udca  

       udca |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        792       79.20       79.20
          1 |        208       20.80      100.00
------------+-----------------------------------
      Total |      1,000      100.00

-> tabulation of udca_sa  

    udca_sa |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        946       94.60       94.60
          1 |         54        5.40      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. tab udca udca_sa, m

           |        udca_sa
      udca |         0          1 |     Total
-----------+----------------------+----------
         0 |       781         11 |       792 
         1 |       165         43 |       208 
-----------+----------------------+----------
     Total |       946         54 |     1,000 

. 
. *tab  udca_count udca, m
. 
. * when was first udca Rx before index date
. gen udca_first = 0 if udca == 0
(208 missing values generated)

. replace udca_first = 1 if udca == 1 & udca_first_history >= mdy(9,1,2019) & u
> dca_first_history < mdy(3,1,2020) 
(0 real changes made)

. replace udca_first = 2 if udca == 1 & udca_first_history >= mdy(3,1,2019) & u
> dca_first_history < mdy(9,1,2019) 
(1 real change made)

. replace udca_first = 3 if udca == 1 & udca_first_history >= mdy(9,1,2018) & u
> dca_first_history < mdy(3,1,2019) 
(0 real changes made)

. replace udca_first = 4 if udca == 1 & udca_first_history >= mdy(9,1,2017) & u
> dca_first_history < mdy(9,1,2018) 
(1 real change made)

. replace udca_first = 5 if udca == 1 & udca_first_history >= mdy(9,1,2016) & u
> dca_first_history < mdy(9,1,2017) 
(0 real changes made)

. replace udca_first = 6 if udca == 1 & udca_first_history >= mdy(9,1,2015) & u
> dca_first_history < mdy(9,1,2016) 
(0 real changes made)

. replace udca_first = 7 if udca == 1 & udca_first_history >= mdy(9,1,2014) & u
> dca_first_history < mdy(9,1,2015) 
(0 real changes made)

. replace udca_first = 8 if udca == 1 &                                        
>                                      udca_first_history < mdy(9,1,2014) 
(109 real changes made)

. 
. label define udca_first         0 "unexposed"                                
>                            ///
>                                                 1 "within exposure window"   
>                                    ///
>                                                 2 "up to 6 mos before exposur
> e window"          ///
>                                                 3 "6 mos to 1 yr before expos
> ure window"        ///
>                                                 4 "1 to 2 yr before exposure 
> window"            ///
>                                                 5 "2 to 3 yr before exposure 
> window"            ///
>                                                 6 "3 to 4 yr before exposure 
> window"            ///
>                                                 7 "4 to 5 yr before exposure 
> window"            ///
>                                                 8 "5+ yr before exposure wind
> ow"

. label values udca_first udca_first

. 
. * Flag if died
. gen died_flag = died_date_onsA!=.

. * Generate date if died of covid
. gen died_date_onscovid = died_date_onsA if died_ons_covid_flag_any == 1
(749 missing values generated)

. 
. gen died_covid_2020 = (died_date_onscovid<date("31Dec2020", "DMY") & died_fla
> g==1)

. 
. **** Summary INFORMATION
. ** Currently dataset includes all people with at least one udca prescription
. * Tabulate pbc diagnosis vs those with 2+ prescriptions in 6 months prior
. tab has_pbc udca, m 

           |         udca
   has_pbc |         0          1 |     Total
-----------+----------------------+----------
         0 |       400        100 |       500 
         1 |       392        108 |       500 
-----------+----------------------+----------
     Total |       792        208 |     1,000 

. 
. * Tabulating time since first prescription by whether have 2+ prescriptions i
> n the last 6 months
. tab udca_first udca, m col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |         udca
           udca_first |         0          1 |     Total
----------------------+----------------------+----------
            unexposed |       792          0 |       792 
                      |    100.00       0.00 |     79.20 
----------------------+----------------------+----------
up to 6 mos before ex |         0          1 |         1 
                      |      0.00       0.48 |      0.10 
----------------------+----------------------+----------
1 to 2 yr before expo |         0          1 |         1 
                      |      0.00       0.48 |      0.10 
----------------------+----------------------+----------
5+ yr before exposure |         0        109 |       109 
                      |      0.00      52.40 |     10.90 
----------------------+----------------------+----------
                    . |         0         97 |        97 
                      |      0.00      46.63 |      9.70 
----------------------+----------------------+----------
                Total |       792        208 |     1,000 
                      |    100.00     100.00 |    100.00 

. 
. bys udca: sum udca_count

-------------------------------------------------------------------------------
-> udca = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  udca_count |        792    .0454545    .2716332         -2          1

-------------------------------------------------------------------------------
-> udca = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  udca_count |        208      3.5625     1.40253          2          9


. 
. * Export to table 
. preserve

. table1_mc, by(udca) vars(has_pbc bin \ udca_first cate) saving(./output/table
> s/udca_all.xlsx, replace)

  +------------------------------------+
  | factor       N_0   N_1   m_0   m_1 |
  |------------------------------------|
  | has_pbc      792   208     0     0 |
  |------------------------------------|
  | udca_first   792   111     0    97 |
  +------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> ------------+
  |                                                   udca = 0       udca = 1  
>     p-value |
  |----------------------------------------------------------------------------
> ------------|
  |                                                   N=792          N=208     
>             |
  |----------------------------------------------------------------------------
> ------------|
  | has_pbc                                           392 (49.5%)    108 (51.9%
> )    0.53   |
  |----------------------------------------------------------------------------
> ------------|
  | udca_first   unexposed                            792 (100.0%)   0 ( 0.0%) 
>     <0.001  |
  |              up to 6 mos before exposure window   0 ( 0.0%)      1 ( 0.9%) 
>             |
  |              1 to 2 yr before exposure window     0 ( 0.0%)      1 ( 0.9%) 
>             |
  |              5+ yr before exposure window         0 ( 0.0%)      109 (98.2%
> )           |
  +----------------------------------------------------------------------------
> ------------+
Data are presented as n (%).
 
file ./output/tables/udca_all.xlsx saved

. restore 

. 
. * How many COVID-19 deaths in those with pbc and 2+ prescriptions
. tab died_ons_covid_flag_any has_pbc if udca==1, row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

died_ons_c |
ovid_flag_ |        has_pbc
       any |         0          1 |     Total
-----------+----------------------+----------
         0 |        45         57 |       102 
           |     44.12      55.88 |    100.00 
-----------+----------------------+----------
         1 |        55         51 |       106 
           |     51.89      48.11 |    100.00 
-----------+----------------------+----------
     Total |       100        108 |       208 
           |     48.08      51.92 |    100.00 

. tab died_covid_2020 has_pbc if udca==1, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

died_covid |        has_pbc
     _2020 |         0          1 |     Total
-----------+----------------------+----------
         0 |        92         98 |       190 
           |     48.42      51.58 |    100.00 
           |     92.00      90.74 |     91.35 
-----------+----------------------+----------
         1 |         8         10 |        18 
           |     44.44      55.56 |    100.00 
           |      8.00       9.26 |      8.65 
-----------+----------------------+----------
     Total |       100        108 |       208 
           |     48.08      51.92 |    100.00 
           |    100.00     100.00 |    100.00 

. tab died_flag has_pbc if udca==1, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

           |        has_pbc
 died_flag |         0          1 |     Total
-----------+----------------------+----------
         0 |        49         48 |        97 
           |     50.52      49.48 |    100.00 
           |     49.00      44.44 |     46.63 
-----------+----------------------+----------
         1 |        51         60 |       111 
           |     45.95      54.05 |    100.00 
           |     51.00      55.56 |     53.37 
-----------+----------------------+----------
     Total |       100        108 |       208 
           |     48.08      51.92 |    100.00 
           |    100.00     100.00 |    100.00 

. 
. * Summary demographics
. tab agegroup has_pbc if udca==1, row col m 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

 RECODE of |        has_pbc
       age |         0          1 |     Total
-----------+----------------------+----------
         0 |         1          0 |         1 
           |    100.00       0.00 |    100.00 
           |      1.00       0.00 |      0.48 
-----------+----------------------+----------
    18-<40 |        38         25 |        63 
           |     60.32      39.68 |    100.00 
           |     38.00      23.15 |     30.29 
-----------+----------------------+----------
    40-<50 |        15         20 |        35 
           |     42.86      57.14 |    100.00 
           |     15.00      18.52 |     16.83 
-----------+----------------------+----------
    50-<60 |         9         15 |        24 
           |     37.50      62.50 |    100.00 
           |      9.00      13.89 |     11.54 
-----------+----------------------+----------
    60-<70 |         8         11 |        19 
           |     42.11      57.89 |    100.00 
           |      8.00      10.19 |      9.13 
-----------+----------------------+----------
    70-<80 |         7         11 |        18 
           |     38.89      61.11 |    100.00 
           |      7.00      10.19 |      8.65 
-----------+----------------------+----------
       80+ |         7          6 |        13 
           |     53.85      46.15 |    100.00 
           |      7.00       5.56 |      6.25 
-----------+----------------------+----------
         7 |         1          0 |         1 
           |    100.00       0.00 |    100.00 
           |      1.00       0.00 |      0.48 
-----------+----------------------+----------
         8 |         1          3 |         4 
           |     25.00      75.00 |    100.00 
           |      1.00       2.78 |      1.92 
-----------+----------------------+----------
         9 |         1          3 |         4 
           |     25.00      75.00 |    100.00 
           |      1.00       2.78 |      1.92 
-----------+----------------------+----------
        10 |         2          3 |         5 
           |     40.00      60.00 |    100.00 
           |      2.00       2.78 |      2.40 
-----------+----------------------+----------
        11 |         3          2 |         5 
           |     60.00      40.00 |    100.00 
           |      3.00       1.85 |      2.40 
-----------+----------------------+----------
        12 |         2          2 |         4 
           |     50.00      50.00 |    100.00 
           |      2.00       1.85 |      1.92 
-----------+----------------------+----------
        13 |         0          1 |         1 
           |      0.00     100.00 |    100.00 
           |      0.00       0.93 |      0.48 
-----------+----------------------+----------
        14 |         1          0 |         1 
           |    100.00       0.00 |    100.00 
           |      1.00       0.00 |      0.48 
-----------+----------------------+----------
        15 |         1          2 |         3 
           |     33.33      66.67 |    100.00 
           |      1.00       1.85 |      1.44 
-----------+----------------------+----------
        16 |         2          1 |         3 
           |     66.67      33.33 |    100.00 
           |      2.00       0.93 |      1.44 
-----------+----------------------+----------
        17 |         1          3 |         4 
           |     25.00      75.00 |    100.00 
           |      1.00       2.78 |      1.92 
-----------+----------------------+----------
     Total |       100        108 |       208 
           |     48.08      51.92 |    100.00 
           |    100.00     100.00 |    100.00 

. tab sex has_pbc if udca==1, row col m 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

           |        has_pbc
       sex |         0          1 |     Total
-----------+----------------------+----------
         F |        57         51 |       108 
           |     52.78      47.22 |    100.00 
           |     57.00      47.22 |     51.92 
-----------+----------------------+----------
         M |        43         56 |        99 
           |     43.43      56.57 |    100.00 
           |     43.00      51.85 |     47.60 
-----------+----------------------+----------
         U |         0          1 |         1 
           |      0.00     100.00 |    100.00 
           |      0.00       0.93 |      0.48 
-----------+----------------------+----------
     Total |       100        108 |       208 
           |     48.08      51.92 |    100.00 
           |    100.00     100.00 |    100.00 

. 
. * Export to table 
. keep if udca==1
(792 observations deleted)

. table1_mc, by(has_pbc) vars(died_ons_covid_flag_any bin \ died_covid_2020 bin
>  \ died_flag bin \ agegroup cate \ male bin) saving(./output/tables/udca_only
> .xlsx, replace)

  +-------------------------------------------------+
  | factor                    N_0   N_1   m_0   m_1 |
  |-------------------------------------------------|
  | died_ons_covid_flag_any   100   108     0     0 |
  |-------------------------------------------------|
  | died_covid_2020           100   108     0     0 |
  |-------------------------------------------------|
  | died_flag                 100   108     0     0 |
  |-------------------------------------------------|
  | RECODE of age             100   108     0     0 |
  |-------------------------------------------------|
  | male                      100   107     0     1 |
  +-------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +------------------------------------------------------------------------+
  |                                    has_pbc = 0   has_pbc = 1   p-value |
  |------------------------------------------------------------------------|
  |                                    N=100         N=108                 |
  |------------------------------------------------------------------------|
  | died_ons_covid_flag_any            55 (55.0%)    51 (47.2%)     0.26   |
  |------------------------------------------------------------------------|
  | died_covid_2020                    8 ( 8.0%)     10 ( 9.3%)     0.75   |
  |------------------------------------------------------------------------|
  | died_flag                          51 (51.0%)    60 (55.6%)     0.51   |
  |------------------------------------------------------------------------|
  | RECODE of age             0        1 ( 1.0%)     0 ( 0.0%)      0.70   |
  |                           18-<40   38 (38.0%)    25 (23.1%)            |
  |                           40-<50   15 (15.0%)    20 (18.5%)            |
  |                           50-<60   9 ( 9.0%)     15 (13.9%)            |
  |                           60-<70   8 ( 8.0%)     11 (10.2%)            |
  |                           70-<80   7 ( 7.0%)     11 (10.2%)            |
  |                           80+      7 ( 7.0%)     6 ( 5.6%)             |
  |                           7        1 ( 1.0%)     0 ( 0.0%)             |
  |                           8        1 ( 1.0%)     3 ( 2.8%)             |
  |                           9        1 ( 1.0%)     3 ( 2.8%)             |
  |                           10       2 ( 2.0%)     3 ( 2.8%)             |
  |                           11       3 ( 3.0%)     2 ( 1.9%)             |
  |                           12       2 ( 2.0%)     2 ( 1.9%)             |
  |                           13       0 ( 0.0%)     1 ( 0.9%)             |
  |                           14       1 ( 1.0%)     0 ( 0.0%)             |
  |                           15       1 ( 1.0%)     2 ( 1.9%)             |
  |                           16       2 ( 2.0%)     1 ( 0.9%)             |
  |                           17       1 ( 1.0%)     3 ( 2.8%)             |
  |------------------------------------------------------------------------|
  | male                               43 (43.0%)    56 (52.3%)     0.18   |
  +------------------------------------------------------------------------+
Data are presented as n (%).
 
file ./output/tables/udca_only.xlsx saved

. 
. ** Next import the PBC population
. 
. import delimited using ./output/input_pbc.csv, clear
(12 vars, 1,000 obs)

. 
. * Format dates 
. foreach var in udca_last_date udca_first_after udca_first_history died_date_o
> ns {
  2.     gen `var'A = date(`var', "YMD")
  3.     format `var'A %dD/N/CY
  4.     *list `var' `var'A in  1/5
.     drop `var'
  5. }
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)
(500 missing values generated)

. 
. /* DEMOGRAPHICS */ 
. 
. * Sex
. gen male = 1 if sex == "M"
(503 missing values generated)

. replace male = 0 if sex == "F"
(494 real changes made)

. 
. /*  Age variables  */ 
. 
. * Create categorised age
. recode age 18/39.9999 = 1 /// 
>            40/49.9999 = 2 ///
>                    50/59.9999 = 3 ///
>                60/69.9999 = 4 ///
>                    70/79.9999 = 5 ///
>                    80/max = 6, gen(agegroup) 
(787 differences between age and agegroup)

. 
. label define agegroup   1 "18-<40" ///
>                                                 2 "40-<50" ///
>                                                 3 "50-<60" ///
>                                                 4 "60-<70" ///
>                                                 5 "70-<80" ///
>                                                 6 "80+"

.                                                 
. label values agegroup agegroup

. 
. /* EXPOSURE INFORMATION ====================================================*
> /
. rename udca_last_date udca_date

. gen udca = 1 if udca_count != . & udca_count >= 2
(798 missing values generated)

. recode udca .=0
(udca: 798 changes made)

. 
. gen udca_sa = 1 if udca_count != . & udca_count >= 1 & udca_date != . & udca_
> date >= mdy(12,1,2019)
(942 missing values generated)

. recode udca_sa .=0
(udca_sa: 942 changes made)

. 
. tab1 udca udca_sa, m

-> tabulation of udca  

       udca |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        798       79.80       79.80
          1 |        202       20.20      100.00
------------+-----------------------------------
      Total |      1,000      100.00

-> tabulation of udca_sa  

    udca_sa |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        942       94.20       94.20
          1 |         58        5.80      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. tab udca udca_sa, m

           |        udca_sa
      udca |         0          1 |     Total
-----------+----------------------+----------
         0 |       785         13 |       798 
         1 |       157         45 |       202 
-----------+----------------------+----------
     Total |       942         58 |     1,000 

. 
. *tab  udca_count udca, m
. 
. * when was first udca Rx before index date
. gen udca_first = 0 if udca == 0
(202 missing values generated)

. replace udca_first = 1 if udca == 1 & udca_first_history >= mdy(9,1,2019) & u
> dca_first_history < mdy(3,1,2020) 
(0 real changes made)

. replace udca_first = 2 if udca == 1 & udca_first_history >= mdy(3,1,2019) & u
> dca_first_history < mdy(9,1,2019) 
(0 real changes made)

. replace udca_first = 3 if udca == 1 & udca_first_history >= mdy(9,1,2018) & u
> dca_first_history < mdy(3,1,2019) 
(1 real change made)

. replace udca_first = 4 if udca == 1 & udca_first_history >= mdy(9,1,2017) & u
> dca_first_history < mdy(9,1,2018) 
(1 real change made)

. replace udca_first = 5 if udca == 1 & udca_first_history >= mdy(9,1,2016) & u
> dca_first_history < mdy(9,1,2017) 
(2 real changes made)

. replace udca_first = 6 if udca == 1 & udca_first_history >= mdy(9,1,2015) & u
> dca_first_history < mdy(9,1,2016) 
(0 real changes made)

. replace udca_first = 7 if udca == 1 & udca_first_history >= mdy(9,1,2014) & u
> dca_first_history < mdy(9,1,2015) 
(3 real changes made)

. replace udca_first = 8 if udca == 1 &                                        
>                                      udca_first_history < mdy(9,1,2014) 
(87 real changes made)

. 
. label define udca_first         0 "unexposed"                                
>                            ///
>                                                 1 "within exposure window"   
>                                    ///
>                                                 2 "up to 6 mos before exposur
> e window"          ///
>                                                 3 "6 mos to 1 yr before expos
> ure window"        ///
>                                                 4 "1 to 2 yr before exposure 
> window"            ///
>                                                 5 "2 to 3 yr before exposure 
> window"            ///
>                                                 6 "3 to 4 yr before exposure 
> window"            ///
>                                                 7 "4 to 5 yr before exposure 
> window"            ///
>                                                 8 "5+ yr before exposure wind
> ow"

. label values udca_first udca_first

. 
. * Flag if died
. gen died_flag = died_date_onsA!=.

. * Generate date if died of covid
. gen died_date_onscovid = died_date_onsA if died_ons_covid_flag_any == 1
(740 missing values generated)

. gen died_covid_2020 = (died_date_onscovid<date("31Dec2020", "DMY") & died_fla
> g==1)

. 
. **** Summary INFORMATION
. ** Currently dataset includes all people with a pbc diagnosis, how many have 
> 2+ udca prescription
. * Tabulate pbc diagnosis vs those with 2+ prescriptions in 6 months prior
. tab udca, m 

       udca |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        798       79.80       79.80
          1 |        202       20.20      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. 
. * Tabulating time since first prescription by whether have 2+ prescriptions i
> n the last 6 months
. tab udca_first udca, col m

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |         udca
           udca_first |         0          1 |     Total
----------------------+----------------------+----------
            unexposed |       798          0 |       798 
                      |    100.00       0.00 |     79.80 
----------------------+----------------------+----------
6 mos to 1 yr before  |         0          1 |         1 
                      |      0.00       0.50 |      0.10 
----------------------+----------------------+----------
1 to 2 yr before expo |         0          1 |         1 
                      |      0.00       0.50 |      0.10 
----------------------+----------------------+----------
2 to 3 yr before expo |         0          2 |         2 
                      |      0.00       0.99 |      0.20 
----------------------+----------------------+----------
4 to 5 yr before expo |         0          3 |         3 
                      |      0.00       1.49 |      0.30 
----------------------+----------------------+----------
5+ yr before exposure |         0         87 |        87 
                      |      0.00      43.07 |      8.70 
----------------------+----------------------+----------
                    . |         0        108 |       108 
                      |      0.00      53.47 |     10.80 
----------------------+----------------------+----------
                Total |       798        202 |     1,000 
                      |    100.00     100.00 |    100.00 

. 
. * Check number of prescriptions
. bys udca: sum udca_count

-------------------------------------------------------------------------------
-> udca = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  udca_count |        798    .0651629    .2569279         -1          1

-------------------------------------------------------------------------------
-> udca = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  udca_count |        202    3.341584    1.322275          2          8


. 
. * How many COVID-19 deaths by whether had 2+ prescriptions
. tab died_ons_covid_flag_any udca, row col 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

died_ons_c |
ovid_flag_ |         udca
       any |         0          1 |     Total
-----------+----------------------+----------
         0 |       405         95 |       500 
           |     81.00      19.00 |    100.00 
           |     50.75      47.03 |     50.00 
-----------+----------------------+----------
         1 |       393        107 |       500 
           |     78.60      21.40 |    100.00 
           |     49.25      52.97 |     50.00 
-----------+----------------------+----------
     Total |       798        202 |     1,000 
           |     79.80      20.20 |    100.00 
           |    100.00     100.00 |    100.00 

. tab died_covid_2020 udca, row col 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

died_covid |         udca
     _2020 |         0          1 |     Total
-----------+----------------------+----------
         0 |       749        196 |       945 
           |     79.26      20.74 |    100.00 
           |     93.86      97.03 |     94.50 
-----------+----------------------+----------
         1 |        49          6 |        55 
           |     89.09      10.91 |    100.00 
           |      6.14       2.97 |      5.50 
-----------+----------------------+----------
     Total |       798        202 |     1,000 
           |     79.80      20.20 |    100.00 
           |    100.00     100.00 |    100.00 

. tab died_flag udca, row col 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

           |         udca
 died_flag |         0          1 |     Total
-----------+----------------------+----------
         0 |       400        100 |       500 
           |     80.00      20.00 |    100.00 
           |     50.13      49.50 |     50.00 
-----------+----------------------+----------
         1 |       398        102 |       500 
           |     79.60      20.40 |    100.00 
           |     49.87      50.50 |     50.00 
-----------+----------------------+----------
     Total |       798        202 |     1,000 
           |     79.80      20.20 |    100.00 
           |    100.00     100.00 |    100.00 

. 
. 
. * Summary demographics
. tab agegroup udca, row col m 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

 RECODE of |         udca
       age |         0          1 |     Total
-----------+----------------------+----------
         0 |         7          1 |         8 
           |     87.50      12.50 |    100.00 
           |      0.88       0.50 |      0.80 
-----------+----------------------+----------
    18-<40 |       236         59 |       295 
           |     80.00      20.00 |    100.00 
           |     29.57      29.21 |     29.50 
-----------+----------------------+----------
    40-<50 |        97         26 |       123 
           |     78.86      21.14 |    100.00 
           |     12.16      12.87 |     12.30 
-----------+----------------------+----------
    50-<60 |       114         26 |       140 
           |     81.43      18.57 |    100.00 
           |     14.29      12.87 |     14.00 
-----------+----------------------+----------
    60-<70 |       104         25 |       129 
           |     80.62      19.38 |    100.00 
           |     13.03      12.38 |     12.90 
-----------+----------------------+----------
    70-<80 |        77         19 |        96 
           |     80.21      19.79 |    100.00 
           |      9.65       9.41 |      9.60 
-----------+----------------------+----------
       80+ |        57         11 |        68 
           |     83.82      16.18 |    100.00 
           |      7.14       5.45 |      6.80 
-----------+----------------------+----------
         7 |        16          0 |        16 
           |    100.00       0.00 |    100.00 
           |      2.01       0.00 |      1.60 
-----------+----------------------+----------
         8 |         8          8 |        16 
           |     50.00      50.00 |    100.00 
           |      1.00       3.96 |      1.60 
-----------+----------------------+----------
         9 |        12          1 |        13 
           |     92.31       7.69 |    100.00 
           |      1.50       0.50 |      1.30 
-----------+----------------------+----------
        10 |         4          2 |         6 
           |     66.67      33.33 |    100.00 
           |      0.50       0.99 |      0.60 
-----------+----------------------+----------
        11 |        13          2 |        15 
           |     86.67      13.33 |    100.00 
           |      1.63       0.99 |      1.50 
-----------+----------------------+----------
        12 |         5          4 |         9 
           |     55.56      44.44 |    100.00 
           |      0.63       1.98 |      0.90 
-----------+----------------------+----------
        13 |        10          5 |        15 
           |     66.67      33.33 |    100.00 
           |      1.25       2.48 |      1.50 
-----------+----------------------+----------
        14 |         9          3 |        12 
           |     75.00      25.00 |    100.00 
           |      1.13       1.49 |      1.20 
-----------+----------------------+----------
        15 |         6          4 |        10 
           |     60.00      40.00 |    100.00 
           |      0.75       1.98 |      1.00 
-----------+----------------------+----------
        16 |        13          3 |        16 
           |     81.25      18.75 |    100.00 
           |      1.63       1.49 |      1.60 
-----------+----------------------+----------
        17 |        10          3 |        13 
           |     76.92      23.08 |    100.00 
           |      1.25       1.49 |      1.30 
-----------+----------------------+----------
     Total |       798        202 |     1,000 
           |     79.80      20.20 |    100.00 
           |    100.00     100.00 |    100.00 

. tab sex udca, row col m 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

           |         udca
       sex |         0          1 |     Total
-----------+----------------------+----------
         F |       396         98 |       494 
           |     80.16      19.84 |    100.00 
           |     49.62      48.51 |     49.40 
-----------+----------------------+----------
         M |       394        103 |       497 
           |     79.28      20.72 |    100.00 
           |     49.37      50.99 |     49.70 
-----------+----------------------+----------
         U |         8          1 |         9 
           |     88.89      11.11 |    100.00 
           |      1.00       0.50 |      0.90 
-----------+----------------------+----------
     Total |       798        202 |     1,000 
           |     79.80      20.20 |    100.00 
           |    100.00     100.00 |    100.00 

. 
. * Export to table 
. * First drop out categories that will not be in real data > should be zero on
>  server
. drop if agegroup<1 | agegroup>6
(149 observations deleted)

. table1_mc, by(udca) vars(udca_first cate \ died_ons_covid_flag_any bin \ died
> _covid_2020 bin \ died_flag bin \ agegroup cate \ male bin) saving(./output/t
> ables/udca_pbc.xlsx, replace)

  +-------------------------------------------------+
  | factor                    N_0   N_1   m_0   m_1 |
  |-------------------------------------------------|
  | udca_first                685    79     0    87 |
  |-------------------------------------------------|
  | died_ons_covid_flag_any   685   166     0     0 |
  |-------------------------------------------------|
  | died_covid_2020           685   166     0     0 |
  |-------------------------------------------------|
  | died_flag                 685   166     0     0 |
  |-------------------------------------------------|
  | RECODE of age             685   166     0     0 |
  |-------------------------------------------------|
  | male                      678   166     7     0 |
  +-------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------
> ----------------------+
  |                                                              udca = 0      
>  udca = 1     p-value |
  |----------------------------------------------------------------------------
> ----------------------|
  |                                                              N=685         
>  N=166                |
  |----------------------------------------------------------------------------
> ----------------------|
  | udca_first                unexposed                          685 (100.0%)  
>  0 ( 0.0%)    <0.001  |
  |                           1 to 2 yr before exposure window   0 ( 0.0%)     
>  1 ( 1.3%)            |
  |                           2 to 3 yr before exposure window   0 ( 0.0%)     
>  2 ( 2.5%)            |
  |                           4 to 5 yr before exposure window   0 ( 0.0%)     
>  2 ( 2.5%)            |
  |                           5+ yr before exposure window       0 ( 0.0%)     
>  74 (93.7%)           |
  |----------------------------------------------------------------------------
> ----------------------|
  | died_ons_covid_flag_any                                      337 (49.2%)   
>  88 (53.0%)    0.38   |
  |----------------------------------------------------------------------------
> ----------------------|
  | died_covid_2020                                              44 ( 6.4%)    
>  5 ( 3.0%)     0.090  |
  |----------------------------------------------------------------------------
> ----------------------|
  | died_flag                                                    341 (49.8%)   
>  86 (51.8%)    0.64   |
  |----------------------------------------------------------------------------
> ----------------------|
  | RECODE of age             18-<40                             236 (34.5%)   
>  59 (35.5%)    0.98   |
  |                           40-<50                             97 (14.2%)    
>  26 (15.7%)           |
  |                           50-<60                             114 (16.6%)   
>  26 (15.7%)           |
  |                           60-<70                             104 (15.2%)   
>  25 (15.1%)           |
  |                           70-<80                             77 (11.2%)    
>  19 (11.4%)           |
  |                           80+                                57 ( 8.3%)    
>  11 ( 6.6%)           |
  |----------------------------------------------------------------------------
> ----------------------|
  | male                                                         336 (49.6%)   
>  80 (48.2%)    0.75   |
  +----------------------------------------------------------------------------
> ----------------------+
Data are presented as n (%).
 
file ./output/tables/udca_pbc.xlsx saved

. 
. foreach var in all only pbc {
  2.         import excel using ./output/tables/udca_`var'.xlsx, clear
  3.         export delimited using ./output/tables/udca_`var'.csv, replace 
  4. }
(13 vars, 7 obs)
(note: file ./output/tables/udca_all.csv not found)
file ./output/tables/udca_all.csv saved
(13 vars, 24 obs)
(note: file ./output/tables/udca_only.csv not found)
file ./output/tables/udca_only.csv saved
(13 vars, 17 obs)
(note: file ./output/tables/udca_pbc.csv not found)
file ./output/tables/udca_pbc.csv saved

. 
. 
. 
. 
. 
end of do-file

. . file open output using "/tmp/feasibility.do.Mz4i.out", write text replace

. . file write output "success" 

. . file close output

. 
end of do-file


