
. 
. import delimited using ./output/input_flowchart.csv, clear
(12 vars, 1,000 obs)

.  *  has_follow_up 
.  * (NOT died) AND
.  * (age >=18 AND age <= 115) AND
.  * (sex = 'M' OR sex = 'F') AND
.  * (imd != 0) AND
.  * (has_pbc=1 OR has_psc=1) AND
.  * (NOT liver_transplant_bl)
. 
. * Open file to write values to 
. file open table using ./output/flowchart/values.txt, write text replace  
(note: file ./output/flowchart/values.txt not found)

. file write table ("Total start") _tab 

. 
. describe

Contains data
  obs:         1,000                          
 vars:            12                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
has_pbc_date    int     %8.0g                 
has_psc_date    int     %8.0g                 
has_follow_up   byte    %8.0g                 
died            byte    %8.0g                 
age             int     %8.0g                 
sex             str1    %9s                   
has_msoa        byte    %8.0g                 
imd             byte    %8.0g                 
has_pbc         byte    %8.0g                 
has_psc         byte    %8.0g                 
liver_transpl~l byte    %8.0g                 
patient_id      int     %8.0g                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. 
. safecount
  1,000

. file write table ("`r(N)'") _n ("Has follow-up") _tab 

. safetab has_follow_up, m
14

has_follow_ |
         up |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        950       95.00       95.00
          1 |         50        5.00      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. keep if has_follow_up
(950 observations deleted)

. safecount
  50

. file write table ("`r(N)'") _n ("Died") _tab 

. safetab died, m
5

**TABLE OF died REDACTED DUE TO SMALL N**


. keep if died!=1
(3 observations deleted)

. safecount
  47

. file write table ("`r(N)'") _n ("Age ineligible") _tab  

. sum age

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |         47    39.08511    24.27544          1         85

. keep if (age>=18 & age<=115)
(10 observations deleted)

. safecount
  37

. file write table ("`r(N)'") _n ("Missing/ineligible sex") _tab 

. safetab sex, m
4

**TABLE OF sex REDACTED DUE TO SMALL N**


. keep if (sex=="F" | sex=="M")
(3 observations deleted)

. safecount 
  34

. file write table ("`r(N)'") _n ("IMD missing") _tab 

. safetab imd 
0

**TABLE OF imd REDACTED DUE TO SMALL N**


. drop if imd==0
(2 observations deleted)

. safecount
  32

. file write table ("`r(N)'") _n ("No PBC or PSC") _tab 

. gen pbc_psc = (has_pbc==1 | has_psc==1)

. safetab pbc_psc, m
8

**TABLE OF pbc_psc REDACTED DUE TO SMALL N**


. keep if pbc_psc
(30 observations deleted)

. safecount

** COUNT <=5 **

. file write table ("`r(N)'") _n ("Liver transplant prior to index") _tab

. safetab liver_transplant_bl, m
20

**TABLE OF liver_transplant_bl REDACTED DUE TO SMALL N**


. drop if liver_transplant_bl
(0 observations deleted)

. safecount

** COUNT <=5 **

. file write table ("`r(N)'") _n

. 
. * Determine number censored
. import delimited using ./output/input_pbc.csv, clear
(109 vars, 1,000 obs)

. * Create baseline UDCA variable
. gen udca_bl = (udca_count_bl>=1 & udca_count_bl!=.)

. * Determine end of follow-up date
. gen dereg_dateA = date(dereg_date, "YMD")
(500 missing values generated)

. format %dD/N/CY dereg_dateA

. drop dereg_date

. gen died_dateA = date(died_date_ons, "YMD")
(500 missing values generated)

. format %dD/N/CY died_dateA

. drop died_date_ons

. gen end_study = date("31/12/2022", "DMY")

. egen end_date = rowmin(dereg_dateA end_study died_dateA)

. * Create flag indicating reason for end of follow-up 
. gen end_date_flag = (end_date==dereg_dateA)

. replace end_date_flag = 2 if end_date==died_dateA
(323 real changes made)

. replace end_date_flag = 3 if end_date==end_study
(375 real changes made)

. 
. gen censored = end_date!=end_study 

. tab censored end_date_flag

           |          end_date_flag
  censored |         1          2          3 |     Total
-----------+---------------------------------+----------
         0 |         0          0        375 |       375 
         1 |       302        323          0 |       625 
-----------+---------------------------------+----------
     Total |       302        323        375 |     1,000 

. 
. file write table ("Censoring information") _n _tab ("No UDCA BL") _tab ("UDCA
>  BL") _n  

. safecount if censored==1 & udca_bl==0
  467

. file write table ("Censored") _tab ("`r(N)'") _tab 

. safecount if censored==1 & udca_bl==1
  158

. file write table ("`r(N)'") _n 

. * Count deregistered
. safecount if end_date_flag==1 & udca_bl==0
  224

. file write table ("Deregistered") _tab ("`r(N)'") _tab

. safecount if end_date_flag==1 & udca_bl==1
  78

. file write table ("`r(N)'") _n 

. * Count died 
. safecount if end_date_flag==2 & udca_bl==0
  243

. file write table ("Died") _tab ("`r(N)'") _tab

. safecount if end_date_flag==2 & udca_bl==1
  80

. file write table ("`r(N)'") _n 

. * Count end study 
. safecount if end_date_flag==3 & udca_bl==0
  282

. file write table ("Remained") _tab ("`r(N)'") _tab

. safecount if end_date_flag==3 & udca_bl==1
  93

. file write table ("`r(N)'") _n 

. * Liver deaths
. gen died_liver_any = died_ons_liver_flag_any==1 & died_ons_covid_flag_any!=1

. tab died_liver_any censored 

died_liver |       censored
      _any |         0          1 |     Total
-----------+----------------------+----------
         0 |       288        458 |       746 
         1 |        87        167 |       254 
-----------+----------------------+----------
     Total |       375        625 |     1,000 

. safecount if died_liver_any==1 & udca_bl==0
  192

. file write table ("Liver death") _tab ("`r(N)'") _tab

. safecount if died_liver_any==1 & udca_bl==1
  62

. file write table ("`r(N)'") _n 

. 
. file close table 

. 
end of do-file

. . file open output using "/tmp/100_flowchart.do.005O.out", write text replace

. . file write output "success" 

. . file close output

. 
end of do-file


