
. 
. import delimited using ./output/input_pbc.csv, clear
(97 vars, 1,000 obs)

. 
. * Prepare variables for table 
. replace ethnicity=6 if ethnicity==0
(51 real changes made)

. label define eth5                       1 "White"                            
>            ///
>                             2 "Mixed"                           ///          
>                                    
>                             3 "Asian"                                   ///
>                             4 "Black"                                   ///
>                             5 "Other"                                   ///
>                             6 "Unknown"

.                     
. 
. label values ethnicity eth5

. safetab ethnicity, m
10

  ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |        163       16.30       16.30
      Mixed |        187       18.70       35.00
      Asian |        196       19.60       54.60
      Black |        192       19.20       73.80
      Other |        211       21.10       94.90
    Unknown |         51        5.10      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. *(2) IMD
. replace imd=6 if imd==0
(41 real changes made)

. 
. * Create age categories
. egen age_cat = cut(age), at(18, 40, 60, 80, 120) icodes
(217 missing values generated)

. label define age 0 "18 - 40 years" 1 "41 - 60 years" 2 "61 - 80 years" 3 ">80
>  years"

. label values age_cat age

. bys age_cat: sum age

-------------------------------------------------------------------------------
-> age_cat = 18 - 40 years

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        249    28.00402    6.012419         18         39

-------------------------------------------------------------------------------
-> age_cat = 41 - 60 years

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        271    50.09963    5.550546         40         59

-------------------------------------------------------------------------------
-> age_cat = 61 - 80 years

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        215    68.07442    5.828872         60         79

-------------------------------------------------------------------------------
-> age_cat = >80 years

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |         48    85.45833    5.496453         80        108

-------------------------------------------------------------------------------
-> age_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        217    7.654378    4.952122          0         17


. 
. * Sex 
. gen male=(sex=="M")

. replace male = 0 if sex == "F"
(0 real changes made)

. label define male 0"Female" 1"Male"

. label values male male

. safetab male, miss
5

       male |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |        498       49.80       49.80
       Male |        502       50.20      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. 
. * BMI categories
. egen bmi_cat = cut(bmi), at(0, 1, 18.5, 24.9, 29.9, 39.9, 100) icodes
(1 missing value generated)

. bys bmi_cat: sum bmi

-------------------------------------------------------------------------------
-> bmi_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        199           0           0          0          0

-------------------------------------------------------------------------------
-> bmi_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |         74    14.80164    2.867799   6.583832   18.43269

-------------------------------------------------------------------------------
-> bmi_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        184    22.13566     1.73058   18.57348   24.87132

-------------------------------------------------------------------------------
-> bmi_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        199    27.41152    1.415283    24.9296   29.88632

-------------------------------------------------------------------------------
-> bmi_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        302    34.03168    2.811387   29.92838   39.88728

-------------------------------------------------------------------------------
-> bmi_cat = 5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |         41    42.90044    2.864751   39.98143   52.59038

-------------------------------------------------------------------------------
-> bmi_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |          1   -2.833271           .  -2.833271  -2.833271


. * add missing . to zero category
. replace bmi_cat = 0 if bmi_cat==. 
(1 real change made)

. label define bmi 0 "Missing" 1 "Underweight" 2 "Healthy range" 3 "Overweight"
>  4 "Obese" 5 "Morbidly obese"

. label values bmi_cat bmi

. 
. * Smoking status
. gen smoking = 0 if smoking_status=="N"
(906 missing values generated)

. replace smoking = 1 if smoking_status=="S"
(211 real changes made)

. replace smoking = 2 if smoking_status=="E"
(151 real changes made)

. replace smoking = 3 if smoking==.
(544 real changes made)

. 
. label define smok 1 "Current smoker" 2 "Ex-smoker" 0 "Never smoked" 3 "Unknow
> n"

. label values smoking smok

. 
. 
. replace oral_steroid_drugs_nhsd=. if oral_steroid_drug_nhsd_3m_count < 2 & or
> al_steroid_drug_nhsd_12m_count < 4
(931 real changes made, 931 to missing)

. gen imid_nhsd=max(oral_steroid_drugs_nhsd, immunosuppresant_drugs_nhsd)

. gen rare_neuro_nhsd = max(multiple_sclerosis_nhsd, motor_neurone_disease_nhsd
> , myasthenia_gravis_nhsd, huntingtons_disease_nhsd)

. gen solid_organ_transplant_bin = solid_organ_transplant_nhsd_new!=""

. gen any_high_risk_condition = max(learning_disability_nhsd_snomed, cancer_ope
> nsafely_snomed_new, haematological_disease_nhsd, ///
> ckd_stage_5_nhsd, imid_nhsd, immunosupression_nhsd_new, hiv_aids_nhsd, solid_
> organ_transplant_bin, rare_neuro_nhsd)

. 
. foreach var in udca gc budesonide fenofibrate {
  2.     gen `var'_any = (`var'_count_fu>=1 & `var'_count_fu!=.)
  3.     gen `var'_bl = (`var'_count_bl>=1 & `var'_count_bl!=.)
  4. }

. 
. * Determine study end date 
. foreach date in dereg_date died_date_ons hosp_covid {
  2.     gen `date'A = date(`date', "YMD")
  3.     format %dD/N/CY `date'A
  4.     drop `date'
  5. }
(500 missing values generated)
(500 missing values generated)
(900 missing values generated)

. gen end_study = date("31/12/2020", "DMY")

. 
. * End date if died 
. egen end_date_died = rowmin(dereg_dateA end_study died_date_onsA)

. * End date for hospital admission outcome 
. egen end_date_hosp = rowmin(dereg_dateA end_study died_date_onsA hosp_covidA)

. * Flag died 2020 - will match end date 
. gen died_covid_2020 = (died_date_onsA<=date("31Dec2020", "DMY") & died_ons_co
> vid_flag_any==1)

. 
. * Flag hospital admission 
. gen hosp_flag = hosp_covidA!=.

. gen hosp_covid_2020 = hosp_covidA<date("31Dec2020", "DMY") & hosp_flag==1 

. 
. * generate index date 
. gen indexdate = date("01/03/2020", "DMY")

. 
. * Model treatment allocation on the set of confounding variables (include age
>  and bmi as continuous variables)
. * First DAG minimal adjustment set: age, sex, COVID-19 high risk conditions, 
> ethnicity & IMD
. logistic udca_bl (age male any_high_risk_condition i.ethnicity i.imd)
note: any_high_risk_condition omitted because of collinearity

Logistic regression                             Number of obs     =      1,000
                                                LR chi2(12)       =      10.18
                                                Prob > chi2       =     0.6006
Log likelihood = -560.51933                     Pseudo R2         =     0.0090

------------------------------------------------------------------------------
     udca_bl | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   .9985115   .0030215    -0.49   0.623      .992607    1.004451
        male |   1.042296    .153375     0.28   0.778      .781153    1.390742
any_high_r~n |          1  (omitted)
             |
   ethnicity |
      Mixed  |    .867285   .2217281    -0.56   0.578     .5254672    1.431456
      Asian  |   .9103315   .2275099    -0.38   0.707     .5577858    1.485702
      Black  |   1.375903   .3320918     1.32   0.186     .8573132    2.208189
      Other  |   1.099472   .2650851     0.39   0.694     .6854213    1.763643
    Unknown  |   .9046854   .3429184    -0.26   0.792       .43038    1.901705
             |
         imd |
          2  |    1.44103   .3458621     1.52   0.128     .9002767    2.306589
          3  |   1.191323   .2896736     0.72   0.472      .739703    1.918676
          4  |   1.148392   .2815111     0.56   0.572     .7102822    1.856733
          5  |   .8889703   .2264715    -0.46   0.644     .5395573     1.46466
          6  |   1.202355   .4788807     0.46   0.644     .5508225    2.624545
             |
       _cons |   .2993051   .0862631    -4.19   0.000     .1701329    .5265503
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. 
. * Estimate propensity scores
. predict propensity_dag
(option pr assumed; Pr(udca_bl))

. 
. * Calculate ATT weights 
. gen att_weight_dag = udca_bl + (1-udca_bl)*(propensity_dag/(1-propensity_dag)
> )

. 
. * Next adjust for additional variables 
. logistic udca_bl (age male any_high_risk_condition i.ethnicity i.imd bmi i.sm
> oking severe_disease_bl oca_bl budesonide_bl)
note: any_high_risk_condition omitted because of collinearity

Logistic regression                             Number of obs     =      1,000
                                                LR chi2(19)       =      17.53
                                                Prob > chi2       =     0.5539
Log likelihood =  -556.8409                     Pseudo R2         =     0.0155

------------------------------------------------------------------------------
     udca_bl | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   .9987097   .0030392    -0.42   0.671     .9927707    1.004684
        male |   1.047136   .1547341     0.31   0.755     .7838306    1.398892
any_high_r~n |          1  (omitted)
             |
   ethnicity |
      Mixed  |    .879053   .2258545    -0.50   0.616     .5312714      1.4545
      Asian  |   .9243907   .2320946    -0.31   0.754     .5651154    1.512077
      Black  |   1.360424   .3304472     1.27   0.205     .8451176    2.189935
      Other  |   1.113925   .2703172     0.44   0.657     .6922998    1.792329
    Unknown  |   .9378473   .3574402    -0.17   0.866     .4443397    1.979471
             |
         imd |
          2  |   1.444731   .3511039     1.51   0.130     .8972736    2.326211
          3  |   1.187218   .2908444     0.70   0.484     .7345197    1.918923
          4  |   1.125766    .277769     0.48   0.631     .6941036    1.825877
          5  |   .8634568   .2218168    -0.57   0.568     .5218817    1.428595
          6  |   1.168434   .4697224     0.39   0.699     .5313891    2.569188
             |
         bmi |   .9978993   .0056001    -0.37   0.708     .9869835    1.008936
             |
     smoking |
Current s..  |   1.078262   .3193163     0.25   0.799     .6034613    1.926633
  Ex-smoker  |   1.213265   .3765024     0.62   0.533     .6604034    2.228958
    Unknown  |   1.174022    .312187     0.60   0.546     .6971577    1.977066
             |
severe_dis~l |   1.182526   .1750094     1.13   0.257     .8847812    1.580466
      oca_bl |   .7127659    .106042    -2.28   0.023     .5324871    .9540799
budeson~e_bl |   .9615889   .1646953    -0.23   0.819      .687386    1.345173
       _cons |   .2972834   .1221156    -2.95   0.003     .1328989    .6649976
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. 
. * Estimate propensity scores
. predict propensity_all
(option pr assumed; Pr(udca_bl))

. 
. * Calculate ATT weights 
. gen att_weight_all = udca_bl + (1-udca_bl)*(propensity_all/(1-propensity_all)
> )

. 
. * Fit weighted Cox regression w/ robust standard errors
. * COVID-19 death outcome and hospitalisation outcomes 
. foreach outcome in died hosp { 
  2.     file open tablecontent using ./output/tables/covid_`outcome'_cox_model
> s.txt, write text replace
  3.     file write tablecontent ("UDCA exposure") _tab ("denominator") _tab ("
> events") _tab ("total_person_wks") _tab ("Rate") _tab ("unadj_hr") _tab ///
>     ("unadj_ci") _tab ("unadj_lci") _tab ("unadj_uci") _tab ("dag_adj_hr") _t
> ab ("dag_adj_ci") _tab ("dag_adj_lci") _tab ("dag_adj_uci") _tab ("f_adj_hr")
>  _tab ("f_adj_ci") _tab ("f_adj_lci") _tab ("f_adj_uci") _tab  _n
  4.     stset end_date_`outcome', failure(`outcome'_covid_2020) origin(indexda
> te) enter(indexdate) scale(365.25) id(patient_id)
  5.     stcox i.udca_bl, strata(stp) 
  6.     estimates save "./output/tempdata/crude_`outcome'", replace 
  7.     eststo model0
  8.     parmest, label eform format(estimate p lb ub) saving("./output/tempdat
> a/surv_crude_`outcome'", replace) idstr("crude_`outcome'") 
  9.     estat phtest, d
 10.     * DAG minimal adjustment set 
.     stset end_date_`outcome' [pweight=att_weight_dag], failure(`outcome'_covi
> d_2020) origin(indexdate) enter(indexdate) scale(365.25) id(patient_id)
 11.     stcox i.udca_bl, strata(stp) vce(robust)
 12.     estimates save "./output/tempdata/adj_dag_`outcome'", replace 
 13.     eststo model1
 14.     parmest, label eform format(estimate p lb ub) saving("./output/tempdat
> a/surv_dag_adj_`outcome'", replace) idstr("adj_dag_`outcome'") 
 15.     estat phtest, d
 16.     * All adjustments 
.     stset end_date_`outcome' [pweight=att_weight_all], failure(`outcome'_covi
> d_2020) origin(indexdate) enter(indexdate) scale(365.25) id(patient_id)
 17.     stcox i.udca_bl, strata(stp) vce(robust)
 18.     estimates save "./output/tempdata/adj_all_`outcome'", replace 
 19.     eststo model2
 20.     parmest, label eform format(estimate p lb ub) saving("./output/tempdat
> a/surv_adj_all_`outcome'", replace) idstr("adj_all_`outcome'") 
 21.     estat phtest, d
 22.     eststo clear
 23.     bysort udca_bl: egen total_follow_up_`outcome' = total(_t)
 24.     * Writing results to file 
.     forvalues i=0/1 {
 25.         qui safecount if udca_bl==`i'
 26.         local denominator = r(N)
 27.         qui safecount if udca_bl == `i'  & `outcome'_covid_2020 == 1
 28.         local event = r(N)
 29.         qui su total_follow_up_`outcome' if udca_bl == `i'
 30.         local person_mth = r(mean)/30
 31.         local rate = 100000*(`event'/`person_mth')
 32.         if `event'>10 & `event'!=. {
 33.                         file write tablecontent ("UDCA `i'") _tab (`denomi
> nator') _tab (`event') _tab %10.0f (`person_mth') _tab %3.2f (`rate') _tab  
 34.                         cap estimates use "./output/tempdata/crude_`outcom
> e'" 
 35.                         cap lincom `i'.udca_bl, eform
 36.                         file write tablecontent  %4.2f (r(estimate)) _tab 
> ("(") %4.2f (r(lb)) (" - ") %4.2f (r(ub)) (")") _tab %4.2f (r(lb)) _tab %4.2f
>  (r(ub)) _tab
 37.                         cap estimates clear
 38.                         cap estimates use "./output/tempdata/adj_dag_`outc
> ome'" 
 39.                         cap lincom `i'.udca_bl, eform
 40.                         file write tablecontent  %4.2f (r(estimate)) _tab 
> ("(") %4.2f (r(lb)) (" - ") %4.2f (r(ub)) (")") _tab %4.2f (r(lb)) _tab %4.2f
>  (r(ub))  _tab
 41.                         cap estimates clear
 42.                         cap estimates use "./output/tempdata/adj_all_`outc
> ome'" 
 43.                         cap lincom `i'.udca_bl, eform
 44.                         file write tablecontent  %4.2f (r(estimate)) _tab 
> ("(") %4.2f (r(lb)) (" - ") %4.2f (r(ub)) (")") _tab %4.2f (r(lb)) _tab %4.2f
>  (r(ub)) _n
 45.                         cap estimates clear
 46.                     }
 47.                     else {
 48.                         file write tablecontent ("UDCA `i'") _tab ("redact
> ") _n
 49.                         continue
 50.                     }
 51.         }
 52.         file close tablecontent 
 53.     }
(note: file ./output/tables/covid_died_cox_models.txt not found)

                id:  patient_id
     failure event:  died_covid_2020 != 0 & died_covid_2020 < .
obs. time interval:  (end_date_died[_n-1], end_date_died]
 enter on or after:  time indexdate
 exit on or before:  failure
    t for analysis:  (time-origin)/365.25
            origin:  time indexdate

------------------------------------------------------------------------------
      1,000  total observations
          0  exclusions
------------------------------------------------------------------------------
      1,000  observations remaining, representing
      1,000  subjects
         64  failures in single-failure-per-subject data
    733.634  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =  .8350445

         failure _d:  died_covid_2020
   analysis time _t:  (end_date_died-origin)/365.25
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Iteration 0:   log likelihood = -144.74275
Iteration 1:   log likelihood = -144.38897
Iteration 2:   log likelihood = -144.38616
Iteration 3:   log likelihood = -144.38616
Refining estimates:
Iteration 0:   log likelihood = -144.38616

Stratified Cox regr. -- no ties

No. of subjects =        1,000                  Number of obs    =         500
No. of failures =           64
Time at risk    =  733.6344969
                                                LR chi2(1)       =        0.71
Log likelihood  =   -144.38616                  Prob > chi2      =      0.3984

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   1.udca_bl |   1.415227   .5683833     0.86   0.387     .6441199    3.109464
------------------------------------------------------------------------------
                                                             Stratified by stp
file ./output/tempdata/crude_died.ster saved
(note: file ./output/tempdata/surv_crude_died.dta not found)
file ./output/tempdata/surv_crude_died.dta saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.udca_bl  |            .            .        1             .
      1.udca_bl   |     -0.04095         0.05        1         0.8260
      ------------+---------------------------------------------------
      global test |                      0.05        1         0.8260
      ----------------------------------------------------------------

                id:  patient_id
     failure event:  died_covid_2020 != 0 & died_covid_2020 < .
obs. time interval:  (end_date_died[_n-1], end_date_died]
 enter on or after:  time indexdate
 exit on or before:  failure
    t for analysis:  (time-origin)/365.25
            origin:  time indexdate
            weight:  [pweight=att_weight_dag]

------------------------------------------------------------------------------
      1,000  total observations
          0  exclusions
------------------------------------------------------------------------------
      1,000  observations remaining, representing
      1,000  subjects
         64  failures in single-failure-per-subject data
    733.634  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =  .8350445

         failure _d:  died_covid_2020
   analysis time _t:  (end_date_died-origin)/365.25
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id
             weight:  [pweight=att_weight_dag]

(sum of wgt is 250.4734465926886)
Iteration 0:   log pseudolikelihood = -68.658403
Iteration 1:   log pseudolikelihood = -68.418492
Iteration 2:   log pseudolikelihood = -68.418484
Refining estimates:
Iteration 0:   log pseudolikelihood = -68.418484

Stratified Cox regr. -- no ties

No. of subjects      =          506             Number of obs    =         500
No. of failures      =           33
Time at risk         =  369.1705119
                                                Wald chi2(1)     =        0.77
Log pseudolikelihood =   -68.418484             Prob > chi2      =      0.3802

                           (Std. Err. adjusted for 500 clusters in patient_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   1.udca_bl |   1.421604   .5698493     0.88   0.380     .6479998    3.118763
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/tempdata/adj_dag_died.ster not found)
file ./output/tempdata/adj_dag_died.ster saved
(note: file ./output/tempdata/surv_dag_adj_died.dta not found)
file ./output/tempdata/surv_dag_adj_died.dta saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.udca_bl  |            .            .        1             .
      1.udca_bl   |     -0.04124         0.05        1         0.8256
      ------------+---------------------------------------------------
      global test |                      0.05        1         0.8256
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.

                id:  patient_id
     failure event:  died_covid_2020 != 0 & died_covid_2020 < .
obs. time interval:  (end_date_died[_n-1], end_date_died]
 enter on or after:  time indexdate
 exit on or before:  failure
    t for analysis:  (time-origin)/365.25
            origin:  time indexdate
            weight:  [pweight=att_weight_all]

------------------------------------------------------------------------------
      1,000  total observations
          0  exclusions
------------------------------------------------------------------------------
      1,000  observations remaining, representing
      1,000  subjects
         64  failures in single-failure-per-subject data
    733.634  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =  .8350445

         failure _d:  died_covid_2020
   analysis time _t:  (end_date_died-origin)/365.25
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id
             weight:  [pweight=att_weight_all]

(sum of wgt is 249.6609547138214)
Iteration 0:   log pseudolikelihood = -66.890441
Iteration 1:   log pseudolikelihood = -66.582867
Iteration 2:   log pseudolikelihood = -66.582841
Refining estimates:
Iteration 0:   log pseudolikelihood = -66.582841

Stratified Cox regr. -- no ties

No. of subjects      =          506             Number of obs    =         500
No. of failures      =           32
Time at risk         =  368.9284935
                                                Wald chi2(1)     =        1.00
Log pseudolikelihood =   -66.582841             Prob > chi2      =      0.3168

                           (Std. Err. adjusted for 500 clusters in patient_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   1.udca_bl |   1.498942   .6060382     1.00   0.317     .6786333    3.310813
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/tempdata/adj_all_died.ster not found)
file ./output/tempdata/adj_all_died.ster saved
(note: file ./output/tempdata/surv_adj_all_died.dta not found)
file ./output/tempdata/surv_adj_all_died.dta saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.udca_bl  |            .            .        1             .
      1.udca_bl   |     -0.03696         0.04        1         0.8413
      ------------+---------------------------------------------------
      global test |                      0.04        1         0.8413
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
(note: file ./output/tables/covid_hosp_cox_models.txt not found)

                id:  patient_id
     failure event:  hosp_covid_2020 != 0 & hosp_covid_2020 < .
obs. time interval:  (end_date_hosp[_n-1], end_date_hosp]
 enter on or after:  time indexdate
 exit on or before:  failure
    t for analysis:  (time-origin)/365.25
            origin:  time indexdate

------------------------------------------------------------------------------
      1,000  total observations
          0  exclusions
------------------------------------------------------------------------------
      1,000  observations remaining, representing
      1,000  subjects
         25  failures in single-failure-per-subject data
    721.558  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =  .8350445

         failure _d:  hosp_covid_2020
   analysis time _t:  (end_date_hosp-origin)/365.25
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Iteration 0:   log likelihood = -90.898591
Iteration 1:   log likelihood = -90.886761
Iteration 2:   log likelihood = -90.886755
Refining estimates:
Iteration 0:   log likelihood = -90.886755

Stratified Cox regr. -- no ties

No. of subjects =        1,000                  Number of obs    =         500
No. of failures =           25
Time at risk    =  721.5578371
                                                LR chi2(1)       =        0.02
Log likelihood  =   -90.886755                  Prob > chi2      =      0.8777

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   1.udca_bl |   .9170289   .5203429    -0.15   0.879     .3015727    2.788521
------------------------------------------------------------------------------
                                                             Stratified by stp
file ./output/tempdata/crude_hosp.ster saved
(note: file ./output/tempdata/surv_crude_hosp.dta not found)
file ./output/tempdata/surv_crude_hosp.dta saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.udca_bl  |            .            .        1             .
      1.udca_bl   |     -0.22808         0.93        1         0.3356
      ------------+---------------------------------------------------
      global test |                      0.93        1         0.3356
      ----------------------------------------------------------------

                id:  patient_id
     failure event:  hosp_covid_2020 != 0 & hosp_covid_2020 < .
obs. time interval:  (end_date_hosp[_n-1], end_date_hosp]
 enter on or after:  time indexdate
 exit on or before:  failure
    t for analysis:  (time-origin)/365.25
            origin:  time indexdate
            weight:  [pweight=att_weight_dag]

------------------------------------------------------------------------------
      1,000  total observations
          0  exclusions
------------------------------------------------------------------------------
      1,000  observations remaining, representing
      1,000  subjects
         25  failures in single-failure-per-subject data
    721.558  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =  .8350445

         failure _d:  hosp_covid_2020
   analysis time _t:  (end_date_hosp-origin)/365.25
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id
             weight:  [pweight=att_weight_dag]

(sum of wgt is 250.4734465926886)
Iteration 0:   log pseudolikelihood = -37.216059
Iteration 1:   log pseudolikelihood = -37.212825
Iteration 2:   log pseudolikelihood = -37.212825
Refining estimates:
Iteration 0:   log pseudolikelihood = -37.212825

Stratified Cox regr. -- no ties

No. of subjects      =          506             Number of obs    =         500
No. of failures      =           14
Time at risk         =  361.9242921
                                                Wald chi2(1)     =        0.01
Log pseudolikelihood =   -37.212825             Prob > chi2      =      0.9222

                           (Std. Err. adjusted for 500 clusters in patient_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   1.udca_bl |   .9462847   .5348902    -0.10   0.922     .3125199    2.865273
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/tempdata/adj_dag_hosp.ster not found)
file ./output/tempdata/adj_dag_hosp.ster saved
(note: file ./output/tempdata/surv_dag_adj_hosp.dta not found)
file ./output/tempdata/surv_dag_adj_hosp.dta saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.udca_bl  |            .            .        1             .
      1.udca_bl   |     -0.21361         0.80        1         0.3699
      ------------+---------------------------------------------------
      global test |                      0.80        1         0.3699
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.

                id:  patient_id
     failure event:  hosp_covid_2020 != 0 & hosp_covid_2020 < .
obs. time interval:  (end_date_hosp[_n-1], end_date_hosp]
 enter on or after:  time indexdate
 exit on or before:  failure
    t for analysis:  (time-origin)/365.25
            origin:  time indexdate
            weight:  [pweight=att_weight_all]

------------------------------------------------------------------------------
      1,000  total observations
          0  exclusions
------------------------------------------------------------------------------
      1,000  observations remaining, representing
      1,000  subjects
         25  failures in single-failure-per-subject data
    721.558  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =  .8350445

         failure _d:  hosp_covid_2020
   analysis time _t:  (end_date_hosp-origin)/365.25
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id
             weight:  [pweight=att_weight_all]

(sum of wgt is 249.6609547138214)
Iteration 0:   log pseudolikelihood = -38.171015
Iteration 1:   log pseudolikelihood = -38.156719
Iteration 2:   log pseudolikelihood = -38.156719
Refining estimates:
Iteration 0:   log pseudolikelihood = -38.156719

Stratified Cox regr. -- no ties

No. of subjects      =          506             Number of obs    =         500
No. of failures      =           14
Time at risk         =  361.6148805
                                                Wald chi2(1)     =        0.04
Log pseudolikelihood =   -38.156719             Prob > chi2      =      0.8397

                           (Std. Err. adjusted for 500 clusters in patient_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   1.udca_bl |   .8916511   .5054026    -0.20   0.840     .2935755    2.708134
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/tempdata/adj_all_hosp.ster not found)
file ./output/tempdata/adj_all_hosp.ster saved
(note: file ./output/tempdata/surv_adj_all_hosp.dta not found)
file ./output/tempdata/surv_adj_all_hosp.dta saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.udca_bl  |            .            .        1             .
      1.udca_bl   |     -0.22392         0.89        1         0.3464
      ------------+---------------------------------------------------
      global test |                      0.89        1         0.3464
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.

. 
. 
. 
. 
end of do-file

. . file open output using "/tmp/104_propensity_score.do.zMjw.out", write text 
> replace

. . file write output "success" 

. . file close output

. 
end of do-file


