
. 
. tempfile tempfile 

. import delimited using ./output/input_pbc.csv
(109 vars, 1,000 obs)

. describe

Contains data
  obs:         1,000                          
 vars:           109                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
dereg_date      str10   %10s                  
has_pbc_date    int     %8.0g                 
has_psc_date    int     %8.0g                 
fu_liver_tran~d str10   %10s                  
fu_liver_tran~s str10   %10s                  
udca_last_date  str10   %10s                  
udca_first_af~r str10   %10s                  
udca_first_hi~y str10   %10s                  
covid_va~t_date str10   %10s                  
covid_vacc_se~e str10   %10s                  
covid_vacc_th~e str10   %10s                  
covid_vacc_fo~e str10   %10s                  
covid_~fth_date str10   %10s                  
date_most_rec~c str10   %10s                  
severe_disea~ed str10   %10s                  
severe_disea~cd str10   %10s                  
solid_organ_t~m str10   %10s                  solid_organ_transplant_nhsd_snome
                                                > d
solid_organ_n~w str10   %10s                  
solid_organ_t~s byte    %8.0g                 solid_organ_transplant_nhsd_opcs4
transplant_al~4 byte    %8.0g                 
transplant_th~4 str10   %10s                  
transplant_co~p byte    %8.0g                 transplant_conjunctiva_y_code_opc
                                                > s4
transplant_co~4 str10   %10s                  
transplant_st~4 str10   %10s                  
transplant_il.. byte    %8.0g                 transplant_ileum_1_Y_codes_opcs4
transplant_il.. byte    %8.0g                 transplant_ileum_2_Y_codes_opcs4
transpl~1_opcs4 str10   %10s                  
transpl~2_opcs4 str10   %10s                  
hosp_covid_pr~y str10   %10s                  
hosp_covid_any  str10   %10s                  
died_date_ons   str10   %10s                  
age             byte    %8.0g                 
sex             str1    %9s                   
stp             str4    %9s                   
region_nhs      str24   %24s                  
has_msoa        byte    %8.0g                 
imd             byte    %8.0g                 
eth             byte    %8.0g                 
ethnicity_sus   byte    %8.0g                 
ethnicity       byte    %8.0g                 
smoking_status  str1    %9s                   
bmi             float   %9.0g                 
has_pbc         byte    %8.0g                 
has_psc         byte    %8.0g                 
liver_transpl~l byte    %8.0g                 
udca_count_bl   byte    %8.0g                 
udca_count_fu   byte    %8.0g                 
oca_bl          byte    %8.0g                 
budesonide_co~u byte    %8.0g                 
budesonide_co~l byte    %8.0g                 
fenofibrate_c~u byte    %8.0g                 
fenofibrate_c~l byte    %8.0g                 
gc_count_fu     byte    %8.0g                 
gc_count_bl     byte    %8.0g                 
rituximab_bl    byte    %8.0g                 
severe_diseas~l byte    %8.0g                 
learning_disa~d byte    %8.0g                 
cancer_opensa~d byte    %8.0g                 
cancer_opensa~w byte    %8.0g                 
cancer_opensa~r byte    %8.0g                 
haematopoieti~d byte    %8.0g                 
haematopoiet~10 byte    %8.0g                 
haematopoieti~4 byte    %8.0g                 
haematologica~m byte    %8.0g                 haematological_malignancies_snome
                                                > d
haematologica~1 byte    %8.0g                 haematological_malignancies_icd10
sickle_cell_d~d byte    %8.0g                 
sickle_cell_~10 byte    %8.0g                 
haematopoieti~_ byte    %8.0g                 haematopoietic_stem_cell_snomed_e
                                                > ver
haematopoie~0_e byte    %8.0g                 haematopoietic_stem_cell_icd10_ev
                                                > er
haematopoie~4_e byte    %8.0g                 haematopoietic_stem_cell_opcs4_ev
                                                > er
v71             byte    %8.0g                 haematological_malignancies_snome
                                                > d_ever
v72             byte    %8.0g                 haematological_malignancies_icd10
                                                > _ever
ckd_stage_5_~ed byte    %8.0g                 
ckd_stage_5_~10 byte    %8.0g                 
immunosuppres~d byte    %8.0g                 
oral_steroid_~d byte    %8.0g                 
oral_s~3m_count byte    %8.0g                 
oral_s~2m_count byte    %8.0g                 
immunosuppres~r byte    %8.0g                 
oral_steroid_~r byte    %8.0g                 
immunosupress~d byte    %8.0g                 
immunosupress~w byte    %8.0g                 
hiv_aids_nhsd~d byte    %8.0g                 
hiv_aids_nhs~10 byte    %8.0g                 
multiple_scl~ed byte    %8.0g                 
multiple_scl~10 byte    %8.0g                 
motor_neurone~e byte    %8.0g                 motor_neurone_disease_nhsd_snomed
motor_neuron~10 byte    %8.0g                 
myasthenia_g~ed byte    %8.0g                 
myasthenia_g~10 byte    %8.0g                 
huntingtons_~ed byte    %8.0g                 
huntingtons_~10 byte    %8.0g                 
died_ons_live~y byte    %8.0g                 
died_ons_live~g byte    %8.0g                 
died_ons_covi~y byte    %8.0g                 
died_ons_covi~g byte    %8.0g                 
liver_transpl~e str10   %10s                  
severe_diseas~e str10   %10s                  
haematologica~d byte    %8.0g                 
haematologica~r byte    %8.0g                 
ckd_stage_5_~sd byte    %8.0g                 
hiv_aids_nhsd   byte    %8.0g                 
solid_organ_t~d str10   %10s                  
solid_organ_t~w str10   %10s                  
multiple_scl~sd byte    %8.0g                 
motor_neurone~d byte    %8.0g                 
myasthenia_g~sd byte    %8.0g                 
huntingtons_~sd byte    %8.0g                 
patient_id      int     %8.0g                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. save `tempfile' 
file /tmp/St00015.000001 saved

. 
. /* Time-varying covariates are assessed 6-monthly and at time of exposure swi
> tching.
> As disease severity, covid vaccination and liver transplant will only switch 
> once need to identify
> nearest date after date identified in study definition */ 
. * 120 day file: primary exposure definition 
. use ./output/time_varying_udca_120, clear 

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [0,9995]                     units:  1
         unique values:  1,899                    missing .:  0/2,898

                  mean:   4984.34
              std. dev:   2884.82

           percentiles:        10%       25%       50%       75%       90%
                               995      2509      4970      7501      8945

. merge m:1 patient_id using `tempfile', keepusing(severe_disease_fu_date sever
> e_disease_bl covid_vacc_first_date liver_transplant_fu_date dereg_date died_d
> ate_ons)

    Result                           # of obs.
    -----------------------------------------
    not matched                         1,798
        from master                     1,798  (_merge==1)
        from using                          0  (_merge==2)

    matched                             1,100  (_merge==3)
    -----------------------------------------

. * Should only be required for dummy data 
. keep if _merge==3
(1,798 observations deleted)

. * Only using start date as this is when udca exposure or 6 monthly check occu
> rs
. drop stop

. * Add in rows with each of the 6 monthly assessment dates 
. gen expand=1

. bys patient_id (start): replace expand=6 if _n==_N 
(1000 real changes made)

. expand expand, generate(newv)
(5,000 observations created)

. bys patient_id newv: gen number = _n 

. replace start = date("01/09/2020", "DMY") if newv==1 & number==1
(1,000 real changes made)

. replace start = date("01/03/2021", "DMY") if newv==1 & number==2
(1,000 real changes made)

. replace start = date("01/09/2021", "DMY") if newv==1 & number==3
(1,000 real changes made)

. replace start = date("01/03/2022", "DMY") if newv==1 & number==4
(1,000 real changes made)

. replace start = date("01/09/2022", "DMY") if newv==1 & number==5
(1,000 real changes made)

. 
. * This gives a file where start dates are either exposure switching or 6-mont
> ly assessment dates 
. * These will be used to determine the closest date to time-varying covariate 
> dates identified in study definition 
. sort patient_id start 

. drop newv

. 
. * Determine end of follow-up date
. gen dereg_dateA = date(dereg_date, "YMD")
(3,050 missing values generated)

. format %dD/N/CY dereg_dateA

. drop dereg_date

. gen died_dateA = date(died_date_ons, "YMD")
(3,048 missing values generated)

. format %dD/N/CY died_dateA

. drop died_date_ons

. gen end_study = date("31/12/2022", "DMY")

. egen end_date = rowmin(dereg_dateA end_study died_dateA)

. 
. * Take out assessments after end_date 
. drop if start>end_date
(1,846 observations deleted)

. 
. * Determine number of days between each covariate and dates of UDCA change or
>  6 monthly check date 
. bys patient_id (start): egen last_assess = max(start)

. * Format dates  and identify date nearest after covariate updates 
. foreach var in covid_vacc_first_date severe_disease_fu_date liver_transplant_
> fu_date {
  2.     gen `var'A = date(`var', "YMD")
  3.     format `var'A %dD/N/CY 
  4.     drop `var'
  5.     * time between date of record and change in covariate - positive value
> s are those where record starts after 
.     * covariate change date 
.     gen time_`var' = start - `var'A
  6.     * Set time variable for records prior to change as missing
.     replace time_`var'=. if time_`var'<0
  7.     * Check if any are on index date (1st March) potentially severe diseas
> e - not others
.     di "Number where time-varying update same as assessment date"
  8.     count if time_`var'==0
  9.     di "Number where time-varying update is 1st March 2020"
 10.     count if `var'A==date("01/03/2020", "DMY")
 11.     * Find earliest start date after covariate update
.     * Note: there are some changes that occur after the last available 6 mont
> h assessment or exposure change
.     bys patient_id (time_`var'): gen `var'_updateN = start[1] if `var'A!=. & 
> time_`var'!=.
 12.     * Spread to all rows for patient 
.     bys patient_id: egen `var'_update = max(`var'_updateN)
 13.     format `var'_update %dD/N/CY 
 14.     di "Number where new variable is prior to original variable (should be
>  0)"
 15.     count if `var'_update < `var'A
 16.     di "Number where time varying update is after last assessment date"
 17.     count if `var'A > last_assess & `var'A!=.  & last_assess==start
 18.     di "Number of time-varying changes originally" 
 19.     * Using last_assess==start to count patients rather than rows
.     count if `var'A!=. & last_assess==start 
 20.     di "Number of dates for time-varying update"
 21.     count if `var'_update!=. & last_assess==start & `var'A!=.
 22. }
(417 missing values generated)
(417 missing values generated)
(2,997 real changes made, 2,997 to missing)
Number where time-varying update same as assessment date
  0
Number where time-varying update is 1st March 2020
  0
(3,414 missing values generated)
(1876 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  487
Number of time-varying changes originally
  901
Number of dates for time-varying update
  414
(1,047 missing values generated)
(1,047 missing values generated)
(2,207 real changes made, 2,207 to missing)
Number where time-varying update same as assessment date
  1
Number where time-varying update is 1st March 2020
  0
(3,254 missing values generated)
(2230 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  365
Number of time-varying changes originally
  745
Number of dates for time-varying update
  380
(4,192 missing values generated)
(4,192 missing values generated)
(49 real changes made, 49 to missing)
Number where time-varying update same as assessment date
  0
Number where time-varying update is 1st March 2020
  0
(4,241 missing values generated)
(4228 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  10
Number of time-varying changes originally
  16
Number of dates for time-varying update
  6

. * For severe disease only update variable if no severe disease at baseline 
. count if severe_disease_fu_date_update==date("01/03/2020", "DMY") & severe_di
> sease_bl!=1 
  0

. tab severe_disease_bl

severe_dise |
     ase_bl |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,076       48.80       48.80
          1 |      2,178       51.20      100.00
------------+-----------------------------------
      Total |      4,254      100.00

. replace severe_disease_fu_date_update = . if severe_disease_bl==1
(1,022 real changes made, 1,022 to missing)

. 
. * Keep only change dates to create time-varying dataset
. keep patient_id covid_vacc_first_date_update severe_disease_fu_date_update li
> ver_transplant_fu_date_update severe_disease_bl end_date

. * Chercking number of patient_id's 
. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [3,9993]                     units:  1
         unique values:  1,000                    missing .:  0/4,254

                  mean:   4860.55
              std. dev:   2912.14

           percentiles:        10%       25%       50%       75%       90%
                               874      2244      4864      7295      8945

. duplicates drop 

Duplicates in terms of all variables

(3,254 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [3,9993]                     units:  1
         unique values:  1,000                    missing .:  0/1,000

                  mean:   4933.66
              std. dev:   2892.41

           percentiles:        10%       25%       50%       75%       90%
                             890.5    2414.5      4998    7352.5      8947

. count
  1,000

. * Create file for each covariate to merge onto udca exposure file 
. * First covid vaccination and liver transplant as all people will begin at ze
> ro 
. rename liver_transplant_fu_date_update liver_trans_date_update

. foreach var in covid_vacc_first liver_trans {
  2.     preserve
  3.     keep patient_id `var'_date_update end_date
  4.     * Drop updates after the end of follow-up 
.     count if `var'_date>=end_date 
  5.     replace `var'_date = . if `var'_date>=end_date 
  6.     * Flag if variable is updated
.     gen `var'=(`var'_date_update!=.)
  7.     * Create extra row if variable is updated 
.     gen expand = `var'+1
  8.     tab expand
  9.     expand expand, gen(newv)
 10.     * Update variables so row for when zero and row for when updated - if 
> not updated whole time will be zero 
.     gen start = date("01/03/2020", "DMY") if newv==0
 11.     replace start = `var'_date_update if newv==1
 12.     gen stop = `var'_date_update if newv==0
 13.     replace stop = end_date if stop==.
 14.     replace `var'=0 if newv==0
 15.     save ./output/tv_`var'_check, replace
 16.     keep patient_id `var' start stop
 17.     * Check data 
.     count if start==stop 
 18.     * drop where start is same as stop - should not drop any in real data 
.     drop if start==stop 
 19.     count if stop<start
 20.     codebook patient_id
 21.     save ./output/tv_`var', replace
 22.     restore
 23. }
  586
(0 real changes made)

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        586       58.60       58.60
          2 |        414       41.40      100.00
------------+-----------------------------------
      Total |      1,000      100.00
(414 observations created)
(414 missing values generated)
(414 real changes made)
(1,000 missing values generated)
(1,000 real changes made)
(414 real changes made)
(note: file ./output/tv_covid_vacc_first_check.dta not found)
file ./output/tv_covid_vacc_first_check.dta saved
  0
(0 observations deleted)
  0

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [3,9993]                     units:  1
         unique values:  1,000                    missing .:  0/1,414

                  mean:   4895.36
              std. dev:   2910.17

           percentiles:        10%       25%       50%       75%       90%
                               886      2296      4890      7344      8946
(note: file ./output/tv_covid_vacc_first.dta not found)
file ./output/tv_covid_vacc_first.dta saved
  994
(0 real changes made)

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        994       99.40       99.40
          2 |          6        0.60      100.00
------------+-----------------------------------
      Total |      1,000      100.00
(6 observations created)
(6 missing values generated)
(6 real changes made)
(1,000 missing values generated)
(1,000 real changes made)
(6 real changes made)
(note: file ./output/tv_liver_trans_check.dta not found)
file ./output/tv_liver_trans_check.dta saved
  0
(0 observations deleted)
  0

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [3,9993]                     units:  1
         unique values:  1,000                    missing .:  0/1,006

                  mean:   4943.38
              std. dev:   2896.11

           percentiles:        10%       25%       50%       75%       90%
                               895      2416    5007.5      7374      8983
(note: file ./output/tv_liver_trans.dta not found)
file ./output/tv_liver_trans.dta saved

. 
. * Same for liver disease severity, but variable can start at 1 and remain for
>  whole of follow-up 
. preserve

. keep patient_id severe_disease_fu_date_update end_date severe_disease_bl

. * Drop updates after the end of follow-up 
. replace severe_disease_fu_date_update=. if severe_disease_fu_date_update>=end
> _date 
(0 real changes made)

. * Flag if variable is updated
. gen severe_disease=(severe_disease_fu_date_update!=.)

. tab severe_disease 

severe_dise |
        ase |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        808       80.80       80.80
          1 |        192       19.20      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. replace severe_disease = 0 if severe_disease_bl==1
(0 real changes made)

. * Create extra row if variable is updated 
. gen expand = severe_disease + 1

. tab expand

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        808       80.80       80.80
          2 |        192       19.20      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. expand expand, gen(newv)
(192 observations created)

. tab newv

       newv |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,000       83.89       83.89
          1 |        192       16.11      100.00
------------+-----------------------------------
      Total |      1,192      100.00

. * Update variables so row for when zero and row for when updated - if not upd
> ated whole time will be zero 
. gen start = date("01/03/2020", "DMY") if newv==0
(192 missing values generated)

. replace start = severe_disease_fu_date_update if newv==1
(192 real changes made)

. gen stop = severe_disease_fu_date_update if newv==0 & severe_disease==1
(1,000 missing values generated)

. count if stop!=.
  192

. replace stop = end_date if stop==. 
(1,000 real changes made)

. count if stop==.
  0

. replace severe_disease=0 if newv==0 & severe_disease_bl==0
(192 real changes made)

. replace severe_disease=1 if newv==0 & severe_disease_bl==1
(500 real changes made)

. save ./output/tv_severe_disease_check, replace
(note: file ./output/tv_severe_disease_check.dta not found)
file ./output/tv_severe_disease_check.dta saved

. keep patient_id severe_disease start stop

. * Check data 
. count if start==stop
  0

. * drop if start is same as stop - should not drop any in real data 
. drop if start==stop 
(0 observations deleted)

. count if stop<start
  0

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [3,9993]                     units:  1
         unique values:  1,000                    missing .:  0/1,192

                  mean:   4904.94
              std. dev:   2901.14

           percentiles:        10%       25%       50%       75%       90%
                               886      2339      4929      7352      8936

. save ./output/tv_severe_disease, replace
(note: file ./output/tv_severe_disease.dta not found)
file ./output/tv_severe_disease.dta saved

. restore

. 
. * Make age time-varying i.e. updating on 1st January each year
. use `tempfile', clear 

. * Determine end of follow-up date
. gen dereg_dateA = date(dereg_date, "YMD")
(500 missing values generated)

. format %dD/N/CY dereg_dateA

. drop dereg_date

. gen died_dateA = date(died_date_ons, "YMD")
(500 missing values generated)

. format %dD/N/CY died_dateA

. drop died_date_ons

. * Determine end of follow-up then add rows to update age for each year of fol
> low-up
. gen end_study = date("31/12/2022", "DMY")

. egen end_date = rowmin(dereg_dateA end_study died_dateA)

. keep patient_id age end_date

. gen yr_end = year(end_date)

. * Add rows to update age
. gen expand = 3 if yr_end==2022
(447 missing values generated)

. replace expand = 2 if yr_end==2021
(222 real changes made)

. replace expand = 1 if yr_end==2020
(225 real changes made)

. tab expand, m

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        225       22.50       22.50
          2 |        222       22.20       44.70
          3 |        553       55.30      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. expand expand, gen(newv)
(1,328 observations created)

. tab newv, nolabel

       newv |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,000       42.96       42.96
          1 |      1,328       57.04      100.00
------------+-----------------------------------
      Total |      2,328      100.00

. bys patient_id newv: gen number = _n 

. tab newv number, nolabel

           |        number
      newv |         1          2 |     Total
-----------+----------------------+----------
         0 |     1,000          0 |     1,000 
         1 |       775        553 |     1,328 
-----------+----------------------+----------
     Total |     1,775        553 |     2,328 

. gen start = date("01/03/2020", "DMY") if newv==0
(1,328 missing values generated)

. replace start = date("01/01/2021", "DMY") if newv==1 & number==1
(775 real changes made)

. replace start = date("01/01/2022", "DMY") if newv==1 & number==2
(553 real changes made)

. gen stop = date("01/01/2021", "DMY") if newv==0 
(1,328 missing values generated)

. replace stop = end_date if newv==0 & end_date<stop 
(225 real changes made)

. replace stop = date("01/01/2022", "DMY") if newv==1 & number==1 
(775 real changes made)

. replace stop = end_date if newv==1 & number==1 & end_date<stop
(222 real changes made)

. replace stop = date("31/12/2022", "DMY") if newv==1 & number==2 
(553 real changes made)

. replace stop = end_date if newv==1 & number==2 & end_date<stop
(178 real changes made)

. gen age_tv = age if newv==0
(1,328 missing values generated)

. replace age_tv = age+1 if newv==1 & number==1
(775 real changes made)

. replace age_tv = age+2 if newv==1 & number==2
(553 real changes made)

. keep patient_id start stop age_tv 

. drop if start==stop
(1 observation deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [3,9993]                     units:  1
         unique values:  1,000                    missing .:  0/2,327

                  mean:    4881.8
              std. dev:   2897.11

           percentiles:        10%       25%       50%       75%       90%
                               876      2319      4884      7295      8930

. save ./output/tv_age, replace 
(note: file ./output/tv_age.dta not found)
file ./output/tv_age.dta saved

. 
. * COVID waves 
. use `tempfile', clear

. * Determine end of follow-up date
. gen dereg_dateA = date(dereg_date, "YMD")
(500 missing values generated)

. format %dD/N/CY dereg_dateA

. drop dereg_date

. gen died_date_onsA = date(died_date_ons, "YMD")
(500 missing values generated)

. format %dD/N/CY died_date_onsA

. drop died_date_ons

. * Determine end of follow-up then add rows to update waves 
. gen end_study = date("31/12/2022", "DMY")

. egen end_date = rowmin(dereg_dateA end_study died_date_onsA)

. gen expand = 1 if end_date <= date("31/08/2020", "DMY")
(856 missing values generated)

. replace expand = 2 if end_date <= date("30/06/2021", "DMY") & expand==.
(207 real changes made)

. replace expand = 3 if end_date <= date("30/11/2021", "DMY") & expand==.
(83 real changes made)

. replace expand = 4 if end_date <= date("31/12/2022", "DMY") & expand==.
(566 real changes made)

. tab expand 

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        144       14.40       14.40
          2 |        207       20.70       35.10
          3 |         83        8.30       43.40
          4 |        566       56.60      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. keep patient_id expand end_date

. expand expand, gen(newv) 
(2,071 observations created)

. tab newv 

       newv |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,000       32.56       32.56
          1 |      2,071       67.44      100.00
------------+-----------------------------------
      Total |      3,071      100.00

. bys patient_id newv: gen number = _n 

. * wave 1 row 
. gen start = date("01/03/2020", "DMY") if newv==0
(2,071 missing values generated)

. gen wave = 1 if newv==0
(2,071 missing values generated)

. gen stop = date("01/09/2020", "DMY") if newv==0 
(2,071 missing values generated)

. replace stop = end_date if end_date<stop & wave==1
(144 real changes made)

. tab expand if stop==end_date & wave==1

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        144       99.31       99.31
          2 |          1        0.69      100.00
------------+-----------------------------------
      Total |        145      100.00

. * wave 2 row
. replace start = date("01/09/2020", "DMY") if newv==1 & number==1
(856 real changes made)

. replace wave = 2 if newv==1 & number==1
(856 real changes made)

. replace stop = date("01/07/2021", "DMY") if newv==1 & number==1
(856 real changes made)

. replace stop = end_date if end_date<stop & wave==2
(207 real changes made)

. * wave 3 row 
. replace start = date("01/07/2021", "DMY") if newv==1 & number==2
(649 real changes made)

. replace wave = 3 if newv==1 & number==2
(649 real changes made)

. replace stop = date("01/12/2021", "DMY") if newv==1 & number==2
(649 real changes made)

. replace stop = end_date if end_date<stop & wave==3
(83 real changes made)

. * wave 4 row 
. replace start = date("01/12/2021", "DMY") if newv==1 & number==3
(566 real changes made)

. replace wave = 4 if newv==1 & number==3
(566 real changes made)

. replace stop = date("31/12/2022", "DMY") if newv==1 & number==3
(566 real changes made)

. replace stop = end_date if end_date<stop & wave==4
(191 real changes made)

. keep patient_id start stop wave

. drop if start==stop 
(2 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [3,9993]                     units:  1
         unique values:  1,000                    missing .:  0/3,069

                  mean:   4861.37
              std. dev:   2895.62

           percentiles:        10%       25%       50%       75%       90%
                               876      2300      4866      7286      8930

. save ./output/tv_waves, replace
(note: file ./output/tv_waves.dta not found)
file ./output/tv_waves.dta saved

. 
. * Create files for outcomes
. use `tempfile', clear

. * Determine end of follow-up date
. foreach var in died_date_ons hosp_covid_primary hosp_covid_any dereg_date {
  2.     gen `var'A = date(`var', "YMD")
  3.     format `var'A %dD/N/CY
  4.     drop `var'
  5.     gen yr_`var' = year(`var'A)
  6.     tab yr_`var'
  7.     replace `var'A=. if yr_`var'==2023
  8. }
(500 missing values generated)
(500 missing values generated)

yr_died_dat |
      e_ons |      Freq.     Percent        Cum.
------------+-----------------------------------
       2020 |        116       23.20       23.20
       2021 |        148       29.60       52.80
       2022 |        134       26.80       79.60
       2023 |        102       20.40      100.00
------------+-----------------------------------
      Total |        500      100.00
(102 real changes made, 102 to missing)
(900 missing values generated)
(900 missing values generated)

yr_hosp_cov |
 id_primary |      Freq.     Percent        Cum.
------------+-----------------------------------
       2020 |         18       18.00       18.00
       2021 |         32       32.00       50.00
       2022 |         36       36.00       86.00
       2023 |         14       14.00      100.00
------------+-----------------------------------
      Total |        100      100.00
(14 real changes made, 14 to missing)
(900 missing values generated)
(900 missing values generated)

yr_hosp_cov |
     id_any |      Freq.     Percent        Cum.
------------+-----------------------------------
       2020 |         24       24.00       24.00
       2021 |         22       22.00       46.00
       2022 |         30       30.00       76.00
       2023 |         24       24.00      100.00
------------+-----------------------------------
      Total |        100      100.00
(24 real changes made, 24 to missing)
(500 missing values generated)
(500 missing values generated)

yr_dereg_da |
         te |      Freq.     Percent        Cum.
------------+-----------------------------------
       2020 |        123       24.60       24.60
       2021 |        133       26.60       51.20
       2022 |        134       26.80       78.00
       2023 |        110       22.00      100.00
------------+-----------------------------------
      Total |        500      100.00
(110 real changes made, 110 to missing)

. gen end_study = date("31/12/2022", "DMY")

. egen end_date = rowmin(dereg_dateA end_study died_date_onsA)

. 
. * Create flag indicating reason for end of follow-up 
. gen end_date_flag = (end_date==dereg_dateA)

. replace end_date_flag = 2 if end_date==died_date_onsA
(323 real changes made)

. replace end_date_flag = 3 if end_date==end_study
(375 real changes made)

. replace died_date_onsA=. if end_date<died_date_onsA
(75 real changes made, 75 to missing)

. replace died_ons_covid_flag_any=0 if end_date<died_date_onsA & died_ons_covid
> _flag_any==1
(335 real changes made)

. replace hosp_covid_anyA=. if end_date<hosp_covid_anyA
(19 real changes made, 19 to missing)

. gen hosp_any_flag = hosp_covid_anyA!=.

. 
. * Composite outcome 
. gen hosp_died_composite = (died_ons_covid_flag_any==1 | hosp_any_flag==1)

. egen hosp_died_dateA = rowmin(died_date_onsA hosp_covid_anyA)
(634 missing values generated)

. replace hosp_died_dateA=. if hosp_died_composite==0
(152 real changes made, 152 to missing)

. 
. * Check how composite is made up 
. tab died_ons_covid_flag_any hosp_any_flag

died_ons_c |
ovid_flag_ |     hosp_any_flag
       any |         0          1 |     Total
-----------+----------------------+----------
         0 |       786         49 |       835 
         1 |       157          8 |       165 
-----------+----------------------+----------
     Total |       943         57 |     1,000 

. di "Number where composite date = death date only"
Number where composite date = death date only

. count if hosp_died_dateA==died_date_onsA & hosp_died_dateA!=. & hosp_died_dat
> eA!=hosp_covid_anyA
  157

. di "Number where composite = hospitalisation date only"
Number where composite = hospitalisation date only

. count if hosp_died_dateA==hosp_covid_anyA & hosp_died_dateA!=. & hosp_died_da
> teA!=died_date_onsA
  57

. di "Number where composite = both death and hospitalisation date 
Number where composite = both death and hospitalisation date

. count if hosp_died_dateA==died_date_onsA & hosp_died_dateA!=. & hosp_died_dat
> eA==hosp_covid_anyA
  0

. 
. * Make file for each outcome: covid death, hospitalisation and composite 
. * Files contain patient ID, start = start study, stop = either end date for p
> atient or date of outcome 
. * and flag for outcome 
. * COVID death - covid code in any position
. preserve 

. keep patient_id end_date died_ons_covid_flag_any died_date_onsA

. gen start = date("01/03/2020", "DMY")

. egen stop = rowmin(died_date_onsA end_date)

. count if died_ons_covid_flag_any ==1 & end_date<died_date_onsA
  0

. replace died_ons_covid_flag_any=0 if end_date<died_date_onsA
(0 real changes made)

. keep patient_id start stop died_ons_covid_flag_any

. rename died_ons_covid_flag_any died_covid_any_flag

. save ./output/tv_outcome_died_covid_any, replace 
(note: file ./output/tv_outcome_died_covid_any.dta not found)
file ./output/tv_outcome_died_covid_any.dta saved

. tab died_covid_any_flag, m

died_covid_ |
   any_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        835       83.50       83.50
          1 |        165       16.50      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [3,9993]                     units:  1
         unique values:  1,000                    missing .:  0/1,000

                  mean:   4933.66
              std. dev:   2892.41

           percentiles:        10%       25%       50%       75%       90%
                             890.5    2414.5      4998    7352.5      8947

. restore 

. 
. * Hospitalisation - covid code in any position
. preserve 

. keep patient_id end_date hosp_any_flag hosp_covid_anyA end_date_flag

. gen start = date("01/03/2020", "DMY")

. egen stop = rowmin(hosp_covid_anyA end_date)

. count if hosp_any_flag ==1 & end_date<hosp_covid_anyA
  0

. tab end_date_flag if hosp_any_flag ==1 & end_date<hosp_covid_anyA
no observations

. replace hosp_any_flag=0 if end_date<hosp_covid_anyA
(0 real changes made)

. keep patient_id start stop hosp_any_flag

. save ./output/tv_outcome_hosp_any, replace 
(note: file ./output/tv_outcome_hosp_any.dta not found)
file ./output/tv_outcome_hosp_any.dta saved

. tab hosp_any_flag, m

hosp_any_fl |
         ag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        943       94.30       94.30
          1 |         57        5.70      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [3,9993]                     units:  1
         unique values:  1,000                    missing .:  0/1,000

                  mean:   4933.66
              std. dev:   2892.41

           percentiles:        10%       25%       50%       75%       90%
                             890.5    2414.5      4998    7352.5      8947

. count
  1,000

. bys patient_id: egen total_hosp = total(hosp_any_flag)

. tab total_hosp

 total_hosp |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        943       94.30       94.30
          1 |         57        5.70      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. restore 

. 
. * Composite 
. preserve 

. keep patient_id hosp_died* end_date

. gen start = date("01/03/2020", "DMY")

. egen stop = rowmin(hosp_died_dateA end_date)

. count if hosp_died_composite==1 & end_date<hosp_died_dateA
  0

. replace hosp_died_composite=0 if end_date<hosp_died_dateA
(0 real changes made)

. keep patient_id start stop hosp_died_composite

. rename hosp_died_composite composite_any_flag

. save ./output/tv_outcome_composite_any, replace 
(note: file ./output/tv_outcome_composite_any.dta not found)
file ./output/tv_outcome_composite_any.dta saved

. tab composite_any_flag, m

composite_a |
    ny_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        786       78.60       78.60
          1 |        214       21.40      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [3,9993]                     units:  1
         unique values:  1,000                    missing .:  0/1,000

                  mean:   4933.66
              std. dev:   2892.41

           percentiles:        10%       25%       50%       75%       90%
                             890.5    2414.5      4998    7352.5      8947

. restore 

. 
. * Merge files together for each outcome
. * Composite  
. use ./output/tv_severe_disease, clear 

. tvc_merge start stop using ./output/tv_covid_vacc_first, id(patient_id)

. tvc_merge start stop using ./output/tv_liver_trans, id(patient_id)

. tvc_merge start stop using ./output/time_varying_udca_120, id(patient_id)

. tvc_merge start stop using ./output/tv_age, id(patient_id)

. tvc_merge start stop using ./output/tv_outcome_composite_any, id(patient_id) 
> failure(composite_any_flag)

. * Dummy drug data includes people not in cohort, so drop these - should not b
> e any in real data 
. drop if age_tv==.
(1,798 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [3,9993]                     units:  1
         unique values:  1,000                    missing .:  0/3,068

                  mean:   4882.47
              std. dev:   2913.94

           percentiles:        10%       25%       50%       75%       90%
                               876      2273      4869      7344      8945

. * Check number of outcomes after merge  - there will be missings for rows aft
> er event
. tab composite_any_flag, m

composite_a |
    ny_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,719       88.62       88.62
          1 |        214        6.98       95.60
          . |        135        4.40      100.00
------------+-----------------------------------
      Total |      3,068      100.00

. missings report

Checking missings in all variables:
135 observations with missing values

  +--------------------------------+
  |                      # missing |
  |--------------------------------|
  | composite_any_flag         135 |
  +--------------------------------+

. drop if composite_any_flag==.
(135 observations deleted)

. save ./output/tv_vars_composite_any, replace 
(note: file ./output/tv_vars_composite_any.dta not found)
file ./output/tv_vars_composite_any.dta saved

. 
. * COVID death - covid code in any position
. use ./output/tv_severe_disease, clear 

. tvc_merge start stop using ./output/tv_covid_vacc_first, id(patient_id)

. tvc_merge start stop using ./output/tv_liver_trans, id(patient_id)

. tvc_merge start stop using ./output/time_varying_udca_120, id(patient_id)

. tvc_merge start stop using ./output/tv_age, id(patient_id)

. tvc_merge start stop using ./output/tv_outcome_died_covid_any, id(patient_id)
>  failure(died_covid_any_flag)

. * Dummy drug data includes people not in cohort, so drop these - should not b
> e any in real data 
. drop if age_tv==.
(1,798 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [3,9993]                     units:  1
         unique values:  1,000                    missing .:  0/3,012

                  mean:   4881.44
              std. dev:    2914.8

           percentiles:        10%       25%       50%       75%       90%
                               886    2269.5      4872      7344      8945

. * Check number of outcomes after merge 
. tab died_covid_any_flag, m

died_covid_ |
   any_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,847       94.52       94.52
          1 |        165        5.48      100.00
------------+-----------------------------------
      Total |      3,012      100.00

. missings report

Checking missings in all variables:
0 observations with missing values

. save ./output/tv_vars_died_covid_any, replace 
(note: file ./output/tv_vars_died_covid_any.dta not found)
file ./output/tv_vars_died_covid_any.dta saved

. 
. * COVID hospitalisation - covid code in any position
. use ./output/tv_severe_disease, clear 

. tvc_merge start stop using ./output/tv_covid_vacc_first, id(patient_id)

. tvc_merge start stop using ./output/tv_liver_trans, id(patient_id)

. tvc_merge start stop using ./output/time_varying_udca_120, id(patient_id)

. tvc_merge start stop using ./output/tv_age, id(patient_id)

. tvc_merge start stop using ./output/tv_outcome_hosp_any, id(patient_id) failu
> re(hosp_any_flag)

. * Check number of outcomes after merge 
. tab hosp_any_flag, m

hosp_any_fl |
         ag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,876       59.10       59.10
          1 |         57        1.17       60.28
          . |      1,933       39.72      100.00
------------+-----------------------------------
      Total |      4,866      100.00

. bys patient_id: egen total_hosp = total(hosp_any_flag)

. tab total_hosp

 total_hosp |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,601       94.55       94.55
          1 |        265        5.45      100.00
------------+-----------------------------------
      Total |      4,866      100.00

. * Dummy drug data includes people not in cohort, so drop these - should not b
> e any in real data 
. drop if age_tv==.
(1,798 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [3,9993]                     units:  1
         unique values:  1,000                    missing .:  0/3,068

                  mean:   4882.47
              std. dev:   2913.94

           percentiles:        10%       25%       50%       75%       90%
                               876      2273      4869      7344      8945

. * Check number of outcomes after merge - there will be missings for rows afte
> r event
. tab hosp_any_flag, m 

hosp_any_fl |
         ag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,876       93.74       93.74
          1 |         57        1.86       95.60
          . |        135        4.40      100.00
------------+-----------------------------------
      Total |      3,068      100.00

. missings report

Checking missings in all variables:
135 observations with missing values

  +---------------------------+
  |                 # missing |
  |---------------------------|
  | hosp_any_flag         135 |
  +---------------------------+

. drop if hosp_any_flag==.
(135 observations deleted)

. save ./output/tv_vars_hosp_any, replace 
(note: file ./output/tv_vars_hosp_any.dta not found)
file ./output/tv_vars_hosp_any.dta saved

. 
. /* Format file with static covariates: sex, region, covid high risk condition
> s, 
> ethnicity, imd, bmi, smoking. */
. 
. ** Need to decide on second line therapies 
. use `tempfile', clear

. describe 

Contains data from /tmp/St00015.000001
  obs:         1,000                          
 vars:           109                          25 Sep 2023 12:27
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
dereg_date      str10   %10s                  
has_pbc_date    int     %8.0g                 
has_psc_date    int     %8.0g                 
fu_liver_tran~d str10   %10s                  
fu_liver_tran~s str10   %10s                  
udca_last_date  str10   %10s                  
udca_first_af~r str10   %10s                  
udca_first_hi~y str10   %10s                  
covid_va~t_date str10   %10s                  
covid_vacc_se~e str10   %10s                  
covid_vacc_th~e str10   %10s                  
covid_vacc_fo~e str10   %10s                  
covid_~fth_date str10   %10s                  
date_most_rec~c str10   %10s                  
severe_disea~ed str10   %10s                  
severe_disea~cd str10   %10s                  
solid_organ_t~m str10   %10s                  solid_organ_transplant_nhsd_snome
                                                > d
solid_organ_n~w str10   %10s                  
solid_organ_t~s byte    %8.0g                 solid_organ_transplant_nhsd_opcs4
transplant_al~4 byte    %8.0g                 
transplant_th~4 str10   %10s                  
transplant_co~p byte    %8.0g                 transplant_conjunctiva_y_code_opc
                                                > s4
transplant_co~4 str10   %10s                  
transplant_st~4 str10   %10s                  
transplant_il.. byte    %8.0g                 transplant_ileum_1_Y_codes_opcs4
transplant_il.. byte    %8.0g                 transplant_ileum_2_Y_codes_opcs4
transpl~1_opcs4 str10   %10s                  
transpl~2_opcs4 str10   %10s                  
hosp_covid_pr~y str10   %10s                  
hosp_covid_any  str10   %10s                  
died_date_ons   str10   %10s                  
age             byte    %8.0g                 
sex             str1    %9s                   
stp             str4    %9s                   
region_nhs      str24   %24s                  
has_msoa        byte    %8.0g                 
imd             byte    %8.0g                 
eth             byte    %8.0g                 
ethnicity_sus   byte    %8.0g                 
ethnicity       byte    %8.0g                 
smoking_status  str1    %9s                   
bmi             float   %9.0g                 
has_pbc         byte    %8.0g                 
has_psc         byte    %8.0g                 
liver_transpl~l byte    %8.0g                 
udca_count_bl   byte    %8.0g                 
udca_count_fu   byte    %8.0g                 
oca_bl          byte    %8.0g                 
budesonide_co~u byte    %8.0g                 
budesonide_co~l byte    %8.0g                 
fenofibrate_c~u byte    %8.0g                 
fenofibrate_c~l byte    %8.0g                 
gc_count_fu     byte    %8.0g                 
gc_count_bl     byte    %8.0g                 
rituximab_bl    byte    %8.0g                 
severe_diseas~l byte    %8.0g                 
learning_disa~d byte    %8.0g                 
cancer_opensa~d byte    %8.0g                 
cancer_opensa~w byte    %8.0g                 
cancer_opensa~r byte    %8.0g                 
haematopoieti~d byte    %8.0g                 
haematopoiet~10 byte    %8.0g                 
haematopoieti~4 byte    %8.0g                 
haematologica~m byte    %8.0g                 haematological_malignancies_snome
                                                > d
haematologica~1 byte    %8.0g                 haematological_malignancies_icd10
sickle_cell_d~d byte    %8.0g                 
sickle_cell_~10 byte    %8.0g                 
haematopoieti~_ byte    %8.0g                 haematopoietic_stem_cell_snomed_e
                                                > ver
haematopoie~0_e byte    %8.0g                 haematopoietic_stem_cell_icd10_ev
                                                > er
haematopoie~4_e byte    %8.0g                 haematopoietic_stem_cell_opcs4_ev
                                                > er
v71             byte    %8.0g                 haematological_malignancies_snome
                                                > d_ever
v72             byte    %8.0g                 haematological_malignancies_icd10
                                                > _ever
ckd_stage_5_~ed byte    %8.0g                 
ckd_stage_5_~10 byte    %8.0g                 
immunosuppres~d byte    %8.0g                 
oral_steroid_~d byte    %8.0g                 
oral_s~3m_count byte    %8.0g                 
oral_s~2m_count byte    %8.0g                 
immunosuppres~r byte    %8.0g                 
oral_steroid_~r byte    %8.0g                 
immunosupress~d byte    %8.0g                 
immunosupress~w byte    %8.0g                 
hiv_aids_nhsd~d byte    %8.0g                 
hiv_aids_nhs~10 byte    %8.0g                 
multiple_scl~ed byte    %8.0g                 
multiple_scl~10 byte    %8.0g                 
motor_neurone~e byte    %8.0g                 motor_neurone_disease_nhsd_snomed
motor_neuron~10 byte    %8.0g                 
myasthenia_g~ed byte    %8.0g                 
myasthenia_g~10 byte    %8.0g                 
huntingtons_~ed byte    %8.0g                 
huntingtons_~10 byte    %8.0g                 
died_ons_live~y byte    %8.0g                 
died_ons_live~g byte    %8.0g                 
died_ons_covi~y byte    %8.0g                 
died_ons_covi~g byte    %8.0g                 
liver_transpl~e str10   %10s                  
severe_diseas~e str10   %10s                  
haematologica~d byte    %8.0g                 
haematologica~r byte    %8.0g                 
ckd_stage_5_~sd byte    %8.0g                 
hiv_aids_nhsd   byte    %8.0g                 
solid_organ_t~d str10   %10s                  
solid_organ_t~w str10   %10s                  
multiple_scl~sd byte    %8.0g                 
motor_neurone~d byte    %8.0g                 
myasthenia_g~sd byte    %8.0g                 
huntingtons_~sd byte    %8.0g                 
patient_id      int     %8.0g                 
-------------------------------------------------------------------------------
Sorted by: 

. * Format variables 
. * Sex
. gen male = 1 if sex == "M"
(511 missing values generated)

. replace male = 0 if sex == "F"
(502 real changes made)

. * Ethnicity
. replace ethnicity=6 if ethnicity==0
(55 real changes made)

. label define eth5                       1 "White"                            
>            ///
>                             2 "Mixed"                           ///          
>                                    
>                             3 "Asian"                                   ///
>                             4 "Black"                                   ///
>                             5 "Other"                                   ///
>                             6 "Unknown"

.                     
. 
. label values ethnicity eth5

. safetab ethnicity, m
10

  ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |        137       13.70       13.70
      Mixed |        206       20.60       34.30
      Asian |        225       22.50       56.80
      Black |        177       17.70       74.50
      Other |        200       20.00       94.50
    Unknown |         55        5.50      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. * Create White vs non-White ethnicity variable
. gen eth_bin = (ethnicity!=1)

. replace eth_bin = 2 if ethnicity==6
(55 real changes made)

. label define eth_3 0 "White" 1 "Non-White" 2 "Unknown"

. label values eth_bin eth_3

. tab eth_bin ethnicity, m 

           |                       ethnicity
   eth_bin |     White      Mixed      Asian      Black      Other |     Total
-----------+-------------------------------------------------------+----------
     White |       137          0          0          0          0 |       137 
 Non-White |         0        206        225        177        200 |       808 
   Unknown |         0          0          0          0          0 |        55 
-----------+-------------------------------------------------------+----------
     Total |       137        206        225        177        200 |     1,000 


           | ethnicity
   eth_bin |   Unknown |     Total
-----------+-----------+----------
     White |         0 |       137 
 Non-White |         0 |       808 
   Unknown |        55 |        55 
-----------+-----------+----------
     Total |        55 |     1,000 

. 
. 
. * IMD - should not be missing (i.e. 0) in real data
. replace imd=6 if imd==0
(47 real changes made)

. 
. * BMI categories
. * assume BMI's less than 10 are incorrect and set to missing 
. sum bmi, d 

                             bmi
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,000
25%     16.60778              0       Sum of Wgt.       1,000

50%      25.6845                      Mean           22.72443
                        Largest       Std. Dev.      13.42281
75%     32.45396       49.63896
90%      37.5406       50.48814       Variance       180.1718
95%     41.11365       50.64924       Skewness      -.5297416
99%     47.62017       52.83505       Kurtosis       2.287056

. replace bmi = . if bmi<10
(206 real changes made, 206 to missing)

. egen bmi_cat = cut(bmi), at(0, 1, 18.5, 24.9, 29.9, 39.9, 100) icodes
(206 missing values generated)

. bys bmi_cat: sum bmi

-------------------------------------------------------------------------------
-> bmi_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |         82    15.64375    2.288443   10.31201   18.47222

-------------------------------------------------------------------------------
-> bmi_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        189    22.07299    1.754937   18.53326   24.89909

-------------------------------------------------------------------------------
-> bmi_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        195     27.6185     1.43103   24.92195   29.88546

-------------------------------------------------------------------------------
-> bmi_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        264    34.23555    2.686642   29.91033    39.8931

-------------------------------------------------------------------------------
-> bmi_cat = 5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |         64    43.61569    3.053526   39.94916   52.83505

-------------------------------------------------------------------------------
-> bmi_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |          0


. * assume missing . is healthy range BMI
. replace bmi_cat = 2 if bmi_cat==. 
(206 real changes made)

. label define bmi 1 "Underweight" 2 "Healthy range" 3 "Overweight" 4 "Obese" 5
>  "Morbidly obese"

. label values bmi_cat bmi

. tab bmi_cat 

       bmi_cat |      Freq.     Percent        Cum.
---------------+-----------------------------------
   Underweight |         82        8.20        8.20
 Healthy range |        395       39.50       47.70
    Overweight |        195       19.50       67.20
         Obese |        264       26.40       93.60
Morbidly obese |         64        6.40      100.00
---------------+-----------------------------------
         Total |      1,000      100.00

. 
. * Smoking status - assume missings are non-smokers 
. gen smoking = 0 if smoking_status=="N"
(886 missing values generated)

. replace smoking = 1 if smoking_status=="S"
(187 real changes made)

. replace smoking = 2 if smoking_status=="E"
(155 real changes made)

. replace smoking = 1 if smoking==.
(544 real changes made)

. label define smok 1 "Current smoker" 2 "Ex-smoker" 0 "Never smoked" 

. label values smoking smok

. tab smoking 

       smoking |      Freq.     Percent        Cum.
---------------+-----------------------------------
  Never smoked |        114       11.40       11.40
Current smoker |        731       73.10       84.50
     Ex-smoker |        155       15.50      100.00
---------------+-----------------------------------
         Total |      1,000      100.00

. 
. * High risk covid conditions
. replace oral_steroid_drugs_nhsd=. if oral_steroid_drug_nhsd_3m_count < 2 & or
> al_steroid_drug_nhsd_12m_count < 4
(935 real changes made, 935 to missing)

. gen imid_nhsd=max(oral_steroid_drugs_nhsd, immunosuppresant_drugs_nhsd)

. gen rare_neuro_nhsd = max(multiple_sclerosis_nhsd, motor_neurone_disease_nhsd
> , myasthenia_gravis_nhsd, huntingtons_disease_nhsd)

. gen solid_organ_transplant_bin = solid_organ_transplant_nhsd_new!=""

. gen any_high_risk_condition = max(learning_disability_nhsd_snomed, cancer_ope
> nsafely_snomed_new, haematological_disease_nhsd, ///
> ckd_stage_5_nhsd, imid_nhsd, immunosupression_nhsd_new, hiv_aids_nhsd, solid_
> organ_transplant_bin, rare_neuro_nhsd)

. 
. * Time from most recent vaccination on 1st March 2021
. gen date_most_recent_cov_vacA = date(date_most_recent_cov_vac, "YMD")
(961 missing values generated)

. gen time_vacc = date("01Mar2021", "DMY") - date_most_recent_cov_vacA
(961 missing values generated)

. sum time_vacc, d

                          time_vacc
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            2              2
10%            6              4       Obs                  39
25%           17              6       Sum of Wgt.          39

50%           33                      Mean           29.92308
                        Largest       Std. Dev.      17.07473
75%           42             56
90%           56             57       Variance       291.5466
95%           59             59       Skewness       .0906015
99%           61             61       Kurtosis        1.94112

. xtile time_vacc_cat = time_vacc, nq(4)

. replace time_vacc_cat = 5 if time_vacc_cat == .
(961 real changes made)

. bys time_vacc_cat: sum time_vacc 

-------------------------------------------------------------------------------
-> time_vacc_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   time_vacc |         11    10.18182    6.242086          1         17

-------------------------------------------------------------------------------
-> time_vacc_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   time_vacc |         12    25.08333    6.542981         18         33

-------------------------------------------------------------------------------
-> time_vacc_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   time_vacc |          7    40.42857    1.718249         38         42

-------------------------------------------------------------------------------
-> time_vacc_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   time_vacc |          9    52.33333    6.519202         44         61

-------------------------------------------------------------------------------
-> time_vacc_cat = 5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   time_vacc |          0


. label define vacc_t 1 "Q1 closest vaccination" 2 "Q2" 3 "Q3" 4 "Q4 furthest v
> accination" 5 "No vaccination" 

. label values time_vacc_cat vacc_t 

. 
. keep patient_id male stp any_high_risk_condition ethnicity imd bmi_cat smokin
> g eth_bin time_vacc_cat has_pbc oca_bl

. tempfile basefile

. save `basefile'
file /tmp/St00015.000008 saved

. foreach var in died_covid_any hosp_any composite_any {
  2.     preserve 
  3.     merge 1:m patient_id using ./output/tv_vars_`var' 
  4.     drop _merge 
  5.     save ./output/an_dataset_`var', replace
  6.     restore
  7. }

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             3,012  (_merge==3)
    -----------------------------------------
(note: file ./output/an_dataset_died_covid_any.dta not found)
file ./output/an_dataset_died_covid_any.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,933  (_merge==3)
    -----------------------------------------
(note: file ./output/an_dataset_hosp_any.dta not found)
file ./output/an_dataset_hosp_any.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,933  (_merge==3)
    -----------------------------------------
(note: file ./output/an_dataset_composite_any.dta not found)
file ./output/an_dataset_composite_any.dta saved

. 
. *****************************************
. * 90 day file: sensitivity analysis 
. use ./output/time_varying_udca_90, clear 

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [0,9995]                     units:  1
         unique values:  1,899                    missing .:  0/2,898

                  mean:   4984.34
              std. dev:   2884.82

           percentiles:        10%       25%       50%       75%       90%
                               995      2509      4970      7501      8945

. merge m:1 patient_id using `tempfile', keepusing(severe_disease_fu_date sever
> e_disease_bl covid_vacc_first_date liver_transplant_fu_date dereg_date died_d
> ate_ons)

    Result                           # of obs.
    -----------------------------------------
    not matched                         1,798
        from master                     1,798  (_merge==1)
        from using                          0  (_merge==2)

    matched                             1,100  (_merge==3)
    -----------------------------------------

. * Should only be required for dummy data 
. keep if _merge==3
(1,798 observations deleted)

. * Only using start date as this is when udca exposure or 6 monthly check occu
> rs
. drop stop

. * Add in rows with each of the 6 monthly assessment dates 
. gen expand=1

. bys patient_id (start): replace expand=6 if _n==_N 
(1000 real changes made)

. expand expand, generate(newv)
(5,000 observations created)

. bys patient_id newv: gen number = _n 

. replace start = date("01/09/2020", "DMY") if newv==1 & number==1
(1,000 real changes made)

. replace start = date("01/03/2021", "DMY") if newv==1 & number==2
(1,000 real changes made)

. replace start = date("01/09/2021", "DMY") if newv==1 & number==3
(1,000 real changes made)

. replace start = date("01/03/2022", "DMY") if newv==1 & number==4
(1,000 real changes made)

. replace start = date("01/09/2022", "DMY") if newv==1 & number==5
(1,000 real changes made)

. 
. * This gives a file where start dates are either exposure switching or 6-mont
> ly assessment dates 
. * These will be used to determine the closest date to time-varying covariate 
> dates identified in study definition 
. sort patient_id start 

. drop newv

. 
. * Determine end of follow-up date
. gen dereg_dateA = date(dereg_date, "YMD")
(3,050 missing values generated)

. format %dD/N/CY dereg_dateA

. drop dereg_date

. gen died_dateA = date(died_date_ons, "YMD")
(3,048 missing values generated)

. format %dD/N/CY died_dateA

. drop died_date_ons

. gen end_study = date("31/12/2022", "DMY")

. egen end_date = rowmin(dereg_dateA end_study died_dateA)

. 
. * Take out assessments after end_date 
. drop if start>end_date
(1,846 observations deleted)

. 
. * Determine number of days between each covariate and dates of UDCA change or
>  6 monthly check date 
. bys patient_id (start): egen last_assess = max(start)

. * Format dates  and identify date nearest after covariate updates 
. foreach var in covid_vacc_first_date severe_disease_fu_date liver_transplant_
> fu_date {
  2.     gen `var'A = date(`var', "YMD")
  3.     format `var'A %dD/N/CY 
  4.     drop `var'
  5.     * time between date of record and change in covariate - positive value
> s are those where record starts after 
.     * covariate change date 
.     gen time_`var' = start - `var'A
  6.     * Set time variable for records prior to change as missing
.     replace time_`var'=. if time_`var'<0
  7.     * Check if any are on index date (1st March) potentially severe diseas
> e - not others
.     di "Number where time-varying update same as assessment date"
  8.     count if time_`var'==0
  9.     di "Number where time-varying update is 1st March 2020"
 10.     count if `var'A==date("01/03/2020", "DMY")
 11.     * Find earliest start date after covariate update
.     * Note: there are some changes that occur after the last available 6 mont
> h assessment or exposure change
.     bys patient_id (time_`var'): gen `var'_updateN = start[1] if `var'A!=. & 
> time_`var'!=.
 12.     * Spread to all rows for patient 
.     bys patient_id: egen `var'_update = max(`var'_updateN)
 13.     format `var'_update %dD/N/CY 
 14.     di "Number where new variable is prior to original variable (should be
>  0)"
 15.     count if `var'_update < `var'A
 16.     di "Number where time varying update is after last assessment date"
 17.     count if `var'A > last_assess & `var'A!=.  & last_assess==start
 18.     di "Number of time-varying changes originally" 
 19.     * Using last_assess==start to count patients rather than rows
.     count if `var'A!=. & last_assess==start 
 20.     di "Number of dates for time-varying update"
 21.     count if `var'_update!=. & last_assess==start & `var'A!=.
 22. }
(417 missing values generated)
(417 missing values generated)
(2,997 real changes made, 2,997 to missing)
Number where time-varying update same as assessment date
  0
Number where time-varying update is 1st March 2020
  0
(3,414 missing values generated)
(1876 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  487
Number of time-varying changes originally
  901
Number of dates for time-varying update
  414
(1,047 missing values generated)
(1,047 missing values generated)
(2,207 real changes made, 2,207 to missing)
Number where time-varying update same as assessment date
  1
Number where time-varying update is 1st March 2020
  0
(3,254 missing values generated)
(2230 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  365
Number of time-varying changes originally
  745
Number of dates for time-varying update
  380
(4,192 missing values generated)
(4,192 missing values generated)
(49 real changes made, 49 to missing)
Number where time-varying update same as assessment date
  0
Number where time-varying update is 1st March 2020
  0
(4,241 missing values generated)
(4228 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  10
Number of time-varying changes originally
  16
Number of dates for time-varying update
  6

. * For severe disease only update variable if no severe disease at baseline 
. count if severe_disease_fu_date_update==date("01/03/2020", "DMY") & severe_di
> sease_bl!=1 
  0

. tab severe_disease_bl

severe_dise |
     ase_bl |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,076       48.80       48.80
          1 |      2,178       51.20      100.00
------------+-----------------------------------
      Total |      4,254      100.00

. replace severe_disease_fu_date_update = . if severe_disease_bl==1
(1,022 real changes made, 1,022 to missing)

. 
. * Keep only change dates to create time-varying dataset
. keep patient_id covid_vacc_first_date_update severe_disease_fu_date_update li
> ver_transplant_fu_date_update severe_disease_bl end_date

. * Chercking number of patient_id's 
. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [3,9993]                     units:  1
         unique values:  1,000                    missing .:  0/4,254

                  mean:   4860.55
              std. dev:   2912.14

           percentiles:        10%       25%       50%       75%       90%
                               874      2244      4864      7295      8945

. duplicates drop 

Duplicates in terms of all variables

(3,254 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [3,9993]                     units:  1
         unique values:  1,000                    missing .:  0/1,000

                  mean:   4933.66
              std. dev:   2892.41

           percentiles:        10%       25%       50%       75%       90%
                             890.5    2414.5      4998    7352.5      8947

. count
  1,000

. * Create file for each covariate to merge onto udca exposure file 
. * First covid vaccination and liver transplant as all people will begin at ze
> ro 
. rename liver_transplant_fu_date_update liver_trans_date_update

. foreach var in covid_vacc_first liver_trans {
  2.     preserve
  3.     keep patient_id `var'_date_update end_date
  4.     * Drop updates after the end of follow-up 
.     count if `var'_date>=end_date 
  5.     replace `var'_date = . if `var'_date>=end_date 
  6.     * Flag if variable is updated
.     gen `var'=(`var'_date_update!=.)
  7.     * Create extra row if variable is updated 
.     gen expand = `var'+1
  8.     tab expand
  9.     expand expand, gen(newv)
 10.     * Update variables so row for when zero and row for when updated - if 
> not updated whole time will be zero 
.     gen start = date("01/03/2020", "DMY") if newv==0
 11.     replace start = `var'_date_update if newv==1
 12.     gen stop = `var'_date_update if newv==0
 13.     replace stop = end_date if stop==.
 14.     replace `var'=0 if newv==0
 15.     save ./output/tv_`var'_check, replace
 16.     keep patient_id `var' start stop
 17.     * Check data 
.     count if start==stop 
 18.     * drop where start is same as stop - should not drop any in real data 
.     drop if start==stop 
 19.     count if stop<start
 20.     codebook patient_id
 21.     save ./output/tv_90_`var', replace
 22.     restore
 23. }
  586
(0 real changes made)

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        586       58.60       58.60
          2 |        414       41.40      100.00
------------+-----------------------------------
      Total |      1,000      100.00
(414 observations created)
(414 missing values generated)
(414 real changes made)
(1,000 missing values generated)
(1,000 real changes made)
(414 real changes made)
file ./output/tv_covid_vacc_first_check.dta saved
  0
(0 observations deleted)
  0

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [3,9993]                     units:  1
         unique values:  1,000                    missing .:  0/1,414

                  mean:   4895.36
              std. dev:   2910.17

           percentiles:        10%       25%       50%       75%       90%
                               886      2296      4890      7344      8946
(note: file ./output/tv_90_covid_vacc_first.dta not found)
file ./output/tv_90_covid_vacc_first.dta saved
  994
(0 real changes made)

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        994       99.40       99.40
          2 |          6        0.60      100.00
------------+-----------------------------------
      Total |      1,000      100.00
(6 observations created)
(6 missing values generated)
(6 real changes made)
(1,000 missing values generated)
(1,000 real changes made)
(6 real changes made)
file ./output/tv_liver_trans_check.dta saved
  0
(0 observations deleted)
  0

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [3,9993]                     units:  1
         unique values:  1,000                    missing .:  0/1,006

                  mean:   4943.38
              std. dev:   2896.11

           percentiles:        10%       25%       50%       75%       90%
                               895      2416    5007.5      7374      8983
(note: file ./output/tv_90_liver_trans.dta not found)
file ./output/tv_90_liver_trans.dta saved

. 
. * Same for liver disease severity, but variable can start at 1 and remain for
>  whole of follow-up 
. preserve

. keep patient_id severe_disease_fu_date_update end_date severe_disease_bl

. * Drop updates after the end of follow-up 
. replace severe_disease_fu_date_update=. if severe_disease_fu_date_update>=end
> _date 
(0 real changes made)

. * Flag if variable is updated
. gen severe_disease=(severe_disease_fu_date_update!=.)

. tab severe_disease 

severe_dise |
        ase |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        808       80.80       80.80
          1 |        192       19.20      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. replace severe_disease = 0 if severe_disease_bl==1
(0 real changes made)

. * Create extra row if variable is updated 
. gen expand = severe_disease + 1

. tab expand

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        808       80.80       80.80
          2 |        192       19.20      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. expand expand, gen(newv)
(192 observations created)

. tab newv

       newv |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,000       83.89       83.89
          1 |        192       16.11      100.00
------------+-----------------------------------
      Total |      1,192      100.00

. * Update variables so row for when zero and row for when updated - if not upd
> ated whole time will be zero 
. gen start = date("01/03/2020", "DMY") if newv==0
(192 missing values generated)

. replace start = severe_disease_fu_date_update if newv==1
(192 real changes made)

. gen stop = severe_disease_fu_date_update if newv==0 & severe_disease==1
(1,000 missing values generated)

. count if stop!=.
  192

. replace stop = end_date if stop==. 
(1,000 real changes made)

. count if stop==.
  0

. replace severe_disease=0 if newv==0 & severe_disease_bl==0
(192 real changes made)

. replace severe_disease=1 if newv==0 & severe_disease_bl==1
(500 real changes made)

. save ./output/tv_severe_disease_check, replace
file ./output/tv_severe_disease_check.dta saved

. keep patient_id severe_disease start stop

. * Check data 
. count if start==stop
  0

. * drop if start is same as stop - should not drop any in real data 
. drop if start==stop 
(0 observations deleted)

. count if stop<start
  0

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [3,9993]                     units:  1
         unique values:  1,000                    missing .:  0/1,192

                  mean:   4904.94
              std. dev:   2901.14

           percentiles:        10%       25%       50%       75%       90%
                               886      2339      4929      7352      8936

. save ./output/tv_90_severe_disease, replace
(note: file ./output/tv_90_severe_disease.dta not found)
file ./output/tv_90_severe_disease.dta saved

. restore

. 
. * Merge files together for each outcome
. * Composite  
. use ./output/tv_90_severe_disease, clear 

. tvc_merge start stop using ./output/tv_90_covid_vacc_first, id(patient_id)

. tvc_merge start stop using ./output/tv_90_liver_trans, id(patient_id)

. tvc_merge start stop using ./output/time_varying_udca_90, id(patient_id)

. tvc_merge start stop using ./output/tv_age, id(patient_id)

. tvc_merge start stop using ./output/tv_outcome_composite_any, id(patient_id) 
> failure(composite_any_flag)

. * Dummy drug data includes people not in cohort, so drop these - should not b
> e any in real data 
. drop if age_tv==.
(1,798 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [3,9993]                     units:  1
         unique values:  1,000                    missing .:  0/3,068

                  mean:   4882.47
              std. dev:   2913.94

           percentiles:        10%       25%       50%       75%       90%
                               876      2273      4869      7344      8945

. * Check number of outcomes after merge  - there will be missings for rows aft
> er event
. tab composite_any_flag, m

composite_a |
    ny_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,719       88.62       88.62
          1 |        214        6.98       95.60
          . |        135        4.40      100.00
------------+-----------------------------------
      Total |      3,068      100.00

. missings report

Checking missings in all variables:
135 observations with missing values

  +--------------------------------+
  |                      # missing |
  |--------------------------------|
  | composite_any_flag         135 |
  +--------------------------------+

. drop if composite_any_flag==.
(135 observations deleted)

. save ./output/tv_vars_90_composite_any, replace 
(note: file ./output/tv_vars_90_composite_any.dta not found)
file ./output/tv_vars_90_composite_any.dta saved

. 
. * COVID death - covid code in any position
. use ./output/tv_90_severe_disease, clear 

. tvc_merge start stop using ./output/tv_90_covid_vacc_first, id(patient_id)

. tvc_merge start stop using ./output/tv_90_liver_trans, id(patient_id)

. tvc_merge start stop using ./output/time_varying_udca_90, id(patient_id)

. tvc_merge start stop using ./output/tv_age, id(patient_id)

. tvc_merge start stop using ./output/tv_outcome_died_covid_any, id(patient_id)
>  failure(died_covid_any_flag)

. * Dummy drug data includes people not in cohort, so drop these - should not b
> e any in real data 
. drop if age_tv==.
(1,798 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [3,9993]                     units:  1
         unique values:  1,000                    missing .:  0/3,012

                  mean:   4881.44
              std. dev:    2914.8

           percentiles:        10%       25%       50%       75%       90%
                               886    2269.5      4872      7344      8945

. * Check number of outcomes after merge 
. tab died_covid_any_flag, m

died_covid_ |
   any_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,847       94.52       94.52
          1 |        165        5.48      100.00
------------+-----------------------------------
      Total |      3,012      100.00

. missings report

Checking missings in all variables:
0 observations with missing values

. save ./output/tv_vars_90_died_covid_any, replace 
(note: file ./output/tv_vars_90_died_covid_any.dta not found)
file ./output/tv_vars_90_died_covid_any.dta saved

. 
. * COVID hospitalisation - covid code in any position
. use ./output/tv_90_severe_disease, clear 

. tvc_merge start stop using ./output/tv_90_covid_vacc_first, id(patient_id)

. tvc_merge start stop using ./output/tv_90_liver_trans, id(patient_id)

. tvc_merge start stop using ./output/time_varying_udca_90, id(patient_id)

. tvc_merge start stop using ./output/tv_age, id(patient_id)

. tvc_merge start stop using ./output/tv_outcome_hosp_any, id(patient_id) failu
> re(hosp_any_flag)

. * Check number of outcomes after merge 
. tab hosp_any_flag, m

hosp_any_fl |
         ag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,876       59.10       59.10
          1 |         57        1.17       60.28
          . |      1,933       39.72      100.00
------------+-----------------------------------
      Total |      4,866      100.00

. bys patient_id: egen total_hosp = total(hosp_any_flag)

. tab total_hosp

 total_hosp |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,601       94.55       94.55
          1 |        265        5.45      100.00
------------+-----------------------------------
      Total |      4,866      100.00

. * Dummy drug data includes people not in cohort, so drop these - should not b
> e any in real data 
. drop if age_tv==.
(1,798 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [3,9993]                     units:  1
         unique values:  1,000                    missing .:  0/3,068

                  mean:   4882.47
              std. dev:   2913.94

           percentiles:        10%       25%       50%       75%       90%
                               876      2273      4869      7344      8945

. * Check number of outcomes after merge - there will be missings for rows afte
> r event
. tab hosp_any_flag, m 

hosp_any_fl |
         ag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,876       93.74       93.74
          1 |         57        1.86       95.60
          . |        135        4.40      100.00
------------+-----------------------------------
      Total |      3,068      100.00

. missings report

Checking missings in all variables:
135 observations with missing values

  +---------------------------+
  |                 # missing |
  |---------------------------|
  | hosp_any_flag         135 |
  +---------------------------+

. drop if hosp_any_flag==.
(135 observations deleted)

. save ./output/tv_vars_90_hosp_any, replace 
(note: file ./output/tv_vars_90_hosp_any.dta not found)
file ./output/tv_vars_90_hosp_any.dta saved

. 
. use `basefile', clear

. foreach var in died_covid_any hosp_any composite_any {
  2.     preserve 
  3.     merge 1:m patient_id using ./output/tv_vars_90_`var' 
  4.     drop _merge 
  5.     save ./output/an_dataset_90_`var', replace
  6.     restore
  7. }

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             3,012  (_merge==3)
    -----------------------------------------
(note: file ./output/an_dataset_90_died_covid_any.dta not found)
file ./output/an_dataset_90_died_covid_any.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,933  (_merge==3)
    -----------------------------------------
(note: file ./output/an_dataset_90_hosp_any.dta not found)
file ./output/an_dataset_90_hosp_any.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,933  (_merge==3)
    -----------------------------------------
(note: file ./output/an_dataset_90_composite_any.dta not found)
file ./output/an_dataset_90_composite_any.dta saved

. 
. *** 120 day overlap file: sensitivity analysis 
. use ./output/time_varying_udca_overlap_120, clear 

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [0,9995]                     units:  1
         unique values:  1,899                    missing .:  0/2,898

                  mean:   4984.34
              std. dev:   2884.82

           percentiles:        10%       25%       50%       75%       90%
                               995      2509      4970      7501      8945

. merge m:1 patient_id using `tempfile', keepusing(severe_disease_fu_date sever
> e_disease_bl covid_vacc_first_date liver_transplant_fu_date dereg_date died_d
> ate_ons)

    Result                           # of obs.
    -----------------------------------------
    not matched                         1,798
        from master                     1,798  (_merge==1)
        from using                          0  (_merge==2)

    matched                             1,100  (_merge==3)
    -----------------------------------------

. * Should only be required for dummy data 
. keep if _merge==3
(1,798 observations deleted)

. * Only using start date as this is when udca exposure or 6 monthly check occu
> rs
. drop stop

. * Add in rows with each of the 6 monthly assessment dates 
. gen expand=1

. bys patient_id (start): replace expand=6 if _n==_N 
(1000 real changes made)

. expand expand, generate(newv)
(5,000 observations created)

. bys patient_id newv: gen number = _n 

. replace start = date("01/09/2020", "DMY") if newv==1 & number==1
(1,000 real changes made)

. replace start = date("01/03/2021", "DMY") if newv==1 & number==2
(1,000 real changes made)

. replace start = date("01/09/2021", "DMY") if newv==1 & number==3
(1,000 real changes made)

. replace start = date("01/03/2022", "DMY") if newv==1 & number==4
(1,000 real changes made)

. replace start = date("01/09/2022", "DMY") if newv==1 & number==5
(1,000 real changes made)

. 
. * This gives a file where start dates are either exposure switching or 6-mont
> ly assessment dates 
. * These will be used to determine the closest date to time-varying covariate 
> dates identified in study definition 
. sort patient_id start 

. drop newv

. 
. * Determine end of follow-up date
. gen dereg_dateA = date(dereg_date, "YMD")
(3,050 missing values generated)

. format %dD/N/CY dereg_dateA

. drop dereg_date

. gen died_dateA = date(died_date_ons, "YMD")
(3,048 missing values generated)

. format %dD/N/CY died_dateA

. drop died_date_ons

. gen end_study = date("31/12/2022", "DMY")

. egen end_date = rowmin(dereg_dateA end_study died_dateA)

. 
. * Take out assessments after end_date 
. drop if start>end_date
(1,846 observations deleted)

. 
. * Determine number of days between each covariate and dates of UDCA change or
>  6 monthly check date 
. bys patient_id (start): egen last_assess = max(start)

. * Format dates  and identify date nearest after covariate updates 
. foreach var in covid_vacc_first_date severe_disease_fu_date liver_transplant_
> fu_date {
  2.     gen `var'A = date(`var', "YMD")
  3.     format `var'A %dD/N/CY 
  4.     drop `var'
  5.     * time between date of record and change in covariate - positive value
> s are those where record starts after 
.     * covariate change date 
.     gen time_`var' = start - `var'A
  6.     * Set time variable for records prior to change as missing
.     replace time_`var'=. if time_`var'<0
  7.     * Check if any are on index date (1st March) potentially severe diseas
> e - not others
.     di "Number where time-varying update same as assessment date"
  8.     count if time_`var'==0
  9.     di "Number where time-varying update is 1st March 2020"
 10.     count if `var'A==date("01/03/2020", "DMY")
 11.     * Find earliest start date after covariate update
.     * Note: there are some changes that occur after the last available 6 mont
> h assessment or exposure change
.     bys patient_id (time_`var'): gen `var'_updateN = start[1] if `var'A!=. & 
> time_`var'!=.
 12.     * Spread to all rows for patient 
.     bys patient_id: egen `var'_update = max(`var'_updateN)
 13.     format `var'_update %dD/N/CY 
 14.     di "Number where new variable is prior to original variable (should be
>  0)"
 15.     count if `var'_update < `var'A
 16.     di "Number where time varying update is after last assessment date"
 17.     count if `var'A > last_assess & `var'A!=.  & last_assess==start
 18.     di "Number of time-varying changes originally" 
 19.     * Using last_assess==start to count patients rather than rows
.     count if `var'A!=. & last_assess==start 
 20.     di "Number of dates for time-varying update"
 21.     count if `var'_update!=. & last_assess==start & `var'A!=.
 22. }
(417 missing values generated)
(417 missing values generated)
(2,997 real changes made, 2,997 to missing)
Number where time-varying update same as assessment date
  0
Number where time-varying update is 1st March 2020
  0
(3,414 missing values generated)
(1876 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  487
Number of time-varying changes originally
  901
Number of dates for time-varying update
  414
(1,047 missing values generated)
(1,047 missing values generated)
(2,207 real changes made, 2,207 to missing)
Number where time-varying update same as assessment date
  1
Number where time-varying update is 1st March 2020
  0
(3,254 missing values generated)
(2230 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  365
Number of time-varying changes originally
  745
Number of dates for time-varying update
  380
(4,192 missing values generated)
(4,192 missing values generated)
(49 real changes made, 49 to missing)
Number where time-varying update same as assessment date
  0
Number where time-varying update is 1st March 2020
  0
(4,241 missing values generated)
(4228 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  10
Number of time-varying changes originally
  16
Number of dates for time-varying update
  6

. * For severe disease only update variable if no severe disease at baseline 
. count if severe_disease_fu_date_update==date("01/03/2020", "DMY") & severe_di
> sease_bl!=1 
  0

. tab severe_disease_bl

severe_dise |
     ase_bl |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,076       48.80       48.80
          1 |      2,178       51.20      100.00
------------+-----------------------------------
      Total |      4,254      100.00

. replace severe_disease_fu_date_update = . if severe_disease_bl==1
(1,022 real changes made, 1,022 to missing)

. 
. * Keep only change dates to create time-varying dataset
. keep patient_id covid_vacc_first_date_update severe_disease_fu_date_update li
> ver_transplant_fu_date_update severe_disease_bl end_date

. * Chercking number of patient_id's 
. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [3,9993]                     units:  1
         unique values:  1,000                    missing .:  0/4,254

                  mean:   4860.55
              std. dev:   2912.14

           percentiles:        10%       25%       50%       75%       90%
                               874      2244      4864      7295      8945

. duplicates drop 

Duplicates in terms of all variables

(3,254 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [3,9993]                     units:  1
         unique values:  1,000                    missing .:  0/1,000

                  mean:   4933.66
              std. dev:   2892.41

           percentiles:        10%       25%       50%       75%       90%
                             890.5    2414.5      4998    7352.5      8947

. count
  1,000

. * Create file for each covariate to merge onto udca exposure file 
. * First covid vaccination and liver transplant as all people will begin at ze
> ro 
. rename liver_transplant_fu_date_update liver_trans_date_update

. foreach var in covid_vacc_first liver_trans {
  2.     preserve
  3.     keep patient_id `var'_date_update end_date
  4.     * Drop updates after the end of follow-up 
.     count if `var'_date>=end_date 
  5.     replace `var'_date = . if `var'_date>=end_date 
  6.     * Flag if variable is updated
.     gen `var'=(`var'_date_update!=.)
  7.     * Create extra row if variable is updated 
.     gen expand = `var'+1
  8.     tab expand
  9.     expand expand, gen(newv)
 10.     * Update variables so row for when zero and row for when updated - if 
> not updated whole time will be zero 
.     gen start = date("01/03/2020", "DMY") if newv==0
 11.     replace start = `var'_date_update if newv==1
 12.     gen stop = `var'_date_update if newv==0
 13.     replace stop = end_date if stop==.
 14.     replace `var'=0 if newv==0
 15.     save ./output/tv_`var'_check, replace
 16.     keep patient_id `var' start stop
 17.     * Check data 
.     count if start==stop 
 18.     * drop where start is same as stop - should not drop any in real data 
.     drop if start==stop 
 19.     count if stop<start
 20.     codebook patient_id
 21.     save ./output/tv_overlap_120_`var', replace
 22.     restore
 23. }
  586
(0 real changes made)

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        586       58.60       58.60
          2 |        414       41.40      100.00
------------+-----------------------------------
      Total |      1,000      100.00
(414 observations created)
(414 missing values generated)
(414 real changes made)
(1,000 missing values generated)
(1,000 real changes made)
(414 real changes made)
file ./output/tv_covid_vacc_first_check.dta saved
  0
(0 observations deleted)
  0

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [3,9993]                     units:  1
         unique values:  1,000                    missing .:  0/1,414

                  mean:   4895.36
              std. dev:   2910.17

           percentiles:        10%       25%       50%       75%       90%
                               886      2296      4890      7344      8946
(note: file ./output/tv_overlap_120_covid_vacc_first.dta not found)
file ./output/tv_overlap_120_covid_vacc_first.dta saved
  994
(0 real changes made)

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        994       99.40       99.40
          2 |          6        0.60      100.00
------------+-----------------------------------
      Total |      1,000      100.00
(6 observations created)
(6 missing values generated)
(6 real changes made)
(1,000 missing values generated)
(1,000 real changes made)
(6 real changes made)
file ./output/tv_liver_trans_check.dta saved
  0
(0 observations deleted)
  0

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [3,9993]                     units:  1
         unique values:  1,000                    missing .:  0/1,006

                  mean:   4943.38
              std. dev:   2896.11

           percentiles:        10%       25%       50%       75%       90%
                               895      2416    5007.5      7374      8983
(note: file ./output/tv_overlap_120_liver_trans.dta not found)
file ./output/tv_overlap_120_liver_trans.dta saved

. 
. * Same for liver disease severity, but variable can start at 1 and remain for
>  whole of follow-up 
. preserve

. keep patient_id severe_disease_fu_date_update end_date severe_disease_bl

. * Drop updates after the end of follow-up 
. replace severe_disease_fu_date_update=. if severe_disease_fu_date_update>=end
> _date 
(0 real changes made)

. * Flag if variable is updated
. gen severe_disease=(severe_disease_fu_date_update!=.)

. tab severe_disease 

severe_dise |
        ase |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        808       80.80       80.80
          1 |        192       19.20      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. replace severe_disease = 0 if severe_disease_bl==1
(0 real changes made)

. * Create extra row if variable is updated 
. gen expand = severe_disease + 1

. tab expand

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        808       80.80       80.80
          2 |        192       19.20      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. expand expand, gen(newv)
(192 observations created)

. tab newv

       newv |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,000       83.89       83.89
          1 |        192       16.11      100.00
------------+-----------------------------------
      Total |      1,192      100.00

. * Update variables so row for when zero and row for when updated - if not upd
> ated whole time will be zero 
. gen start = date("01/03/2020", "DMY") if newv==0
(192 missing values generated)

. replace start = severe_disease_fu_date_update if newv==1
(192 real changes made)

. gen stop = severe_disease_fu_date_update if newv==0 & severe_disease==1
(1,000 missing values generated)

. count if stop!=.
  192

. replace stop = end_date if stop==. 
(1,000 real changes made)

. count if stop==.
  0

. replace severe_disease=0 if newv==0 & severe_disease_bl==0
(192 real changes made)

. replace severe_disease=1 if newv==0 & severe_disease_bl==1
(500 real changes made)

. save ./output/tv_severe_disease_check, replace
file ./output/tv_severe_disease_check.dta saved

. keep patient_id severe_disease start stop

. * Check data 
. count if start==stop
  0

. * drop if start is same as stop - should not drop any in real data 
. drop if start==stop 
(0 observations deleted)

. count if stop<start
  0

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [3,9993]                     units:  1
         unique values:  1,000                    missing .:  0/1,192

                  mean:   4904.94
              std. dev:   2901.14

           percentiles:        10%       25%       50%       75%       90%
                               886      2339      4929      7352      8936

. save ./output/tv_overlap_120_severe_disease, replace
(note: file ./output/tv_overlap_120_severe_disease.dta not found)
file ./output/tv_overlap_120_severe_disease.dta saved

. restore

. 
. * Merge files together for each outcome
. * Composite  
. use ./output/tv_overlap_120_severe_disease, clear 

. tvc_merge start stop using ./output/tv_overlap_120_covid_vacc_first, id(patie
> nt_id)

. tvc_merge start stop using ./output/tv_overlap_120_liver_trans, id(patient_id
> )

. tvc_merge start stop using ./output/time_varying_udca_overlap_120, id(patient
> _id)

. tvc_merge start stop using ./output/tv_age, id(patient_id)

. tvc_merge start stop using ./output/tv_outcome_composite_any, id(patient_id) 
> failure(composite_any_flag)

. * Dummy drug data includes people not in cohort, so drop these - should not b
> e any in real data 
. drop if age_tv==.
(1,798 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [3,9993]                     units:  1
         unique values:  1,000                    missing .:  0/3,068

                  mean:   4882.47
              std. dev:   2913.94

           percentiles:        10%       25%       50%       75%       90%
                               876      2273      4869      7344      8945

. * Check number of outcomes after merge  - there will be missings for rows aft
> er event
. tab composite_any_flag, m

composite_a |
    ny_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,719       88.62       88.62
          1 |        214        6.98       95.60
          . |        135        4.40      100.00
------------+-----------------------------------
      Total |      3,068      100.00

. missings report

Checking missings in all variables:
135 observations with missing values

  +--------------------------------+
  |                      # missing |
  |--------------------------------|
  | composite_any_flag         135 |
  +--------------------------------+

. drop if composite_any_flag==.
(135 observations deleted)

. save ./output/tv_vars_overlap_120_composite_any, replace 
(note: file ./output/tv_vars_overlap_120_composite_any.dta not found)
file ./output/tv_vars_overlap_120_composite_any.dta saved

. 
. * COVID death - covid code in any position
. use ./output/tv_overlap_120_severe_disease, clear 

. tvc_merge start stop using ./output/tv_overlap_120_covid_vacc_first, id(patie
> nt_id)

. tvc_merge start stop using ./output/tv_overlap_120_liver_trans, id(patient_id
> )

. tvc_merge start stop using ./output/time_varying_udca_overlap_120, id(patient
> _id)

. tvc_merge start stop using ./output/tv_age, id(patient_id)

. tvc_merge start stop using ./output/tv_outcome_died_covid_any, id(patient_id)
>  failure(died_covid_any_flag)

. * Dummy drug data includes people not in cohort, so drop these - should not b
> e any in real data 
. drop if age_tv==.
(1,798 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [3,9993]                     units:  1
         unique values:  1,000                    missing .:  0/3,012

                  mean:   4881.44
              std. dev:    2914.8

           percentiles:        10%       25%       50%       75%       90%
                               886    2269.5      4872      7344      8945

. * Check number of outcomes after merge 
. tab died_covid_any_flag, m

died_covid_ |
   any_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,847       94.52       94.52
          1 |        165        5.48      100.00
------------+-----------------------------------
      Total |      3,012      100.00

. missings report

Checking missings in all variables:
0 observations with missing values

. save ./output/tv_vars_overlap_120_died_covid_any, replace 
(note: file ./output/tv_vars_overlap_120_died_covid_any.dta not found)
file ./output/tv_vars_overlap_120_died_covid_any.dta saved

. 
. * COVID hospitalisation - covid code in any position
. use ./output/tv_overlap_120_severe_disease, clear 

. tvc_merge start stop using ./output/tv_overlap_120_covid_vacc_first, id(patie
> nt_id)

. tvc_merge start stop using ./output/tv_overlap_120_liver_trans, id(patient_id
> )

. tvc_merge start stop using ./output/time_varying_udca_overlap_120, id(patient
> _id)

. tvc_merge start stop using ./output/tv_age, id(patient_id)

. tvc_merge start stop using ./output/tv_outcome_hosp_any, id(patient_id) failu
> re(hosp_any_flag)

. * Check number of outcomes after merge 
. tab hosp_any_flag, m

hosp_any_fl |
         ag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,876       59.10       59.10
          1 |         57        1.17       60.28
          . |      1,933       39.72      100.00
------------+-----------------------------------
      Total |      4,866      100.00

. bys patient_id: egen total_hosp = total(hosp_any_flag)

. tab total_hosp

 total_hosp |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,601       94.55       94.55
          1 |        265        5.45      100.00
------------+-----------------------------------
      Total |      4,866      100.00

. * Dummy drug data includes people not in cohort, so drop these - should not b
> e any in real data 
. drop if age_tv==.
(1,798 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [3,9993]                     units:  1
         unique values:  1,000                    missing .:  0/3,068

                  mean:   4882.47
              std. dev:   2913.94

           percentiles:        10%       25%       50%       75%       90%
                               876      2273      4869      7344      8945

. * Check number of outcomes after merge - there will be missings for rows afte
> r event
. tab hosp_any_flag, m 

hosp_any_fl |
         ag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,876       93.74       93.74
          1 |         57        1.86       95.60
          . |        135        4.40      100.00
------------+-----------------------------------
      Total |      3,068      100.00

. missings report

Checking missings in all variables:
135 observations with missing values

  +---------------------------+
  |                 # missing |
  |---------------------------|
  | hosp_any_flag         135 |
  +---------------------------+

. drop if hosp_any_flag==.
(135 observations deleted)

. save ./output/tv_vars_overlap_120_hosp_any, replace 
(note: file ./output/tv_vars_overlap_120_hosp_any.dta not found)
file ./output/tv_vars_overlap_120_hosp_any.dta saved

. 
. use `basefile', clear

. foreach var in died_covid_any hosp_any composite_any {
  2.     preserve 
  3.     merge 1:m patient_id using ./output/tv_vars_overlap_120_`var' 
  4.     drop _merge 
  5.     save ./output/an_dataset_overlap_120_`var', replace
  6.     restore
  7. }

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             3,012  (_merge==3)
    -----------------------------------------
(note: file ./output/an_dataset_overlap_120_died_covid_any.dta not found)
file ./output/an_dataset_overlap_120_died_covid_any.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,933  (_merge==3)
    -----------------------------------------
(note: file ./output/an_dataset_overlap_120_hosp_any.dta not found)
file ./output/an_dataset_overlap_120_hosp_any.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,933  (_merge==3)
    -----------------------------------------
(note: file ./output/an_dataset_overlap_120_composite_any.dta not found)
file ./output/an_dataset_overlap_120_composite_any.dta saved

. 
. *** vaccination file: sensitivity analysis 
. ** Creating file where count of vaccinations updates over time
. use ./output/time_varying_udca_120, clear 

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [0,9995]                     units:  1
         unique values:  1,899                    missing .:  0/2,898

                  mean:   4984.34
              std. dev:   2884.82

           percentiles:        10%       25%       50%       75%       90%
                               995      2509      4970      7501      8945

. merge m:1 patient_id using `tempfile', keepusing(covid_vacc* dereg_date died_
> date_ons date_most_recent_cov_vac)

    Result                           # of obs.
    -----------------------------------------
    not matched                         1,798
        from master                     1,798  (_merge==1)
        from using                          0  (_merge==2)

    matched                             1,100  (_merge==3)
    -----------------------------------------

. * Should only be required for dummy data 
. keep if _merge==3
(1,798 observations deleted)

. * Only using start date as this is when udca exposure or 6 monthly check occu
> rs
. drop stop

. * Add in rows with each of the 6 monthly assessment dates 
. gen expand=1

. bys patient_id (start): replace expand=6 if _n==_N 
(1000 real changes made)

. expand expand, generate(newv)
(5,000 observations created)

. bys patient_id newv: gen number = _n 

. replace start = date("01/09/2020", "DMY") if newv==1 & number==1
(1,000 real changes made)

. replace start = date("01/03/2021", "DMY") if newv==1 & number==2
(1,000 real changes made)

. replace start = date("01/09/2021", "DMY") if newv==1 & number==3
(1,000 real changes made)

. replace start = date("01/03/2022", "DMY") if newv==1 & number==4
(1,000 real changes made)

. replace start = date("01/09/2022", "DMY") if newv==1 & number==5
(1,000 real changes made)

. 
. * This gives a file where start dates are either exposure switching or 6-mont
> ly assessment dates 
. * These will be used to determine the closest date to time-varying covariate 
> dates identified in study definition 
. sort patient_id start 

. drop newv

. 
. * Determine end of follow-up date
. gen dereg_dateA = date(dereg_date, "YMD")
(3,050 missing values generated)

. format %dD/N/CY dereg_dateA

. drop dereg_date

. gen died_dateA = date(died_date_ons, "YMD")
(3,048 missing values generated)

. format %dD/N/CY died_dateA

. drop died_date_ons

. gen end_study = date("31/12/2022", "DMY")

. egen end_date = rowmin(dereg_dateA end_study died_dateA)

. 
. * Take out assessments after end_date 
. drop if start>end_date
(1,846 observations deleted)

. 
. * Determine number of days between each covariate and dates of UDCA change or
>  6 monthly check date 
. bys patient_id (start): egen last_assess = max(start)

. * Format dates  and identify date nearest after covariate updates 
. foreach var in covid_vacc_first_date covid_vacc_second_date covid_vacc_third_
> date covid_vacc_fourth_date covid_vacc_fifth_date {
  2.     gen `var'A = date(`var', "YMD")
  3.     format `var'A %dD/N/CY 
  4.     drop `var'
  5.     * time between date of record and change in covariate - positive value
> s are those where record starts after 
.     * covariate change date 
.     gen time_`var' = start - `var'A
  6.     * Set time variable for records prior to change as missing
.     replace time_`var'=. if time_`var'<0
  7.     * Check if any are on index date (1st March) potentially severe diseas
> e - not others
.     di "Number where time-varying update same as assessment date"
  8.     count if time_`var'==0
  9.     di "Number where time-varying update is 1st March 2020"
 10.     count if `var'A==date("01/03/2020", "DMY")
 11.     * Find earliest start date after covariate update
.     * Note: there are some changes that occur after the last available 6 mont
> h assessment or exposure change
.     bys patient_id (time_`var'): gen `var'_updateN = start[1] if `var'A!=. & 
> time_`var'!=.
 12.     * Spread to all rows for patient 
.     bys patient_id: egen `var'_update = max(`var'_updateN)
 13.     format `var'_update %dD/N/CY 
 14.     di "Number where new variable is prior to original variable (should be
>  0)"
 15.     count if `var'_update < `var'A
 16.     di "Number where time varying update is after last assessment date"
 17.     count if `var'A > last_assess & `var'A!=.  & last_assess==start
 18.     di "Number of time-varying changes originally" 
 19.     * Using last_assess==start to count patients rather than rows
.     count if `var'A!=. & last_assess==start 
 20.     di "Number of dates for time-varying update"
 21.     count if `var'_update!=. & last_assess==start & `var'A!=.
 22. }
(417 missing values generated)
(417 missing values generated)
(2,997 real changes made, 2,997 to missing)
Number where time-varying update same as assessment date
  0
Number where time-varying update is 1st March 2020
  0
(3,414 missing values generated)
(1876 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  487
Number of time-varying changes originally
  901
Number of dates for time-varying update
  414
(865 missing values generated)
(865 missing values generated)
(2,684 real changes made, 2,684 to missing)
Number where time-varying update same as assessment date
  0
Number where time-varying update is 1st March 2020
  0
(3,549 missing values generated)
(2222 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  448
Number of time-varying changes originally
  801
Number of dates for time-varying update
  353
(3,801 missing values generated)
(3,801 missing values generated)
(404 real changes made, 404 to missing)
Number where time-varying update same as assessment date
  0
Number where time-varying update is 1st March 2020
  0
(4,205 missing values generated)
(4035 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  63
Number of time-varying changes originally
  100
Number of dates for time-varying update
  37
(2,096 missing values generated)
(2,096 missing values generated)
(41 real changes made, 41 to missing)
Number where time-varying update same as assessment date
  0
Number where time-varying update is 1st March 2020
  0
(2,137 missing values generated)
(2123 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  9
Number of time-varying changes originally
  500
Number of dates for time-varying update
  491
(2,106 missing values generated)
(2,106 missing values generated)
(33 real changes made, 33 to missing)
Number where time-varying update same as assessment date
  0
Number where time-varying update is 1st March 2020
  0
(2,139 missing values generated)
(2122 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  5
Number of time-varying changes originally
  500
Number of dates for time-varying update
  495

. 
. * Keep only change dates to create time-varying dataset
. keep patient_id covid_vacc_first_date_update covid_vacc_second_date_update co
> vid_vacc_third_date_update covid_vacc_fourth_date_update covid_vacc_fifth_dat
> e_update end_date date_most_recent_cov_vac

. * Chercking number of patient_id's 
. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [3,9993]                     units:  1
         unique values:  1,000                    missing .:  0/4,254

                  mean:   4860.55
              std. dev:   2912.14

           percentiles:        10%       25%       50%       75%       90%
                               874      2244      4864      7295      8945

. duplicates drop 

Duplicates in terms of all variables

(3,254 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [3,9993]                     units:  1
         unique values:  1,000                    missing .:  0/1,000

                  mean:   4933.66
              std. dev:   2892.41

           percentiles:        10%       25%       50%       75%       90%
                             890.5    2414.5      4998    7352.5      8947

. count
  1,000

. * Create dataset where rows are updated when person is vaccinated/re-vaccinat
> ed  
. foreach var in covid_vacc_first covid_vacc_second covid_vacc_third covid_vacc
> _fourth covid_vacc_fifth {
  2.     count if `var'_date_update>=end_date & `var'_date_update!=.
  3.     replace `var'_date_update = . if `var'_date_update>=end_date
  4.     * Create flag for each vaccination date 
.     gen `var'_flag = (`var'_date_update!=.)
  5.     * Create flag for if date is prior to 1st March 2021
.     gen `var'_prior = `var'_date_update <= date("01Mar2021", "DMY")
  6.     tab `var'_prior, m
  7. }
  0
(0 real changes made)

covid_vacc_ |
first_prior |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        932       93.20       93.20
          1 |         68        6.80      100.00
------------+-----------------------------------
      Total |      1,000      100.00
  0
(0 real changes made)

covid_vacc_ |
second_prio |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        944       94.40       94.40
          1 |         56        5.60      100.00
------------+-----------------------------------
      Total |      1,000      100.00
  0
(0 real changes made)

covid_vacc_ |
third_prior |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,000      100.00      100.00
------------+-----------------------------------
      Total |      1,000      100.00
  0
(0 real changes made)

covid_vacc_ |
fourth_prio |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        511       51.10       51.10
          1 |        489       48.90      100.00
------------+-----------------------------------
      Total |      1,000      100.00
  0
(0 real changes made)

covid_vacc_ |
fifth_prior |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        508       50.80       50.80
          1 |        492       49.20      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. * Check not date where prior vaccination is missing 
. count if covid_vacc_first_flag==0 & covid_vacc_second_flag==1
  109

. count if covid_vacc_second_flag==0 & covid_vacc_third_flag==1
  14

. count if covid_vacc_third_flag==0 & covid_vacc_fourth_flag==1
  470

. count if covid_vacc_fourth_flag==0 & covid_vacc_fifth_flag==1
  245

. 
. * Determine total number of vaccinations 
. egen total_vaccs = rowtotal(covid_vacc_first_flag covid_vacc_second_flag covi
> d_vacc_third_flag covid_vacc_fourth_flag covid_vacc_fifth_flag)

. tab total_vaccs

total_vaccs |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        130       13.00       13.00
          1 |        314       31.40       44.40
          2 |        279       27.90       72.30
          3 |        194       19.40       91.70
          4 |         79        7.90       99.60
          5 |          4        0.40      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. egen total_vaccs_prior = rowtotal(covid_vacc_first_prior covid_vacc_second_pr
> ior covid_vacc_third_prior covid_vacc_fourth_prior covid_vacc_fifth_prior)

. gen date_most_recent_cov_vacA = date(date_most_recent_cov_vac, "YMD")
(961 missing values generated)

. count if total_vaccs_prior!=0 & date_most_recent_cov_vacA==.
  729

. count if total_vaccs_prior==0 & date_most_recent_cov_vacA!=.
  11

. * Create time varying vaccination count variable 
. gen vacc_count_tv = 0

. * expand row up to total number of vaccinations 
. gen expand = total_vaccs + 1

. tab expand 

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        130       13.00       13.00
          2 |        314       31.40       44.40
          3 |        279       27.90       72.30
          4 |        194       19.40       91.70
          5 |         79        7.90       99.60
          6 |          4        0.40      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. expand expand, gen(newv)
(1,790 observations created)

. bys patient_id newv: gen number = _n 

. * Update variables so row for when zero and row for each vaccination - if not
>  updated whole time will be zero 
. gen start = date("01/03/2020", "DMY") if newv==0
(1,790 missing values generated)

. replace start = covid_vacc_first_date_update if newv==1 & number == 1
(414 real changes made)

. gen stop = covid_vacc_first_date_update if newv==0 & covid_vacc_first_date_up
> date!=.
(2,376 missing values generated)

. replace stop = end_date if stop==. & expand==1
(130 real changes made)

. replace stop = covid_vacc_second_date_update if newv==1 & number==1
(353 real changes made)

. replace vacc_count_tv = 1 if newv==1 & number==1
(870 real changes made)

. * Second vaccination 
. replace start = covid_vacc_second_date_update if newv==1 & number == 2
(318 real changes made)

. replace stop = covid_vacc_third_date_update if newv==1 & number==2 & covid_va
> cc_third_date_update!=.
(37 real changes made)

. replace stop = end_date if newv==1 & number==2 & covid_vacc_third_date_update
> ==.
(519 real changes made)

. replace vacc_count_tv = 2 if newv==1 & number==2
(556 real changes made)

. * Third vaccination 
. replace start = covid_vacc_third_date_update if newv==1 & number == 3
(31 real changes made)

. replace stop = covid_vacc_fourth_date_update if newv==1 & number==3 & covid_v
> acc_fourth_date_update!=.
(213 real changes made)

. replace stop = end_date if newv==1 & number==3 & covid_vacc_fourth_date_updat
> e==.
(64 real changes made)

. replace vacc_count_tv = 3 if newv==1 & number==3
(277 real changes made)

. * Fourth vaccination 
. replace start = covid_vacc_fourth_date_update if newv==1 & number == 4
(78 real changes made)

. replace stop = covid_vacc_fifth_date_update if newv==1 & number==4 & covid_va
> cc_fifth_date_update!=.
(79 real changes made)

. replace stop = end_date if newv==1 & number==4 & covid_vacc_fifth_date_update
> ==.
(4 real changes made)

. replace vacc_count_tv = 4 if newv==1 & number==4
(83 real changes made)

. * Fifth vaccination 
. replace start = covid_vacc_fifth_date_update if newv==1 & number == 5
(4 real changes made)

. replace stop = end_date if newv==1 & number==5
(4 real changes made)

. replace vacc_count_tv = 5 if newv==1 & number==5
(4 real changes made)

. save ./output/tv_120_total_vaccs_check, replace
(note: file ./output/tv_120_total_vaccs_check.dta not found)
file ./output/tv_120_total_vaccs_check.dta saved

. keep patient_id vacc_count_tv start stop

. * Check data 
. count if start==stop 
  508

. * drop where start is same as stop - should not drop any in real data 
. drop if start==stop 
(508 observations deleted)

. count if stop<start
  695

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [3,9993]                     units:  1
         unique values:  1,000                    missing .:  0/2,282

                  mean:   4865.15
              std. dev:   2910.15

           percentiles:        10%       25%       50%       75%       90%
                               876      2266      4852      7317      8936

. save ./output/tv_120_total_vaccs, replace
(note: file ./output/tv_120_total_vaccs.dta not found)
file ./output/tv_120_total_vaccs.dta saved

. 
. 
. * Merge files together for each outcome
. * Composite  
. use ./output/tv_severe_disease, clear 

. tvc_merge start stop using ./output/tv_covid_vacc_first, id(patient_id)

. tvc_merge start stop using ./output/tv_120_total_vaccs, id(patient_id)

. tvc_merge start stop using ./output/tv_liver_trans, id(patient_id)

. tvc_merge start stop using ./output/time_varying_udca_120, id(patient_id)

. tvc_merge start stop using ./output/tv_age, id(patient_id)

. tvc_merge start stop using ./output/tv_outcome_composite_any, id(patient_id) 
> failure(composite_any_flag)

. * Dummy drug data includes people not in cohort, so drop these - should not b
> e any in real data 
. drop if age_tv==.
(1,798 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [3,9993]                     units:  1
         unique values:  1,000                    missing .:  0/3,353

                  mean:   4852.51
              std. dev:   2904.49

           percentiles:        10%       25%       50%       75%       90%
                               876      2244      4852      7295      8928

. * Check number of outcomes after merge  - there will be missings for rows aft
> er event
. tab composite_any_flag, m

composite_a |
    ny_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,986       89.05       89.05
          1 |        214        6.38       95.44
          . |        153        4.56      100.00
------------+-----------------------------------
      Total |      3,353      100.00

. missings report

Checking missings in all variables:
153 observations with missing values

  +--------------------------------+
  |                      # missing |
  |--------------------------------|
  | composite_any_flag         153 |
  +--------------------------------+

. drop if composite_any_flag==.
(153 observations deleted)

. save ./output/tv_vars_120_vacc_composite_any, replace 
(note: file ./output/tv_vars_120_vacc_composite_any.dta not found)
file ./output/tv_vars_120_vacc_composite_any.dta saved

. 
. * COVID death - covid code in any position
. use ./output/tv_severe_disease, clear 

. tvc_merge start stop using ./output/tv_covid_vacc_first, id(patient_id)

. tvc_merge start stop using ./output/tv_120_total_vaccs, id(patient_id)

. tvc_merge start stop using ./output/tv_liver_trans, id(patient_id)

. tvc_merge start stop using ./output/time_varying_udca_120, id(patient_id)

. tvc_merge start stop using ./output/tv_age, id(patient_id)

. tvc_merge start stop using ./output/tv_outcome_died_covid_any, id(patient_id)
>  failure(died_covid_any_flag)

. * Dummy drug data includes people not in cohort, so drop these - should not b
> e any in real data 
. drop if age_tv==.
(1,798 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [3,9993]                     units:  1
         unique values:  1,000                    missing .:  0/3,297

                  mean:   4851.06
              std. dev:   2905.11

           percentiles:        10%       25%       50%       75%       90%
                               876      2222      4852      7295      8928

. * Check number of outcomes after merge 
. tab died_covid_any_flag, m

died_covid_ |
   any_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,132       95.00       95.00
          1 |        165        5.00      100.00
------------+-----------------------------------
      Total |      3,297      100.00

. missings report

Checking missings in all variables:
0 observations with missing values

. save ./output/tv_vars_120_vacc_died_covid_any, replace 
(note: file ./output/tv_vars_120_vacc_died_covid_any.dta not found)
file ./output/tv_vars_120_vacc_died_covid_any.dta saved

. 
. * COVID hospitalisation - covid code in any position
. use ./output/tv_severe_disease, clear 

. tvc_merge start stop using ./output/tv_covid_vacc_first, id(patient_id)

. tvc_merge start stop using ./output/tv_120_total_vaccs, id(patient_id)

. tvc_merge start stop using ./output/tv_liver_trans, id(patient_id)

. tvc_merge start stop using ./output/time_varying_udca_120, id(patient_id)

. tvc_merge start stop using ./output/tv_age, id(patient_id)

. tvc_merge start stop using ./output/tv_outcome_hosp_any, id(patient_id) failu
> re(hosp_any_flag)

. * Check number of outcomes after merge 
. tab hosp_any_flag, m

hosp_any_fl |
         ag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,143       61.02       61.02
          1 |         57        1.11       62.12
          . |      1,951       37.88      100.00
------------+-----------------------------------
      Total |      5,151      100.00

. bys patient_id: egen total_hosp = total(hosp_any_flag)

. tab total_hosp

 total_hosp |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,861       94.37       94.37
          1 |        290        5.63      100.00
------------+-----------------------------------
      Total |      5,151      100.00

. * Dummy drug data includes people not in cohort, so drop these - should not b
> e any in real data 
. drop if age_tv==.
(1,798 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [3,9993]                     units:  1
         unique values:  1,000                    missing .:  0/3,353

                  mean:   4852.51
              std. dev:   2904.49

           percentiles:        10%       25%       50%       75%       90%
                               876      2244      4852      7295      8928

. * Check number of outcomes after merge - there will be missings for rows afte
> r event
. tab hosp_any_flag, m 

hosp_any_fl |
         ag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,143       93.74       93.74
          1 |         57        1.70       95.44
          . |        153        4.56      100.00
------------+-----------------------------------
      Total |      3,353      100.00

. missings report

Checking missings in all variables:
153 observations with missing values

  +---------------------------+
  |                 # missing |
  |---------------------------|
  | hosp_any_flag         153 |
  +---------------------------+

. drop if hosp_any_flag==.
(153 observations deleted)

. save ./output/tv_vars_120_vacc_hosp_any, replace 
(note: file ./output/tv_vars_120_vacc_hosp_any.dta not found)
file ./output/tv_vars_120_vacc_hosp_any.dta saved

. 
. use `basefile', clear

. foreach var in died_covid_any hosp_any composite_any {
  2.     preserve 
  3.     merge 1:m patient_id using ./output/tv_vars_120_vacc_`var' 
  4.     drop _merge 
  5.     save ./output/an_dataset_120_vacc_`var', replace
  6.     restore
  7. }

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             3,297  (_merge==3)
    -----------------------------------------
(note: file ./output/an_dataset_120_vacc_died_covid_any.dta not found)
file ./output/an_dataset_120_vacc_died_covid_any.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             3,200  (_merge==3)
    -----------------------------------------
(note: file ./output/an_dataset_120_vacc_hosp_any.dta not found)
file ./output/an_dataset_120_vacc_hosp_any.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             3,200  (_merge==3)
    -----------------------------------------
(note: file ./output/an_dataset_120_vacc_composite_any.dta not found)
file ./output/an_dataset_120_vacc_composite_any.dta saved

. 
. * Sensitivity analysis - March 2021 cohort - vaccinations
. 
. import delimited using ./output/input_vacc.csv, clear 
(109 vars, 1,000 obs)

. describe

Contains data
  obs:         1,000                          
 vars:           109                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
dereg_date      str10   %10s                  
has_pbc_date    int     %8.0g                 
has_psc_date    int     %8.0g                 
fu_liver_tran~d str10   %10s                  
fu_liver_tran~s str10   %10s                  
udca_last_date  byte    %8.0g                 
udca_first_af~r str10   %10s                  
udca_first_hi~y str10   %10s                  
covid_va~t_date str10   %10s                  
covid_vacc_se~e str10   %10s                  
covid_vacc_th~e str10   %10s                  
covid_vacc_fo~e str10   %10s                  
covid_~fth_date str10   %10s                  
date_most_rec~c str10   %10s                  
severe_disea~ed str10   %10s                  
severe_disea~cd str10   %10s                  
solid_organ_t~m str10   %10s                  solid_organ_transplant_nhsd_snome
                                                > d
solid_organ_n~w str10   %10s                  
solid_organ_t~s byte    %8.0g                 solid_organ_transplant_nhsd_opcs4
transplant_al~4 byte    %8.0g                 
transplant_th~4 str10   %10s                  
transplant_co~p byte    %8.0g                 transplant_conjunctiva_y_code_opc
                                                > s4
transplant_co~4 str10   %10s                  
transplant_st~4 str10   %10s                  
transplant_il.. byte    %8.0g                 transplant_ileum_1_Y_codes_opcs4
transplant_il.. byte    %8.0g                 transplant_ileum_2_Y_codes_opcs4
transpl~1_opcs4 str10   %10s                  
transpl~2_opcs4 str10   %10s                  
hosp_covid_pr~y str10   %10s                  
hosp_covid_any  str10   %10s                  
died_date_ons   str10   %10s                  
age             byte    %8.0g                 
sex             str1    %9s                   
stp             str4    %9s                   
region_nhs      str24   %24s                  
has_msoa        byte    %8.0g                 
imd             byte    %8.0g                 
eth             byte    %8.0g                 
ethnicity_sus   byte    %8.0g                 
ethnicity       byte    %8.0g                 
smoking_status  str1    %9s                   
bmi             float   %9.0g                 
has_pbc         byte    %8.0g                 
has_psc         byte    %8.0g                 
liver_transpl~l byte    %8.0g                 
udca_count_bl   byte    %8.0g                 
udca_count_fu   byte    %8.0g                 
oca_bl          byte    %8.0g                 
budesonide_co~u byte    %8.0g                 
budesonide_co~l byte    %8.0g                 
fenofibrate_c~u byte    %8.0g                 
fenofibrate_c~l byte    %8.0g                 
gc_count_fu     byte    %8.0g                 
gc_count_bl     byte    %8.0g                 
rituximab_bl    byte    %8.0g                 
severe_diseas~l byte    %8.0g                 
learning_disa~d byte    %8.0g                 
cancer_opensa~d byte    %8.0g                 
cancer_opensa~w byte    %8.0g                 
cancer_opensa~r byte    %8.0g                 
haematopoieti~d byte    %8.0g                 
haematopoiet~10 byte    %8.0g                 
haematopoieti~4 byte    %8.0g                 
haematologica~m byte    %8.0g                 haematological_malignancies_snome
                                                > d
haematologica~1 byte    %8.0g                 haematological_malignancies_icd10
sickle_cell_d~d byte    %8.0g                 
sickle_cell_~10 byte    %8.0g                 
haematopoieti~_ byte    %8.0g                 haematopoietic_stem_cell_snomed_e
                                                > ver
haematopoie~0_e byte    %8.0g                 haematopoietic_stem_cell_icd10_ev
                                                > er
haematopoie~4_e byte    %8.0g                 haematopoietic_stem_cell_opcs4_ev
                                                > er
v71             byte    %8.0g                 haematological_malignancies_snome
                                                > d_ever
v72             byte    %8.0g                 haematological_malignancies_icd10
                                                > _ever
ckd_stage_5_~ed byte    %8.0g                 
ckd_stage_5_~10 byte    %8.0g                 
immunosuppres~d byte    %8.0g                 
oral_steroid_~d byte    %8.0g                 
oral_s~3m_count byte    %8.0g                 
oral_s~2m_count byte    %8.0g                 
immunosuppres~r byte    %8.0g                 
oral_steroid_~r byte    %8.0g                 
immunosupress~d byte    %8.0g                 
immunosupress~w byte    %8.0g                 
hiv_aids_nhsd~d byte    %8.0g                 
hiv_aids_nhs~10 byte    %8.0g                 
multiple_scl~ed byte    %8.0g                 
multiple_scl~10 byte    %8.0g                 
motor_neurone~e byte    %8.0g                 motor_neurone_disease_nhsd_snomed
motor_neuron~10 byte    %8.0g                 
myasthenia_g~ed byte    %8.0g                 
myasthenia_g~10 byte    %8.0g                 
huntingtons_~ed byte    %8.0g                 
huntingtons_~10 byte    %8.0g                 
died_ons_live~y byte    %8.0g                 
died_ons_live~g byte    %8.0g                 
died_ons_covi~y byte    %8.0g                 
died_ons_covi~g byte    %8.0g                 
liver_transpl~e str10   %10s                  
severe_diseas~e str10   %10s                  
haematologica~d byte    %8.0g                 
haematologica~r byte    %8.0g                 
ckd_stage_5_~sd byte    %8.0g                 
hiv_aids_nhsd   byte    %8.0g                 
solid_organ_t~d str10   %10s                  
solid_organ_t~w str10   %10s                  
multiple_scl~sd byte    %8.0g                 
motor_neurone~d byte    %8.0g                 
myasthenia_g~sd byte    %8.0g                 
huntingtons_~sd byte    %8.0g                 
patient_id      int     %8.0g                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. save `tempfile', replace 
file /tmp/St00015.000001 saved

. 
. /* Time-varying covariates are assessed 6-monthly and at time of exposure swi
> tching.
> As disease severity, covid vaccination and liver transplant will only switch 
> once need to identify
> nearest date after date identified in study definition */ 
. * 120 day file: primary exposure definition 
. use ./output/time_varying_udca_vacc, clear 

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [0,9992]                     units:  1
         unique values:  1,904                    missing .:  0/2,904

                  mean:   5000.27
              std. dev:   2909.32

           percentiles:        10%       25%       50%       75%       90%
                               919      2473    5002.5    7508.5      9057

. merge m:1 patient_id using `tempfile', keepusing(severe_disease_fu_date sever
> e_disease_bl covid_vacc_first_date liver_transplant_fu_date dereg_date died_d
> ate_ons)

    Result                           # of obs.
    -----------------------------------------
    not matched                         1,808
        from master                     1,808  (_merge==1)
        from using                          0  (_merge==2)

    matched                             1,096  (_merge==3)
    -----------------------------------------

. * Should only be required for dummy data 
. keep if _merge==3
(1,808 observations deleted)

. * Only using start date as this is when udca exposure or 6 monthly check occu
> rs
. drop stop

. * Add in rows with each of the 6 monthly assessment dates 
. gen expand=1

. bys patient_id (start): replace expand=4 if _n==_N 
(1000 real changes made)

. expand expand, generate(newv)
(3,000 observations created)

. bys patient_id newv: gen number = _n 

. replace start = date("01/09/2021", "DMY") if newv==1 & number==1
(1,000 real changes made)

. replace start = date("01/03/2022", "DMY") if newv==1 & number==2
(1,000 real changes made)

. replace start = date("01/09/2022", "DMY") if newv==1 & number==3
(1,000 real changes made)

. 
. * This gives a file where start dates are either exposure switching or 6-mont
> ly assessment dates 
. * These will be used to determine the closest date to time-varying covariate 
> dates identified in study definition 
. sort patient_id start 

. drop newv

. 
. * Determine end of follow-up date
. gen dereg_dateA = date(dereg_date, "YMD")
(2,587 missing values generated)

. format %dD/N/CY dereg_dateA

. drop dereg_date

. gen died_dateA = date(died_date_ons, "YMD")
(2,628 missing values generated)

. format %dD/N/CY died_dateA

. drop died_date_ons

. gen end_study = date("31/12/2022", "DMY")

. egen end_date = rowmin(dereg_dateA end_study died_dateA)

. 
. * Take out assessments after end_date 
. drop if start>end_date
(772 observations deleted)

. 
. * Determine number of days between each covariate and dates of UDCA change or
>  6 monthly check date 
. bys patient_id (start): egen last_assess = max(start)

. * Format dates  and identify date nearest after covariate updates 
. foreach var in covid_vacc_first_date severe_disease_fu_date liver_transplant_
> fu_date {
  2.     gen `var'A = date(`var', "YMD")
  3.     format `var'A %dD/N/CY 
  4.     drop `var'
  5.     * time between date of record and change in covariate - positive value
> s are those where record starts after 
.     * covariate change date 
.     gen time_`var' = start - `var'A
  6.     * Set time variable for records prior to change as missing
.     replace time_`var'=. if time_`var'<0
  7.     * Check if any are on index date (1st March) potentially severe diseas
> e - not others
.     di "Number where time-varying update same as assessment date"
  8.     count if time_`var'==0
  9.     di "Number where time-varying update is 1st March 2021"
 10.     count if `var'A==date("01/03/2021", "DMY")
 11.     * Find earliest start date after covariate update
.     * Note: there are some changes that occur after the last available 6 mont
> h assessment or exposure change
.     bys patient_id (time_`var'): gen `var'_updateN = start[1] if `var'A!=. & 
> time_`var'!=.
 12.     * Spread to all rows for patient 
.     bys patient_id: egen `var'_update = max(`var'_updateN)
 13.     format `var'_update %dD/N/CY 
 14.     di "Number where new variable is prior to original variable (should be
>  0)"
 15.     count if `var'_update < `var'A
 16.     di "Number where time varying update is after last assessment date"
 17.     count if `var'A > last_assess & `var'A!=.  & last_assess==start
 18.     di "Number of time-varying changes originally" 
 19.     * Using last_assess==start to count patients rather than rows
.     count if `var'A!=. & last_assess==start 
 20.     di "Number of dates for time-varying update"
 21.     count if `var'_update!=. & last_assess==start & `var'A!=.
 22. }
(323 missing values generated)
(323 missing values generated)
(1,823 real changes made, 1,823 to missing)
Number where time-varying update same as assessment date
  4
Number where time-varying update is 1st March 2021
  0
(2,146 missing values generated)
(1028 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  309
Number of time-varying changes originally
  901
Number of dates for time-varying update
  592
(1,339 missing values generated)
(1,339 missing values generated)
(1,413 real changes made, 1,413 to missing)
Number where time-varying update same as assessment date
  1
Number where time-varying update is 1st March 2021
  0
(2,752 missing values generated)
(2197 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  303
Number of time-varying changes originally
  596
Number of dates for time-varying update
  293
(3,264 missing values generated)
(3,264 missing values generated)
(50 real changes made, 50 to missing)
Number where time-varying update same as assessment date
  0
Number where time-varying update is 1st March 2021
  0
(3,314 missing values generated)
(3308 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  12
Number of time-varying changes originally
  16
Number of dates for time-varying update
  4

. * For severe disease only update variable if no severe disease at baseline 
. count if severe_disease_fu_date_update==date("01/03/2021", "DMY") & severe_di
> sease_bl!=1 
  0

. tab severe_disease_bl

severe_dise |
     ase_bl |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,641       49.37       49.37
          1 |      1,683       50.63      100.00
------------+-----------------------------------
      Total |      3,324      100.00

. replace severe_disease_fu_date_update = . if severe_disease_bl==1
(555 real changes made, 555 to missing)

. 
. * Keep only change dates to create time-varying dataset
. keep patient_id covid_vacc_first_date_update severe_disease_fu_date_update li
> ver_transplant_fu_date_update severe_disease_bl end_date

. * Chercking number of patient_id's 
. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [1,9987]                     units:  1
         unique values:  1,000                    missing .:  0/3,324

                  mean:   4922.41
              std. dev:   2832.75

           percentiles:        10%       25%       50%       75%       90%
                               980      2528      4930      7241      8841

. duplicates drop 

Duplicates in terms of all variables

(2,324 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [1,9987]                     units:  1
         unique values:  1,000                    missing .:  0/1,000

                  mean:   4956.47
              std. dev:   2846.54

           percentiles:        10%       25%       50%       75%       90%
                             982.5      2577    4990.5      7283      8929

. count
  1,000

. * Create file for each covariate to merge onto udca exposure file 
. * First covid vaccination and liver transplant as all people will begin at ze
> ro 
. rename liver_transplant_fu_date_update liver_trans_date_update

. foreach var in covid_vacc_first liver_trans {
  2.     preserve
  3.     keep patient_id `var'_date_update end_date
  4.     * Drop updates after the end of follow-up 
.     count if `var'_date>=end_date 
  5.     replace `var'_date = . if `var'_date>=end_date 
  6.     * Flag if variable is updated
.     gen `var'=(`var'_date_update!=.)
  7.     * Create extra row if variable is updated 
.     gen expand = `var'+1
  8.     tab expand
  9.     expand expand, gen(newv)
 10.     * Update variables so row for when zero and row for when updated - if 
> not updated whole time will be zero 
.     gen start = date("01/03/2020", "DMY") if newv==0
 11.     replace start = `var'_date_update if newv==1
 12.     gen stop = `var'_date_update if newv==0
 13.     replace stop = end_date if stop==.
 14.     replace `var'=0 if newv==0
 15.     save ./output/tv_`var'_check, replace
 16.     keep patient_id `var' start stop
 17.     * Check data 
.     count if start==stop 
 18.     * drop where start is same as stop - should not drop any in real data 
.     drop if start==stop 
 19.     count if stop<start
 20.     codebook patient_id
 21.     save ./output/tv_`var'_vacc, replace
 22.     restore
 23. }
  408
(0 real changes made)

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        408       40.80       40.80
          2 |        592       59.20      100.00
------------+-----------------------------------
      Total |      1,000      100.00
(592 observations created)
(592 missing values generated)
(592 real changes made)
(1,000 missing values generated)
(1,000 real changes made)
(592 real changes made)
file ./output/tv_covid_vacc_first_check.dta saved
  0
(0 observations deleted)
  0

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [1,9987]                     units:  1
         unique values:  1,000                    missing .:  0/1,592

                  mean:   4952.27
              std. dev:   2839.64

           percentiles:        10%       25%       50%       75%       90%
                               980      2578    4980.5    7266.5      8905
(note: file ./output/tv_covid_vacc_first_vacc.dta not found)
file ./output/tv_covid_vacc_first_vacc.dta saved
  996
(0 real changes made)

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        996       99.60       99.60
          2 |          4        0.40      100.00
------------+-----------------------------------
      Total |      1,000      100.00
(4 observations created)
(4 missing values generated)
(4 real changes made)
(1,000 missing values generated)
(1,000 real changes made)
(4 real changes made)
file ./output/tv_liver_trans_check.dta saved
  0
(0 observations deleted)
  0

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [1,9987]                     units:  1
         unique values:  1,000                    missing .:  0/1,004

                  mean:   4945.02
              std. dev:   2848.97

           percentiles:        10%       25%       50%       75%       90%
                               980      2567    4985.5    7279.5      8926
(note: file ./output/tv_liver_trans_vacc.dta not found)
file ./output/tv_liver_trans_vacc.dta saved

. 
. * Same for liver disease severity, but variable can start at 1 and remain for
>  whole of follow-up 
. preserve

. keep patient_id severe_disease_fu_date_update end_date severe_disease_bl

. * Drop updates after the end of follow-up 
. replace severe_disease_fu_date_update=. if severe_disease_fu_date_update>=end
> _date 
(0 real changes made)

. * Flag if variable is updated
. gen severe_disease=(severe_disease_fu_date_update!=.)

. tab severe_disease 

severe_dise |
        ase |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        853       85.30       85.30
          1 |        147       14.70      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. replace severe_disease = 0 if severe_disease_bl==1
(0 real changes made)

. * Create extra row if variable is updated 
. gen expand = severe_disease + 1

. tab expand

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        853       85.30       85.30
          2 |        147       14.70      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. expand expand, gen(newv)
(147 observations created)

. tab newv

       newv |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,000       87.18       87.18
          1 |        147       12.82      100.00
------------+-----------------------------------
      Total |      1,147      100.00

. * Update variables so row for when zero and row for when updated - if not upd
> ated whole time will be zero 
. gen start = date("01/03/2021", "DMY") if newv==0
(147 missing values generated)

. replace start = severe_disease_fu_date_update if newv==1
(147 real changes made)

. gen stop = severe_disease_fu_date_update if newv==0 & severe_disease==1
(1,000 missing values generated)

. count if stop!=.
  147

. replace stop = end_date if stop==. 
(1,000 real changes made)

. count if stop==.
  0

. replace severe_disease=0 if newv==0 & severe_disease_bl==0
(147 real changes made)

. replace severe_disease=1 if newv==0 & severe_disease_bl==1
(500 real changes made)

. save ./output/tv_severe_disease_check, replace
file ./output/tv_severe_disease_check.dta saved

. keep patient_id severe_disease start stop

. * Check data 
. count if start==stop
  1

. * drop if start is same as stop - should not drop any in real data 
. drop if start==stop 
(1 observation deleted)

. count if stop<start
  0

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [1,9987]                     units:  1
         unique values:  999                      missing .:  0/1,146

                  mean:      4983
              std. dev:    2814.3

           percentiles:        10%       25%       50%       75%       90%
                              1007      2628      5035      7277      8887

. save ./output/tv_severe_disease_vacc, replace
(note: file ./output/tv_severe_disease_vacc.dta not found)
file ./output/tv_severe_disease_vacc.dta saved

. restore

. 
. * Time-varying vaccination count
. use ./output/time_varying_udca_vacc, clear 

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [0,9992]                     units:  1
         unique values:  1,904                    missing .:  0/2,904

                  mean:   5000.27
              std. dev:   2909.32

           percentiles:        10%       25%       50%       75%       90%
                               919      2473    5002.5    7508.5      9057

. merge m:1 patient_id using `tempfile', keepusing(covid_vacc* dereg_date died_
> date_ons date_most_recent_cov_vac)

    Result                           # of obs.
    -----------------------------------------
    not matched                         1,808
        from master                     1,808  (_merge==1)
        from using                          0  (_merge==2)

    matched                             1,096  (_merge==3)
    -----------------------------------------

. * Should only be required for dummy data 
. keep if _merge==3
(1,808 observations deleted)

. * Only using start date as this is when udca exposure or 6 monthly check occu
> rs
. drop stop

. * Add in rows with each of the 6 monthly assessment dates 
. gen expand=1

. bys patient_id (start): replace expand=4 if _n==_N 
(1000 real changes made)

. expand expand, generate(newv)
(3,000 observations created)

. bys patient_id newv: gen number = _n 

. replace start = date("01/09/2021", "DMY") if newv==1 & number==1
(1,000 real changes made)

. replace start = date("01/03/2022", "DMY") if newv==1 & number==2
(1,000 real changes made)

. replace start = date("01/09/2022", "DMY") if newv==1 & number==3
(1,000 real changes made)

. 
. * This gives a file where start dates are either exposure switching or 6-mont
> ly assessment dates 
. * These will be used to determine the closest date to time-varying covariate 
> dates identified in study definition 
. sort patient_id start 

. drop newv

. 
. * Determine end of follow-up date
. gen dereg_dateA = date(dereg_date, "YMD")
(2,587 missing values generated)

. format %dD/N/CY dereg_dateA

. drop dereg_date

. gen died_dateA = date(died_date_ons, "YMD")
(2,628 missing values generated)

. format %dD/N/CY died_dateA

. drop died_date_ons

. gen end_study = date("31/12/2022", "DMY")

. egen end_date = rowmin(dereg_dateA end_study died_dateA)

. 
. * Take out assessments after end_date 
. drop if start>end_date
(772 observations deleted)

. * Determine number of days between each covariate and dates of UDCA change or
>  6 monthly check date 
. bys patient_id (start): egen last_assess = max(start)

. * Format dates  and identify date nearest after covariate updates 
. foreach var in covid_vacc_first_date covid_vacc_second_date covid_vacc_third_
> date covid_vacc_fourth_date covid_vacc_fifth_date {
  2.     gen `var'A = date(`var', "YMD")
  3.     format `var'A %dD/N/CY 
  4.     drop `var'
  5.     * time between date of record and change in covariate - positive value
> s are those where record starts after 
.     * covariate change date 
.     gen time_`var' = start - `var'A
  6.     * Set time variable for records prior to change as missing
.     replace time_`var'=. if time_`var'<=0
  7.     * Check if any are on index date (1st March) 
.     di "Number where time-varying update same as assessment date"
  8.     count if time_`var'==0
  9.     di "Number where time-varying update is 1st March 2021"
 10.     count if `var'A==date("01/03/2021", "DMY")
 11.     * Find earliest start date after covariate update
.     * Note: there are some changes that occur after the last available 6 mont
> h assessment or exposure change
.     bys patient_id (time_`var'): gen `var'_updateN = start[1] if `var'A!=. & 
> time_`var'!=.
 12.     * Spread to all rows for patient 
.     bys patient_id: egen `var'_update = max(`var'_updateN)
 13.     format `var'_update %dD/N/CY 
 14.     di "Number where new variable is prior to original variable (should be
>  0)"
 15.     count if `var'_update < `var'A
 16.     di "Number where time varying update is after last assessment date"
 17.     count if `var'A > last_assess & `var'A!=.  & last_assess==start
 18.     di "Number of time-varying changes originally" 
 19.     * Using last_assess==start to count patients rather than rows
.     count if `var'A!=. & last_assess==start 
 20.     di "Number of dates for time-varying update"
 21.     count if `var'_update!=. & last_assess==start & `var'A!=.
 22. }
(323 missing values generated)
(323 missing values generated)
(1,827 real changes made, 1,827 to missing)
Number where time-varying update same as assessment date
  0
Number where time-varying update is 1st March 2021
  0
(2,150 missing values generated)
(1035 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  309
Number of time-varying changes originally
  901
Number of dates for time-varying update
  590
(666 missing values generated)
(666 missing values generated)
(1,664 real changes made, 1,664 to missing)
Number where time-varying update same as assessment date
  0
Number where time-varying update is 1st March 2021
  0
(2,330 missing values generated)
(1355 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  293
Number of time-varying changes originally
  801
Number of dates for time-varying update
  508
(2,983 missing values generated)
(2,983 missing values generated)
(281 real changes made, 281 to missing)
Number where time-varying update same as assessment date
  0
Number where time-varying update is 1st March 2021
  0
(3,264 missing values generated)
(3142 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  55
Number of time-varying changes originally
  100
Number of dates for time-varying update
  45
(1,660 missing values generated)
(1,660 missing values generated)
(58 real changes made, 58 to missing)
Number where time-varying update same as assessment date
  0
Number where time-varying update is 1st March 2021
  0
(1,718 missing values generated)
(1700 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  15
Number of time-varying changes originally
  500
Number of dates for time-varying update
  485
(1,692 missing values generated)
(1,692 missing values generated)
(23 real changes made, 23 to missing)
Number where time-varying update same as assessment date
  0
Number where time-varying update is 1st March 2021
  0
(1,715 missing values generated)
(1707 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  9
Number of time-varying changes originally
  500
Number of dates for time-varying update
  491

. 
. * Keep only change dates to create time-varying dataset
. keep patient_id covid_vacc_first_date_update covid_vacc_second_date_update co
> vid_vacc_third_date_update covid_vacc_fourth_date_update covid_vacc_fifth_dat
> e_update end_date date_most_recent_cov_vac

. * Chercking number of patient_id's 
. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [1,9987]                     units:  1
         unique values:  1,000                    missing .:  0/3,324

                  mean:   4922.41
              std. dev:   2832.75

           percentiles:        10%       25%       50%       75%       90%
                               980      2528      4930      7241      8841

. duplicates drop 

Duplicates in terms of all variables

(2,324 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [1,9987]                     units:  1
         unique values:  1,000                    missing .:  0/1,000

                  mean:   4956.47
              std. dev:   2846.54

           percentiles:        10%       25%       50%       75%       90%
                             982.5      2577    4990.5      7283      8929

. count
  1,000

. * Create dataset where rows are updated when person is vaccinated/re-vaccinat
> ed  
. foreach var in covid_vacc_first covid_vacc_second covid_vacc_third covid_vacc
> _fourth covid_vacc_fifth {
  2.     count if `var'_date_update>=end_date & `var'_date_update!=.
  3.     replace `var'_date_update = . if `var'_date_update>=end_date
  4.     * Create flag for each vaccination date 
.     gen `var'_flag = (`var'_date_update!=.)
  5.     * Create flag for if date is prior to 1st March 2021
.     gen `var'_prior = `var'_date_update <= date("01Mar2021", "DMY")
  6.     tab `var'_prior, m
  7. }
  0
(0 real changes made)

covid_vacc_ |
first_prior |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,000      100.00      100.00
------------+-----------------------------------
      Total |      1,000      100.00
  0
(0 real changes made)

covid_vacc_ |
second_prio |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,000      100.00      100.00
------------+-----------------------------------
      Total |      1,000      100.00
  0
(0 real changes made)

covid_vacc_ |
third_prior |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,000      100.00      100.00
------------+-----------------------------------
      Total |      1,000      100.00
  0
(0 real changes made)

covid_vacc_ |
fourth_prio |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        528       52.80       52.80
          1 |        472       47.20      100.00
------------+-----------------------------------
      Total |      1,000      100.00
  0
(0 real changes made)

covid_vacc_ |
fifth_prior |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        515       51.50       51.50
          1 |        485       48.50      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. * Check not date where prior vaccination is missing 
. count if covid_vacc_first_flag==0 & covid_vacc_second_flag==1
  137

. count if covid_vacc_second_flag==0 & covid_vacc_third_flag==1
  16

. count if covid_vacc_third_flag==0 & covid_vacc_fourth_flag==1
  458

. count if covid_vacc_fourth_flag==0 & covid_vacc_fifth_flag==1
  257

. 
. * Determine total number of vaccinations 
. egen total_vaccs = rowtotal(covid_vacc_first_flag covid_vacc_second_flag covi
> d_vacc_third_flag covid_vacc_fourth_flag covid_vacc_fifth_flag)

. tab total_vaccs

total_vaccs |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         81        8.10        8.10
          1 |        209       20.90       29.00
          2 |        328       32.80       61.80
          3 |        278       27.80       89.60
          4 |        100       10.00       99.60
          5 |          4        0.40      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. egen total_vaccs_prior = rowtotal(covid_vacc_first_prior covid_vacc_second_pr
> ior covid_vacc_third_prior covid_vacc_fourth_prior covid_vacc_fifth_prior)

. gen date_most_recent_cov_vacA = date(date_most_recent_cov_vac, "YMD")
(939 missing values generated)

. count if total_vaccs_prior!=0 & date_most_recent_cov_vacA==.
  688

. count if total_vaccs_prior==0 & date_most_recent_cov_vacA!=.
  16

. * Create time varying vaccination count variable 
. gen vacc_count_tv = 0

. * expand row up to total number of vaccinations 
. gen expand = total_vaccs + 1

. tab expand 

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         81        8.10        8.10
          2 |        209       20.90       29.00
          3 |        328       32.80       61.80
          4 |        278       27.80       89.60
          5 |        100       10.00       99.60
          6 |          4        0.40      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. expand expand, gen(newv)
(2,119 observations created)

. bys patient_id newv: gen number = _n 

. * Update variables so row for when zero and row for each vaccination - if not
>  updated whole time will be zero 
. gen start = date("01/03/2020", "DMY") if newv==0
(2,119 missing values generated)

. replace start = covid_vacc_first_date_update if newv==1 & number == 1
(590 real changes made)

. gen stop = covid_vacc_first_date_update if newv==0 & covid_vacc_first_date_up
> date!=.
(2,529 missing values generated)

. replace stop = end_date if stop==. & expand==1
(81 real changes made)

. replace stop = covid_vacc_second_date_update if newv==1 & number==1
(508 real changes made)

. replace vacc_count_tv = 1 if newv==1 & number==1
(919 real changes made)

. * Second vaccination 
. replace start = covid_vacc_second_date_update if newv==1 & number == 2
(480 real changes made)

. replace stop = covid_vacc_third_date_update if newv==1 & number==2 & covid_va
> cc_third_date_update!=.
(45 real changes made)

. replace stop = end_date if newv==1 & number==2 & covid_vacc_third_date_update
> ==.
(665 real changes made)

. replace vacc_count_tv = 2 if newv==1 & number==2
(710 real changes made)

. * Third vaccination 
. replace start = covid_vacc_third_date_update if newv==1 & number == 3
(41 real changes made)

. replace stop = covid_vacc_fourth_date_update if newv==1 & number==3 & covid_v
> acc_fourth_date_update!=.
(283 real changes made)

. replace stop = end_date if newv==1 & number==3 & covid_vacc_fourth_date_updat
> e==.
(99 real changes made)

. replace vacc_count_tv = 3 if newv==1 & number==3
(382 real changes made)

. * Fourth vaccination 
. replace start = covid_vacc_fourth_date_update if newv==1 & number == 4
(99 real changes made)

. replace stop = covid_vacc_fifth_date_update if newv==1 & number==4 & covid_va
> cc_fifth_date_update!=.
(97 real changes made)

. replace stop = end_date if newv==1 & number==4 & covid_vacc_fifth_date_update
> ==.
(7 real changes made)

. replace vacc_count_tv = 4 if newv==1 & number==4
(104 real changes made)

. * Fifth vaccination 
. replace start = covid_vacc_fifth_date_update if newv==1 & number == 5
(4 real changes made)

. replace stop = end_date if newv==1 & number==5
(4 real changes made)

. replace vacc_count_tv = 5 if newv==1 & number==5
(4 real changes made)

. save ./output/tv_total_vaccs_check, replace
(note: file ./output/tv_total_vaccs_check.dta not found)
file ./output/tv_total_vaccs_check.dta saved

. keep patient_id vacc_count_tv start stop

. * Check data 
. count if start==stop 
  409

. * drop where start is same as stop - should not drop any in real data 
. drop if start==stop 
(409 observations deleted)

. count if stop<start
  870

. count if start==. 
  713

. count if stop==1
  0

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [1,9987]                     units:  1
         unique values:  1,000                    missing .:  0/2,710

                  mean:    4965.2
              std. dev:    2840.6

           percentiles:        10%       25%       50%       75%       90%
                             992.5      2585      4979      7296      8914

. save ./output/tv_total_vaccs, replace
(note: file ./output/tv_total_vaccs.dta not found)
file ./output/tv_total_vaccs.dta saved

. 
. * Make age time-varying i.e. updating on 1st January each year
. use `tempfile', clear 

. * Determine end of follow-up date
. gen dereg_dateA = date(dereg_date, "YMD")
(633 missing values generated)

. format %dD/N/CY dereg_dateA

. drop dereg_date

. gen died_dateA = date(died_date_ons, "YMD")
(641 missing values generated)

. format %dD/N/CY died_dateA

. drop died_date_ons

. * Determine end of follow-up then add rows to update age for each year of fol
> low-up
. gen end_study = date("31/12/2022", "DMY")

. egen end_date = rowmin(dereg_dateA end_study died_dateA)

. keep patient_id age end_date

. gen yr_end = year(end_date)

. * Add rows to update age
. gen expand = 2 if yr_end==2022
(224 missing values generated)

. replace expand = 1 if yr_end==2021
(224 real changes made)

. tab expand, m

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        224       22.40       22.40
          2 |        776       77.60      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. expand expand, gen(newv)
(776 observations created)

. tab newv, nolabel

       newv |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,000       56.31       56.31
          1 |        776       43.69      100.00
------------+-----------------------------------
      Total |      1,776      100.00

. gen start = date("01/03/2021", "DMY") if newv==0
(776 missing values generated)

. replace start = date("01/01/2022", "DMY") if newv==1 
(776 real changes made)

. gen stop = date("01/01/2022", "DMY") if newv==0 
(776 missing values generated)

. replace stop = end_date if newv==0 & end_date<stop 
(224 real changes made)

. replace stop = date("31/12/2022", "DMY") if newv==1
(776 real changes made)

. replace stop = end_date if newv==1 & end_date<stop
(217 real changes made)

. gen age_tv = age if newv==0
(776 missing values generated)

. replace age_tv = age+1 if newv==1 
(776 real changes made)

. keep patient_id start stop age_tv 

. drop if start==stop
(2 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [1,9987]                     units:  1
         unique values:  999                      missing .:  0/1,774

                  mean:      4932
              std. dev:   2839.43

           percentiles:        10%       25%       50%       75%       90%
                               985      2528    4973.5      7258      8846

. save ./output/tv_age_vacc, replace 
(note: file ./output/tv_age_vacc.dta not found)
file ./output/tv_age_vacc.dta saved

. 
. 
. * Create files for outcomes
. use `tempfile', clear

. * Determine end of follow-up date
. foreach var in died_date_ons hosp_covid_primary hosp_covid_any dereg_date {
  2.     gen `var'A = date(`var', "YMD")
  3.     format `var'A %dD/N/CY
  4.     drop `var'
  5.     gen yr_`var' = year(`var'A)
  6.     tab yr_`var'
  7.     replace `var'A=. if yr_`var'==2023
  8. }
(641 missing values generated)
(641 missing values generated)

yr_died_dat |
      e_ons |      Freq.     Percent        Cum.
------------+-----------------------------------
       2021 |        118       32.87       32.87
       2022 |        129       35.93       68.80
       2023 |        112       31.20      100.00
------------+-----------------------------------
      Total |        359      100.00
(112 real changes made, 112 to missing)
(930 missing values generated)
(930 missing values generated)

yr_hosp_cov |
 id_primary |      Freq.     Percent        Cum.
------------+-----------------------------------
       2021 |         23       32.86       32.86
       2022 |         24       34.29       67.14
       2023 |         23       32.86      100.00
------------+-----------------------------------
      Total |         70      100.00
(23 real changes made, 23 to missing)
(937 missing values generated)
(937 missing values generated)

yr_hosp_cov |
     id_any |      Freq.     Percent        Cum.
------------+-----------------------------------
       2021 |         17       26.98       26.98
       2022 |         24       38.10       65.08
       2023 |         22       34.92      100.00
------------+-----------------------------------
      Total |         63      100.00
(22 real changes made, 22 to missing)
(633 missing values generated)
(633 missing values generated)

yr_dereg_da |
         te |      Freq.     Percent        Cum.
------------+-----------------------------------
       2021 |        118       32.15       32.15
       2022 |        127       34.60       66.76
       2023 |        122       33.24      100.00
------------+-----------------------------------
      Total |        367      100.00
(122 real changes made, 122 to missing)

. gen end_study = date("31/12/2022", "DMY")

. egen end_date = rowmin(dereg_dateA end_study died_date_onsA)

. 
. * Create flag indicating reason for end of follow-up 
. gen end_date_flag = (end_date==dereg_dateA)

. replace end_date_flag = 2 if end_date==died_date_onsA
(219 real changes made)

. replace end_date_flag = 3 if end_date==end_study
(559 real changes made)

. replace died_date_onsA=. if end_date<died_date_onsA
(28 real changes made, 28 to missing)

. replace died_ons_covid_flag_any=0 if end_date<died_date_onsA & died_ons_covid
> _flag_any==1
(394 real changes made)

. replace hosp_covid_anyA=. if end_date<hosp_covid_anyA
(9 real changes made, 9 to missing)

. gen hosp_any_flag = hosp_covid_anyA!=.

. 
. * Composite outcome 
. gen hosp_died_composite = (died_ons_covid_flag_any==1 | hosp_any_flag==1)

. egen hosp_died_dateA = rowmin(died_date_onsA hosp_covid_anyA)
(754 missing values generated)

. replace hosp_died_dateA=. if hosp_died_composite==0
(110 real changes made, 110 to missing)

. 
. * Check how composite is made up 
. tab died_ons_covid_flag_any hosp_any_flag

died_ons_c |
ovid_flag_ |     hosp_any_flag
       any |         0          1 |     Total
-----------+----------------------+----------
         0 |       864         30 |       894 
         1 |       104          2 |       106 
-----------+----------------------+----------
     Total |       968         32 |     1,000 

. di "Number where composite date = death date only"
Number where composite date = death date only

. count if hosp_died_dateA==died_date_onsA & hosp_died_dateA!=. & hosp_died_dat
> eA!=hosp_covid_anyA
  104

. di "Number where composite = hospitalisation date only"
Number where composite = hospitalisation date only

. count if hosp_died_dateA==hosp_covid_anyA & hosp_died_dateA!=. & hosp_died_da
> teA!=died_date_onsA
  32

. di "Number where composite = both death and hospitalisation date 
Number where composite = both death and hospitalisation date

. count if hosp_died_dateA==died_date_onsA & hosp_died_dateA!=. & hosp_died_dat
> eA==hosp_covid_anyA
  0

. 
. * Make file for each outcome: covid death, hospitalisation and composite 
. * Files contain patient ID, start = start study, stop = either end date for p
> atient or date of outcome 
. * and flag for outcome 
. * COVID death - covid code in any position
. preserve 

. keep patient_id end_date died_ons_covid_flag_any died_date_onsA

. gen start = date("01/03/2021", "DMY")

. egen stop = rowmin(died_date_onsA end_date)

. count if died_ons_covid_flag_any ==1 & end_date<died_date_onsA
  0

. replace died_ons_covid_flag_any=0 if end_date<died_date_onsA
(0 real changes made)

. keep patient_id start stop died_ons_covid_flag_any

. rename died_ons_covid_flag_any died_covid_any_flag

. * should be zero in real data
. count if start==stop
  1

. drop if start==stop
(1 observation deleted)

. save ./output/tv_outcome_died_covid_any_vacc, replace 
(note: file ./output/tv_outcome_died_covid_any_vacc.dta not found)
file ./output/tv_outcome_died_covid_any_vacc.dta saved

. tab died_covid_any_flag, m

died_covid_ |
   any_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        893       89.39       89.39
          1 |        106       10.61      100.00
------------+-----------------------------------
      Total |        999      100.00

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [1,9987]                     units:  1
         unique values:  999                      missing .:  0/999

                  mean:   4958.69
              std. dev:    2847.1

           percentiles:        10%       25%       50%       75%       90%
                               980      2576      4992      7284      8932

. restore 

. 
. * Hospitalisation - covid code in any position
. preserve 

. keep patient_id end_date hosp_any_flag hosp_covid_anyA end_date_flag

. gen start = date("01/03/2021", "DMY")

. egen stop = rowmin(hosp_covid_anyA end_date)

. count if hosp_any_flag ==1 & end_date<hosp_covid_anyA
  0

. tab end_date_flag if hosp_any_flag ==1 & end_date<hosp_covid_anyA
no observations

. replace hosp_any_flag=0 if end_date<hosp_covid_anyA
(0 real changes made)

. keep patient_id start stop hosp_any_flag

. * should be zero in real data
. count if start==stop
  1

. drop if start==stop
(1 observation deleted)

. save ./output/tv_outcome_hosp_any_vacc, replace 
(note: file ./output/tv_outcome_hosp_any_vacc.dta not found)
file ./output/tv_outcome_hosp_any_vacc.dta saved

. tab hosp_any_flag, m

hosp_any_fl |
         ag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        967       96.80       96.80
          1 |         32        3.20      100.00
------------+-----------------------------------
      Total |        999      100.00

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [1,9987]                     units:  1
         unique values:  999                      missing .:  0/999

                  mean:   4958.69
              std. dev:    2847.1

           percentiles:        10%       25%       50%       75%       90%
                               980      2576      4992      7284      8932

. count
  999

. bys patient_id: egen total_hosp = total(hosp_any_flag)

. tab total_hosp

 total_hosp |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        967       96.80       96.80
          1 |         32        3.20      100.00
------------+-----------------------------------
      Total |        999      100.00

. restore 

. 
. * Composite 
. preserve 

. keep patient_id hosp_died* end_date

. gen start = date("01/03/2021", "DMY")

. egen stop = rowmin(hosp_died_dateA end_date)

. count if hosp_died_composite==1 & end_date<hosp_died_dateA
  0

. replace hosp_died_composite=0 if end_date<hosp_died_dateA
(0 real changes made)

. keep patient_id start stop hosp_died_composite

. rename hosp_died_composite composite_any_flag

. * should be zero in real data
. count if start==stop
  1

. drop if start==stop
(1 observation deleted)

. save ./output/tv_outcome_composite_any_vacc, replace 
(note: file ./output/tv_outcome_composite_any_vacc.dta not found)
file ./output/tv_outcome_composite_any_vacc.dta saved

. tab composite_any_flag, m

composite_a |
    ny_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        863       86.39       86.39
          1 |        136       13.61      100.00
------------+-----------------------------------
      Total |        999      100.00

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [1,9987]                     units:  1
         unique values:  999                      missing .:  0/999

                  mean:   4958.69
              std. dev:    2847.1

           percentiles:        10%       25%       50%       75%       90%
                               980      2576      4992      7284      8932

. restore 

. 
. * Merge files together for each outcome
. * Composite  
. use ./output/tv_severe_disease_vacc, clear 

. tvc_merge start stop using ./output/tv_covid_vacc_first_vacc, id(patient_id)

. tvc_merge start stop using ./output/tv_total_vaccs, id(patient_id)

. tvc_merge start stop using ./output/tv_liver_trans_vacc, id(patient_id)

. tvc_merge start stop using ./output/time_varying_udca_vacc, id(patient_id)

. tvc_merge start stop using ./output/tv_age_vacc, id(patient_id)

. tvc_merge start stop using ./output/tv_outcome_composite_any_vacc, id(patient
> _id) failure(composite_any_flag)

. * Dummy drug data includes people not in cohort, so drop these - should not b
> e any in real data 
. drop if age_tv==.
(2,904 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [1,9987]                     units:  1
         unique values:  999                      missing .:  0/2,902

                  mean:   4954.62
              std. dev:   2831.16

           percentiles:        10%       25%       50%       75%       90%
                              1005      2578    4977.5      7275      8887

. * Check number of outcomes after merge  - there will be missings for rows aft
> er event
. tab composite_any_flag, m

composite_a |
    ny_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,701       93.07       93.07
          1 |        136        4.69       97.76
          . |         65        2.24      100.00
------------+-----------------------------------
      Total |      2,902      100.00

. missings report

Checking missings in all variables:
65 observations with missing values

  +--------------------------------+
  |                      # missing |
  |--------------------------------|
  | composite_any_flag          65 |
  +--------------------------------+

. drop if composite_any_flag==.
(65 observations deleted)

. save ./output/tv_vars_composite_any_vacc, replace 
(note: file ./output/tv_vars_composite_any_vacc.dta not found)
file ./output/tv_vars_composite_any_vacc.dta saved

. 
. * COVID death - covid code in any position
. use ./output/tv_severe_disease_vacc, clear 

. tvc_merge start stop using ./output/tv_covid_vacc_first_vacc, id(patient_id)

. tvc_merge start stop using ./output/tv_total_vaccs, id(patient_id)

. tvc_merge start stop using ./output/tv_liver_trans_vacc, id(patient_id)

. tvc_merge start stop using ./output/time_varying_udca_vacc, id(patient_id)

. tvc_merge start stop using ./output/tv_age_vacc, id(patient_id)

. tvc_merge start stop using ./output/tv_outcome_died_covid_any_vacc, id(patien
> t_id) failure(died_covid_any_flag)

. * Dummy drug data includes people not in cohort, so drop these - should not b
> e any in real data 
. drop if age_tv==.
(2,904 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [1,9987]                     units:  1
         unique values:  999                      missing .:  0/2,870

                  mean:   4944.17
              std. dev:   2832.36

           percentiles:        10%       25%       50%       75%       90%
                              1000      2576      4976      7258      8846

. * Check number of outcomes after merge 
. tab died_covid_any_flag, m

died_covid_ |
   any_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,764       96.31       96.31
          1 |        106        3.69      100.00
------------+-----------------------------------
      Total |      2,870      100.00

. missings report

Checking missings in all variables:
0 observations with missing values

. save ./output/tv_vars_died_covid_any_vacc, replace 
(note: file ./output/tv_vars_died_covid_any_vacc.dta not found)
file ./output/tv_vars_died_covid_any_vacc.dta saved

. 
. * COVID hospitalisation - covid code in any position
. use ./output/tv_severe_disease_vacc, clear 

. tvc_merge start stop using ./output/tv_covid_vacc_first_vacc, id(patient_id)

. tvc_merge start stop using ./output/tv_total_vaccs, id(patient_id)

. tvc_merge start stop using ./output/tv_liver_trans_vacc, id(patient_id)

. tvc_merge start stop using ./output/time_varying_udca_vacc, id(patient_id)

. tvc_merge start stop using ./output/tv_age_vacc, id(patient_id)

. tvc_merge start stop using ./output/tv_outcome_hosp_any_vacc, id(patient_id) 
> failure(hosp_any_flag)

. * Check number of outcomes after merge 
. tab hosp_any_flag, m

hosp_any_fl |
         ag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,805       48.31       48.31
          1 |         32        0.55       48.86
          . |      2,969       51.14      100.00
------------+-----------------------------------
      Total |      5,806      100.00

. bys patient_id: egen total_hosp = total(hosp_any_flag)

. tab total_hosp

 total_hosp |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,639       97.12       97.12
          1 |        167        2.88      100.00
------------+-----------------------------------
      Total |      5,806      100.00

. * Dummy drug data includes people not in cohort, so drop these - should not b
> e any in real data 
. drop if age_tv==.
(2,904 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [1,9987]                     units:  1
         unique values:  999                      missing .:  0/2,902

                  mean:   4954.62
              std. dev:   2831.16

           percentiles:        10%       25%       50%       75%       90%
                              1005      2578    4977.5      7275      8887

. * Check number of outcomes after merge - there will be missings for rows afte
> r event
. tab hosp_any_flag, m 

hosp_any_fl |
         ag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,805       96.66       96.66
          1 |         32        1.10       97.76
          . |         65        2.24      100.00
------------+-----------------------------------
      Total |      2,902      100.00

. missings report

Checking missings in all variables:
65 observations with missing values

  +---------------------------+
  |                 # missing |
  |---------------------------|
  | hosp_any_flag          65 |
  +---------------------------+

. drop if hosp_any_flag==.
(65 observations deleted)

. save ./output/tv_vars_hosp_any_vacc, replace 
(note: file ./output/tv_vars_hosp_any_vacc.dta not found)
file ./output/tv_vars_hosp_any_vacc.dta saved

. 
. /* Format file with static covariates: sex, region, covid high risk condition
> s, 
> ethnicity, imd, bmi, smoking. */
. 
. ** Need to decide on second line therapies 
. use `tempfile', clear

. describe 

Contains data from /tmp/St00015.000001
  obs:         1,000                          
 vars:           109                          25 Sep 2023 12:28
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
dereg_date      str10   %10s                  
has_pbc_date    int     %8.0g                 
has_psc_date    int     %8.0g                 
fu_liver_tran~d str10   %10s                  
fu_liver_tran~s str10   %10s                  
udca_last_date  byte    %8.0g                 
udca_first_af~r str10   %10s                  
udca_first_hi~y str10   %10s                  
covid_va~t_date str10   %10s                  
covid_vacc_se~e str10   %10s                  
covid_vacc_th~e str10   %10s                  
covid_vacc_fo~e str10   %10s                  
covid_~fth_date str10   %10s                  
date_most_rec~c str10   %10s                  
severe_disea~ed str10   %10s                  
severe_disea~cd str10   %10s                  
solid_organ_t~m str10   %10s                  solid_organ_transplant_nhsd_snome
                                                > d
solid_organ_n~w str10   %10s                  
solid_organ_t~s byte    %8.0g                 solid_organ_transplant_nhsd_opcs4
transplant_al~4 byte    %8.0g                 
transplant_th~4 str10   %10s                  
transplant_co~p byte    %8.0g                 transplant_conjunctiva_y_code_opc
                                                > s4
transplant_co~4 str10   %10s                  
transplant_st~4 str10   %10s                  
transplant_il.. byte    %8.0g                 transplant_ileum_1_Y_codes_opcs4
transplant_il.. byte    %8.0g                 transplant_ileum_2_Y_codes_opcs4
transpl~1_opcs4 str10   %10s                  
transpl~2_opcs4 str10   %10s                  
hosp_covid_pr~y str10   %10s                  
hosp_covid_any  str10   %10s                  
died_date_ons   str10   %10s                  
age             byte    %8.0g                 
sex             str1    %9s                   
stp             str4    %9s                   
region_nhs      str24   %24s                  
has_msoa        byte    %8.0g                 
imd             byte    %8.0g                 
eth             byte    %8.0g                 
ethnicity_sus   byte    %8.0g                 
ethnicity       byte    %8.0g                 
smoking_status  str1    %9s                   
bmi             float   %9.0g                 
has_pbc         byte    %8.0g                 
has_psc         byte    %8.0g                 
liver_transpl~l byte    %8.0g                 
udca_count_bl   byte    %8.0g                 
udca_count_fu   byte    %8.0g                 
oca_bl          byte    %8.0g                 
budesonide_co~u byte    %8.0g                 
budesonide_co~l byte    %8.0g                 
fenofibrate_c~u byte    %8.0g                 
fenofibrate_c~l byte    %8.0g                 
gc_count_fu     byte    %8.0g                 
gc_count_bl     byte    %8.0g                 
rituximab_bl    byte    %8.0g                 
severe_diseas~l byte    %8.0g                 
learning_disa~d byte    %8.0g                 
cancer_opensa~d byte    %8.0g                 
cancer_opensa~w byte    %8.0g                 
cancer_opensa~r byte    %8.0g                 
haematopoieti~d byte    %8.0g                 
haematopoiet~10 byte    %8.0g                 
haematopoieti~4 byte    %8.0g                 
haematologica~m byte    %8.0g                 haematological_malignancies_snome
                                                > d
haematologica~1 byte    %8.0g                 haematological_malignancies_icd10
sickle_cell_d~d byte    %8.0g                 
sickle_cell_~10 byte    %8.0g                 
haematopoieti~_ byte    %8.0g                 haematopoietic_stem_cell_snomed_e
                                                > ver
haematopoie~0_e byte    %8.0g                 haematopoietic_stem_cell_icd10_ev
                                                > er
haematopoie~4_e byte    %8.0g                 haematopoietic_stem_cell_opcs4_ev
                                                > er
v71             byte    %8.0g                 haematological_malignancies_snome
                                                > d_ever
v72             byte    %8.0g                 haematological_malignancies_icd10
                                                > _ever
ckd_stage_5_~ed byte    %8.0g                 
ckd_stage_5_~10 byte    %8.0g                 
immunosuppres~d byte    %8.0g                 
oral_steroid_~d byte    %8.0g                 
oral_s~3m_count byte    %8.0g                 
oral_s~2m_count byte    %8.0g                 
immunosuppres~r byte    %8.0g                 
oral_steroid_~r byte    %8.0g                 
immunosupress~d byte    %8.0g                 
immunosupress~w byte    %8.0g                 
hiv_aids_nhsd~d byte    %8.0g                 
hiv_aids_nhs~10 byte    %8.0g                 
multiple_scl~ed byte    %8.0g                 
multiple_scl~10 byte    %8.0g                 
motor_neurone~e byte    %8.0g                 motor_neurone_disease_nhsd_snomed
motor_neuron~10 byte    %8.0g                 
myasthenia_g~ed byte    %8.0g                 
myasthenia_g~10 byte    %8.0g                 
huntingtons_~ed byte    %8.0g                 
huntingtons_~10 byte    %8.0g                 
died_ons_live~y byte    %8.0g                 
died_ons_live~g byte    %8.0g                 
died_ons_covi~y byte    %8.0g                 
died_ons_covi~g byte    %8.0g                 
liver_transpl~e str10   %10s                  
severe_diseas~e str10   %10s                  
haematologica~d byte    %8.0g                 
haematologica~r byte    %8.0g                 
ckd_stage_5_~sd byte    %8.0g                 
hiv_aids_nhsd   byte    %8.0g                 
solid_organ_t~d str10   %10s                  
solid_organ_t~w str10   %10s                  
multiple_scl~sd byte    %8.0g                 
motor_neurone~d byte    %8.0g                 
myasthenia_g~sd byte    %8.0g                 
huntingtons_~sd byte    %8.0g                 
patient_id      int     %8.0g                 
-------------------------------------------------------------------------------
Sorted by: 

. * Format variables 
. * Sex
. gen male = 1 if sex == "M"
(537 missing values generated)

. replace male = 0 if sex == "F"
(523 real changes made)

. * Ethnicity
. replace ethnicity=6 if ethnicity==0
(58 real changes made)

. label define eth5                       1 "White"                            
>            ///
>                             2 "Mixed"                           ///          
>                                    
>                             3 "Asian"                                   ///
>                             4 "Black"                                   ///
>                             5 "Other"                                   ///
>                             6 "Unknown"

.                     
. 
. label values ethnicity eth5

. safetab ethnicity, m
10

  ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |        154       15.40       15.40
      Mixed |        191       19.10       34.50
      Asian |        208       20.80       55.30
      Black |        177       17.70       73.00
      Other |        212       21.20       94.20
    Unknown |         58        5.80      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. * Create White vs non-White ethnicity variable
. gen eth_bin = (ethnicity!=1)

. replace eth_bin = 2 if ethnicity==6
(58 real changes made)

. label define eth_3 0 "White" 1 "Non-White" 2 "Unknown"

. label values eth_bin eth_3

. tab eth_bin ethnicity, m 

           |                       ethnicity
   eth_bin |     White      Mixed      Asian      Black      Other |     Total
-----------+-------------------------------------------------------+----------
     White |       154          0          0          0          0 |       154 
 Non-White |         0        191        208        177        212 |       788 
   Unknown |         0          0          0          0          0 |        58 
-----------+-------------------------------------------------------+----------
     Total |       154        191        208        177        212 |     1,000 


           | ethnicity
   eth_bin |   Unknown |     Total
-----------+-----------+----------
     White |         0 |       154 
 Non-White |         0 |       788 
   Unknown |        58 |        58 
-----------+-----------+----------
     Total |        58 |     1,000 

. 
. 
. * IMD - should not be missing (i.e. 0) in real data
. replace imd=6 if imd==0
(45 real changes made)

. 
. * BMI categories
. * assume BMI's less than 10 are incorrect and set to missing 
. sum bmi, d 

                             bmi
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,000
25%     15.69678              0       Sum of Wgt.       1,000

50%     25.34112                      Mean           22.25085
                        Largest       Std. Dev.      13.17012
75%     31.57951       48.26082
90%     36.74167       48.29522       Variance       173.4521
95%       40.371        49.0592       Skewness      -.5393152
99%     46.19471       49.22062       Kurtosis       2.270618

. replace bmi = . if bmi<10
(210 real changes made, 210 to missing)

. egen bmi_cat = cut(bmi), at(0, 1, 18.5, 24.9, 29.9, 39.9, 100) icodes
(210 missing values generated)

. bys bmi_cat: sum bmi

-------------------------------------------------------------------------------
-> bmi_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |         86    15.47231    2.297328   10.24404    18.4519

-------------------------------------------------------------------------------
-> bmi_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        187    22.12234    1.813517   18.56863   24.82433

-------------------------------------------------------------------------------
-> bmi_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        207    27.44709    1.476499   24.90044   29.83551

-------------------------------------------------------------------------------
-> bmi_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        255    33.88192    2.597619   30.01805   39.88887

-------------------------------------------------------------------------------
-> bmi_cat = 5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |         55    43.36003    2.625495   40.00311   49.22062

-------------------------------------------------------------------------------
-> bmi_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |          0


. * assume missing . is healthy range BMI
. replace bmi_cat = 2 if bmi_cat==. 
(210 real changes made)

. label define bmi 1 "Underweight" 2 "Healthy range" 3 "Overweight" 4 "Obese" 5
>  "Morbidly obese"

. label values bmi_cat bmi

. tab bmi_cat 

       bmi_cat |      Freq.     Percent        Cum.
---------------+-----------------------------------
   Underweight |         86        8.60        8.60
 Healthy range |        397       39.70       48.30
    Overweight |        207       20.70       69.00
         Obese |        255       25.50       94.50
Morbidly obese |         55        5.50      100.00
---------------+-----------------------------------
         Total |      1,000      100.00

. 
. * Smoking status - assume missings are non-smokers 
. gen smoking = 0 if smoking_status=="N"
(908 missing values generated)

. replace smoking = 1 if smoking_status=="S"
(205 real changes made)

. replace smoking = 2 if smoking_status=="E"
(155 real changes made)

. replace smoking = 1 if smoking==.
(548 real changes made)

. label define smok 1 "Current smoker" 2 "Ex-smoker" 0 "Never smoked" 

. label values smoking smok

. tab smoking 

       smoking |      Freq.     Percent        Cum.
---------------+-----------------------------------
  Never smoked |         92        9.20        9.20
Current smoker |        753       75.30       84.50
     Ex-smoker |        155       15.50      100.00
---------------+-----------------------------------
         Total |      1,000      100.00

. 
. * High risk covid conditions
. replace oral_steroid_drugs_nhsd=. if oral_steroid_drug_nhsd_3m_count < 2 & or
> al_steroid_drug_nhsd_12m_count < 4
(938 real changes made, 938 to missing)

. gen imid_nhsd=max(oral_steroid_drugs_nhsd, immunosuppresant_drugs_nhsd)

. gen rare_neuro_nhsd = max(multiple_sclerosis_nhsd, motor_neurone_disease_nhsd
> , myasthenia_gravis_nhsd, huntingtons_disease_nhsd)

. gen solid_organ_transplant_bin = solid_organ_transplant_nhsd_new!=""

. gen any_high_risk_condition = max(learning_disability_nhsd_snomed, cancer_ope
> nsafely_snomed_new, haematological_disease_nhsd, ///
> ckd_stage_5_nhsd, imid_nhsd, immunosupression_nhsd_new, hiv_aids_nhsd, solid_
> organ_transplant_bin, rare_neuro_nhsd)

. 
. * Time from most recent vaccination on 1st March 2021
. gen date_most_recent_cov_vacA = date(date_most_recent_cov_vac, "YMD")
(939 missing values generated)

. gen time_vacc = date("01Mar2021", "DMY") - date_most_recent_cov_vacA
(939 missing values generated)

. sum time_vacc, d

                          time_vacc
-------------------------------------------------------------
      Percentiles      Smallest
 1%            2              2
 5%            4              2
10%            8              3       Obs                  61
25%           24              4       Sum of Wgt.          61

50%           41                      Mean           41.90164
                        Largest       Std. Dev.      24.83459
75%           60             84
90%           74             85       Variance       616.7568
95%           84             88       Skewness       .1138117
99%           89             89       Kurtosis       2.071786

. xtile time_vacc_cat = time_vacc, nq(4)

. replace time_vacc_cat = 5 if time_vacc_cat == .
(939 real changes made)

. bys time_vacc_cat: sum time_vacc 

-------------------------------------------------------------------------------
-> time_vacc_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   time_vacc |         16      10.375    7.098122          2         24

-------------------------------------------------------------------------------
-> time_vacc_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   time_vacc |         16     34.6875    4.269563         28         41

-------------------------------------------------------------------------------
-> time_vacc_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   time_vacc |         14        50.5    6.073271         42         60

-------------------------------------------------------------------------------
-> time_vacc_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   time_vacc |         15        75.2    8.841461         62         89

-------------------------------------------------------------------------------
-> time_vacc_cat = 5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   time_vacc |          0


. label define vacc_t 1 "Q1 closest vaccination" 2 "Q2" 3 "Q3" 4 "Q4 furthest v
> accination" 5 "No vaccination" 

. label values time_vacc_cat vacc_t 

. 
. keep patient_id male stp any_high_risk_condition ethnicity imd bmi_cat smokin
> g eth_bin time_vacc_cat has_pbc oca_bl

. tempfile basefile

. save `basefile', replace
(note: file /tmp/St00015.00000x not found)
file /tmp/St00015.00000x saved

. foreach var in died_covid_any hosp_any composite_any {
  2.     preserve 
  3.     merge 1:m patient_id using ./output/tv_vars_`var'_vacc 
  4.     drop _merge 
  5.     save ./output/an_dataset_`var'_vacc, replace
  6.     restore
  7. }

    Result                           # of obs.
    -----------------------------------------
    not matched                             1
        from master                         1  (_merge==1)
        from using                          0  (_merge==2)

    matched                             2,870  (_merge==3)
    -----------------------------------------
(note: file ./output/an_dataset_died_covid_any_vacc.dta not found)
file ./output/an_dataset_died_covid_any_vacc.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             1
        from master                         1  (_merge==1)
        from using                          0  (_merge==2)

    matched                             2,837  (_merge==3)
    -----------------------------------------
(note: file ./output/an_dataset_hosp_any_vacc.dta not found)
file ./output/an_dataset_hosp_any_vacc.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             1
        from master                         1  (_merge==1)
        from using                          0  (_merge==2)

    matched                             2,837  (_merge==3)
    -----------------------------------------
(note: file ./output/an_dataset_composite_any_vacc.dta not found)
file ./output/an_dataset_composite_any_vacc.dta saved

. 
. log close 
      name:  <unnamed>
       log:  /workspace/logs/time_varying.log
  log type:  text
 closed on:  25 Sep 2023, 12:29:18
-------------------------------------------------------------------------------
