
. 
. tempfile tempfile 

. import delimited using ./output/input_pbc.csv
(102 vars, 1,000 obs)

. save `tempfile' 
file /tmp/St00015.000001 saved

. 
. * Use time-varying exposure file and add in rows for the 6 monthly covariate 
> assessment times 
. use ./output/time_varying_udca_120, clear 

. drop stop

. gen expand=1

. bys patient_id (start): replace expand=6 if _n==_N 
(1908 real changes made)

. expand expand, generate(newv)
(9,540 observations created)

. bys patient_id newv: gen number = _n 

. replace start = date("01/09/2020", "DMY") if newv==1 & number==1
(1,908 real changes made)

. replace start = date("01/03/2021", "DMY") if newv==1 & number==2
(1,908 real changes made)

. replace start = date("01/09/2021", "DMY") if newv==1 & number==3
(1,908 real changes made)

. replace start = date("01/03/2022", "DMY") if newv==1 & number==4
(1,908 real changes made)

. replace start = date("01/09/2022", "DMY") if newv==1 & number==5
(1,908 real changes made)

. 
. sort patient_id start 

. 
. merge m:1 patient_id using `tempfile', keepusing(severe_disease_fu_date sever
> e_disease_bl covid_vacc_fu_date liver_transplant_fu_date dereg_date died_date
> _ons)

    Result                           # of obs.
    -----------------------------------------
    not matched                         6,364
        from master                     6,364  (_merge==1)
        from using                          0  (_merge==2)

    matched                             6,090  (_merge==3)
    -----------------------------------------

. 
. * Determine end of follow-up date
. gen dereg_dateA = date(dereg_date, "YMD")
(9,409 missing values generated)

. format %dD/N/CY dereg_dateA

. drop dereg_date

. gen died_dateA = date(died_date_ons, "YMD")
(9,414 missing values generated)

. format %dD/N/CY died_dateA

. drop died_date_ons

. gen end_study = date("31/12/2022", "DMY")

. egen end_date = rowmin(dereg_dateA end_study died_dateA)

. 
. * Determine number of days between each covariate and dates 
. 
. * Format dates  and identify date nearest after covariate updates 
. foreach var in covid_vacc_fu_date severe_disease_fu_date liver_transplant_fu_
> date {
  2.     gen `var'A = date(`var', "YMD")
  3.     format `var'A %dD/N/CY 
  4.     drop `var'
  5.     * time between date of record and change in covariate
.     gen time_`var' = start - `var'A
  6.     * Set time variable for records prior to change as missing
.     replace time_`var'=. if time_`var'<0
  7.     * Find earliest start date after covariate update
.     bys patient_id (time_`var'): gen `var'_update = start[1] if `var'A!=.
  8.     format `var'_update %dD/N/CY 
  9. }
(6,967 missing values generated)
(6,967 missing values generated)
(3,753 real changes made, 3,753 to missing)
(6,967 missing values generated)
(7,901 missing values generated)
(7,901 missing values generated)
(2,666 real changes made, 2,666 to missing)
(7,901 missing values generated)
(12,211 missing values generated)
(12,211 missing values generated)
(151 real changes made, 151 to missing)
(12,211 missing values generated)

. * For severe disease only update variable if no severe disease at baseline 
. replace severe_disease_fu_date_update = . if severe_disease_bl==1
(2,284 real changes made, 2,284 to missing)

. 
. * Keep only change dates to create time-varying dataset
. keep patient_id covid_vacc_fu_date_update severe_disease_fu_date_update liver
> _transplant_fu_date_update severe_disease_bl end_date

. duplicates drop 

Duplicates in terms of all variables

(10,546 observations deleted)

. * Create file for each covariate to merge onto udca exposure file 
. * First covid vaccination and liver transplant as all people will begin at ze
> ro 
. foreach var in covid_vacc liver_transplant {
  2.     preserve
  3.     keep patient_id `var'_fu_date_update end_date
  4.     * Drop updates after the end of follow-up 
.     replace `var'_fu_date = . if `var'_fu_date>end_date 
  5.     * Flag if variable is updated
.     gen `var'=(`var'_fu_date_update!=.)
  6.     * Create extra row if variable is updated 
.     gen expand = `var'+1
  7.     tab expand
  8.     expand expand, gen(newv)
  9.     * Update variables so row for when zero and row for when updated - if 
> not updated whole time will be zero 
.     gen start = date("01/03/2020", "DMY") if newv==0
 10.     replace start = `var'_fu_date_update if newv==1
 11.     gen stop = `var'_fu_date_update if newv==0
 12.     replace stop = end_date if stop==.
 13.     replace `var'=0 if newv==0
 14.     save ./output/tv_`var'_check, replace
 15.     keep patient_id `var' start stop
 16.     * Check data 
.     count if start==stop 
 17.     * drop start==stop but should not drop any in real data 
.     drop if start==stop 
 18.     count if stop<start
 19.     save ./output/tv_`var', replace
 20.     restore
 21. }
(406 real changes made, 406 to missing)

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,413       74.06       74.06
          2 |        495       25.94      100.00
------------+-----------------------------------
      Total |      1,908      100.00
(495 observations created)
(495 missing values generated)
(495 real changes made)
(1,908 missing values generated)
(1,908 real changes made)
(495 real changes made)
(note: file ./output/tv_covid_vacc_check.dta not found)
file ./output/tv_covid_vacc_check.dta saved
  21
(21 observations deleted)
  0
(note: file ./output/tv_covid_vacc.dta not found)
file ./output/tv_covid_vacc.dta saved
(14 real changes made, 14 to missing)

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,882       98.64       98.64
          2 |         26        1.36      100.00
------------+-----------------------------------
      Total |      1,908      100.00
(26 observations created)
(26 missing values generated)
(26 real changes made)
(1,908 missing values generated)
(1,908 real changes made)
(26 real changes made)
(note: file ./output/tv_liver_transplant_check.dta not found)
file ./output/tv_liver_transplant_check.dta saved
  2
(2 observations deleted)
  0
(note: file ./output/tv_liver_transplant.dta not found)
file ./output/tv_liver_transplant.dta saved

. 
. * Same for liver disease severity, but variable can start at 1 so remains as 
> this for whole of follow-up 
. preserve

. keep patient_id severe_disease_fu_date_update end_date severe_disease_bl

. * Drop updates after the end of follow-up 
. replace severe_disease_fu_date_update=. if severe_disease_fu_date_update>end_
> date 
(130 real changes made, 130 to missing)

. * Flag if variable is updated
. gen severe_disease=(severe_disease_fu_date_update!=.)

. tab severe_disease 

severe_dise |
        ase |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,665       87.26       87.26
          1 |        243       12.74      100.00
------------+-----------------------------------
      Total |      1,908      100.00

. replace severe_disease = 0 if severe_disease_bl==1
(0 real changes made)

. * Create extra row if variable is updated 
. gen expand = severe_disease + 1

. tab expand

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,665       87.26       87.26
          2 |        243       12.74      100.00
------------+-----------------------------------
      Total |      1,908      100.00

. expand expand, gen(newv)
(243 observations created)

. * Update variables so row for when zero and row for when updated - if not upd
> ated whole time will be zero 
. gen start = date("01/03/2020", "DMY") if newv==0
(243 missing values generated)

. replace start = severe_disease_fu_date_update if newv==1
(243 real changes made)

. gen stop = severe_disease_fu_date_update if newv==0
(1,908 missing values generated)

. replace stop = end_date if stop==.
(1,908 real changes made)

. replace severe_disease=0 if newv==0 & severe_disease_bl==0
(243 real changes made)

. replace severe_disease=1 if newv==0 & severe_disease_bl==1
(500 real changes made)

. save ./output/tv_severe_disease_check, replace
(note: file ./output/tv_severe_disease_check.dta not found)
file ./output/tv_severe_disease_check.dta saved

. keep patient_id severe_disease start stop

. * Check data 
. count if start==stop
  13

. * drop start==stop but should not drop any in real data 
. drop if start==stop 
(13 observations deleted)

. count if stop<start
  0

. save ./output/tv_severe_disease, replace
(note: file ./output/tv_severe_disease.dta not found)
file ./output/tv_severe_disease.dta saved

. restore

. 
. * Merge files together 
. use ./output/tv_severe_disease, clear 

. tvc_merge start stop using ./output/tv_covid_vacc, id(patient_id)

. tvc_merge start stop using ./output/tv_liver_transplant, id(patient_id)

. tvc_merge start stop using ./output/time_varying_udca_120, id(patient_id)

. save ./output/tv_vars, replace 
(note: file ./output/tv_vars.dta not found)
file ./output/tv_vars.dta saved

. 
. use `tempfile', clear 

. ** Need to prepare data for analysis and then merge on time-varying covariate
> s 
. 
. log close 
      name:  <unnamed>
       log:  /workspace/logs/time_varying.log
  log type:  text
 closed on:  29 Jun 2023, 14:56:46
-------------------------------------------------------------------------------
