
. 
. tempfile tempfile 

. import delimited using ./output/input_pbc.csv
(109 vars, 1,000 obs)

. describe

Contains data
  obs:         1,000                          
 vars:           109                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
dereg_date      str10   %10s                  
has_pbc_date    int     %8.0g                 
has_psc_date    int     %8.0g                 
fu_liver_tran~d str10   %10s                  
fu_liver_tran~s str10   %10s                  
udca_last_date  str10   %10s                  
udca_first_af~r str10   %10s                  
udca_first_hi~y str10   %10s                  
covid_va~t_date str10   %10s                  
covid_vacc_se~e str10   %10s                  
covid_vacc_th~e str10   %10s                  
covid_vacc_fo~e str10   %10s                  
covid_~fth_date str10   %10s                  
date_most_rec~c str10   %10s                  
severe_disea~ed str10   %10s                  
severe_disea~cd str10   %10s                  
solid_organ_t~m str10   %10s                  solid_organ_transplant_nhsd_snome
                                                > d
solid_organ_n~w str10   %10s                  
solid_organ_t~s byte    %8.0g                 solid_organ_transplant_nhsd_opcs4
transplant_al~4 byte    %8.0g                 
transplant_th~4 str10   %10s                  
transplant_co~p byte    %8.0g                 transplant_conjunctiva_y_code_opc
                                                > s4
transplant_co~4 str10   %10s                  
transplant_st~4 str10   %10s                  
transplant_il.. byte    %8.0g                 transplant_ileum_1_Y_codes_opcs4
transplant_il.. byte    %8.0g                 transplant_ileum_2_Y_codes_opcs4
transpl~1_opcs4 str10   %10s                  
transpl~2_opcs4 str10   %10s                  
hosp_covid_pr~y str10   %10s                  
hosp_covid_any  str10   %10s                  
died_date_ons   str10   %10s                  
age             byte    %8.0g                 
sex             str1    %9s                   
stp             str4    %9s                   
region_nhs      str24   %24s                  
has_msoa        byte    %8.0g                 
imd             byte    %8.0g                 
eth             byte    %8.0g                 
ethnicity_sus   byte    %8.0g                 
ethnicity       byte    %8.0g                 
smoking_status  str1    %9s                   
bmi             float   %9.0g                 
has_pbc         byte    %8.0g                 
has_psc         byte    %8.0g                 
liver_transpl~l byte    %8.0g                 
udca_count_bl   byte    %8.0g                 
udca_count_fu   byte    %8.0g                 
oca_bl          byte    %8.0g                 
budesonide_co~u byte    %8.0g                 
budesonide_co~l byte    %8.0g                 
fenofibrate_c~u byte    %8.0g                 
fenofibrate_c~l byte    %8.0g                 
gc_count_fu     byte    %8.0g                 
gc_count_bl     byte    %8.0g                 
rituximab_bl    byte    %8.0g                 
severe_diseas~l byte    %8.0g                 
learning_disa~d byte    %8.0g                 
cancer_opensa~d byte    %8.0g                 
cancer_opensa~w byte    %8.0g                 
cancer_opensa~r byte    %8.0g                 
haematopoieti~d byte    %8.0g                 
haematopoiet~10 byte    %8.0g                 
haematopoieti~4 byte    %8.0g                 
haematologica~m byte    %8.0g                 haematological_malignancies_snome
                                                > d
haematologica~1 byte    %8.0g                 haematological_malignancies_icd10
sickle_cell_d~d byte    %8.0g                 
sickle_cell_~10 byte    %8.0g                 
haematopoieti~_ byte    %8.0g                 haematopoietic_stem_cell_snomed_e
                                                > ver
haematopoie~0_e byte    %8.0g                 haematopoietic_stem_cell_icd10_ev
                                                > er
haematopoie~4_e byte    %8.0g                 haematopoietic_stem_cell_opcs4_ev
                                                > er
v71             byte    %8.0g                 haematological_malignancies_snome
                                                > d_ever
v72             byte    %8.0g                 haematological_malignancies_icd10
                                                > _ever
ckd_stage_5_~ed byte    %8.0g                 
ckd_stage_5_~10 byte    %8.0g                 
immunosuppres~d byte    %8.0g                 
oral_steroid_~d byte    %8.0g                 
oral_s~3m_count byte    %8.0g                 
oral_s~2m_count byte    %8.0g                 
immunosuppres~r byte    %8.0g                 
oral_steroid_~r byte    %8.0g                 
immunosupress~d byte    %8.0g                 
immunosupress~w byte    %8.0g                 
hiv_aids_nhsd~d byte    %8.0g                 
hiv_aids_nhs~10 byte    %8.0g                 
multiple_scl~ed byte    %8.0g                 
multiple_scl~10 byte    %8.0g                 
motor_neurone~e byte    %8.0g                 motor_neurone_disease_nhsd_snomed
motor_neuron~10 byte    %8.0g                 
myasthenia_g~ed byte    %8.0g                 
myasthenia_g~10 byte    %8.0g                 
huntingtons_~ed byte    %8.0g                 
huntingtons_~10 byte    %8.0g                 
died_ons_live~y byte    %8.0g                 
died_ons_live~g byte    %8.0g                 
died_ons_covi~y byte    %8.0g                 
died_ons_covi~g byte    %8.0g                 
liver_transpl~e str10   %10s                  
severe_diseas~e str10   %10s                  
haematologica~d byte    %8.0g                 
haematologica~r byte    %8.0g                 
ckd_stage_5_~sd byte    %8.0g                 
hiv_aids_nhsd   byte    %8.0g                 
solid_organ_t~d str10   %10s                  
solid_organ_t~w str10   %10s                  
multiple_scl~sd byte    %8.0g                 
motor_neurone~d byte    %8.0g                 
myasthenia_g~sd byte    %8.0g                 
huntingtons_~sd byte    %8.0g                 
patient_id      int     %8.0g                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. save `tempfile' 
file /tmp/St00015.000001 saved

. 
. /* Time-varying covariates are assessed 6-monthly and at time of exposure swi
> tching.
> As disease severity, covid vaccination and liver transplant will only switch 
> once need to identify
> nearest date after date identified in study definition */ 
. * 120 day file: primary exposure definition 
. use ./output/time_varying_udca_120, clear 

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [0,9995]                     units:  1
         unique values:  1,896                    missing .:  0/2,895

                  mean:   4979.64
              std. dev:   2881.38

           percentiles:        10%       25%       50%       75%       90%
                              1028      2509      4977      7487      8952

. merge m:1 patient_id using `tempfile', keepusing(severe_disease_fu_date sever
> e_disease_bl covid_vacc_first_date liver_transplant_fu_date dereg_date died_d
> ate_ons)

    Result                           # of obs.
    -----------------------------------------
    not matched                         3,398
        from master                     2,596  (_merge==1)
        from using                        802  (_merge==2)

    matched                               299  (_merge==3)
    -----------------------------------------

. * Should only be required for dummy data 
. keep if _merge==3
(3,398 observations deleted)

. * Only using start date as this is when udca exposure or 6 monthly check occu
> rs
. drop stop

. * Add in rows with each of the 6 monthly assessment dates 
. gen expand=1

. bys patient_id (start): replace expand=6 if _n==_N 
(198 real changes made)

. expand expand, generate(newv)
(990 observations created)

. bys patient_id newv: gen number = _n 

. replace start = date("01/09/2020", "DMY") if newv==1 & number==1
(198 real changes made)

. replace start = date("01/03/2021", "DMY") if newv==1 & number==2
(198 real changes made)

. replace start = date("01/09/2021", "DMY") if newv==1 & number==3
(198 real changes made)

. replace start = date("01/03/2022", "DMY") if newv==1 & number==4
(198 real changes made)

. replace start = date("01/09/2022", "DMY") if newv==1 & number==5
(198 real changes made)

. 
. * This gives a file where start dates are either exposure switching or 6-mont
> ly assessment dates 
. * These will be used to determine the closest date to time-varying covariate 
> dates identified in study definition 
. sort patient_id start 

. drop newv

. 
. * Determine end of follow-up date
. gen dereg_dateA = date(dereg_date, "YMD")
(620 missing values generated)

. format %dD/N/CY dereg_dateA

. drop dereg_date

. gen died_dateA = date(died_date_ons, "YMD")
(619 missing values generated)

. format %dD/N/CY died_dateA

. drop died_date_ons

. gen end_study = date("31/12/2022", "DMY")

. egen end_date = rowmin(dereg_dateA end_study died_dateA)

. 
. * Take out assessments after end_date 
. drop if start>end_date
(373 observations deleted)

. 
. * Determine number of days between each covariate and dates of UDCA change or
>  6 monthly check date 
. bys patient_id (start): egen last_assess = max(start)

. * Format dates  and identify date nearest after covariate updates 
. foreach var in covid_vacc_first_date severe_disease_fu_date liver_transplant_
> fu_date {
  2.     gen `var'A = date(`var', "YMD")
  3.     format `var'A %dD/N/CY 
  4.     drop `var'
  5.     * time between date of record and change in covariate - positive value
> s are those where record starts after 
.     * covariate change date 
.     gen time_`var' = start - `var'A
  6.     * Set time variable for records prior to change as missing
.     replace time_`var'=. if time_`var'<0
  7.     * Check if any are on index date (1st March) potentially severe diseas
> e - not others
.     di "Number where time-varying update same as assessment date"
  8.     count if time_`var'==0
  9.     di "Number where time-varying update is 1st March 2020"
 10.     count if `var'A==date("01/03/2020", "DMY")
 11.     * Find earliest start date after covariate update
.     * Note: there are some changes that occur after the last available 6 mont
> h assessment or exposure change
.     bys patient_id (time_`var'): gen `var'_updateN = start[1] if `var'A!=. & 
> time_`var'!=.
 12.     * Spread to all rows for patient 
.     bys patient_id: egen `var'_update = max(`var'_updateN)
 13.     format `var'_update %dD/N/CY 
 14.     di "Number where new variable is prior to original variable (should be
>  0)"
 15.     count if `var'_update < `var'A
 16.     di "Number where time varying update is after last assessment date"
 17.     count if `var'A > last_assess & `var'A!=.  & last_assess==start
 18.     di "Number of time-varying changes originally" 
 19.     * Using last_assess==start to count patients rather than rows
.     count if `var'A!=. & last_assess==start 
 20.     di "Number of dates for time-varying update"
 21.     count if `var'_update!=. & last_assess==start & `var'A!=.
 22. }
(79 missing values generated)
(79 missing values generated)
(669 real changes made, 669 to missing)
Number where time-varying update same as assessment date
  0
Number where time-varying update is 1st March 2020
  0
(748 missing values generated)
(404 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  98
Number of time-varying changes originally
  183
Number of dates for time-varying update
  85
(252 missing values generated)
(252 missing values generated)
(465 real changes made, 465 to missing)
Number where time-varying update same as assessment date
  0
Number where time-varying update is 1st March 2020
  0
(717 missing values generated)
(498 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  67
Number of time-varying changes originally
  140
Number of dates for time-varying update
  73
(898 missing values generated)
(898 missing values generated)
(11 real changes made, 11 to missing)
Number where time-varying update same as assessment date
  0
Number where time-varying update is 1st March 2020
  0
(909 missing values generated)
(907 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  2
Number of time-varying changes originally
  4
Number of dates for time-varying update
  2

. * For severe disease only update variable if no severe disease at baseline 
. count if severe_disease_fu_date_update==date("01/03/2020", "DMY") & severe_di
> sease_bl!=1 
  0

. tab severe_disease_bl

severe_dise |
     ase_bl |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        451       49.24       49.24
          1 |        465       50.76      100.00
------------+-----------------------------------
      Total |        916      100.00

. replace severe_disease_fu_date_update = . if severe_disease_bl==1
(198 real changes made, 198 to missing)

. 
. * Keep only change dates to create time-varying dataset
. keep patient_id covid_vacc_first_date_update severe_disease_fu_date_update li
> ver_transplant_fu_date_update severe_disease_bl end_date

. * Chercking number of patient_id's 
. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [4,9951]                     units:  1
         unique values:  198                      missing .:  0/916

                  mean:   5198.15
              std. dev:   3054.21

           percentiles:        10%       25%       50%       75%       90%
                               807    2464.5      5730      7852      9167

. duplicates drop 

Duplicates in terms of all variables

(718 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [4,9951]                     units:  1
         unique values:  198                      missing .:  0/198

                  mean:   5259.83
              std. dev:   2996.06

           percentiles:        10%       25%       50%       75%       90%
                               896      2539    5784.5      7833      9106

. count
  198

. * Create file for each covariate to merge onto udca exposure file 
. * First covid vaccination and liver transplant as all people will begin at ze
> ro 
. rename liver_transplant_fu_date_update liver_trans_date_update

. foreach var in covid_vacc_first liver_trans {
  2.     preserve
  3.     keep patient_id `var'_date_update end_date
  4.     * Drop updates after the end of follow-up 
.     count if `var'_date>=end_date 
  5.     replace `var'_date = . if `var'_date>=end_date 
  6.     * Flag if variable is updated
.     gen `var'=(`var'_date_update!=.)
  7.     * Create extra row if variable is updated 
.     gen expand = `var'+1
  8.     tab expand
  9.     expand expand, gen(newv)
 10.     * Update variables so row for when zero and row for when updated - if 
> not updated whole time will be zero 
.     gen start = date("01/03/2020", "DMY") if newv==0
 11.     replace start = `var'_date_update if newv==1
 12.     gen stop = `var'_date_update if newv==0
 13.     replace stop = end_date if stop==.
 14.     replace `var'=0 if newv==0
 15.     save ./output/tv_`var'_check, replace
 16.     keep patient_id `var' start stop
 17.     * Check data 
.     count if start==stop 
 18.     * drop where start is same as stop - should not drop any in real data 
.     drop if start==stop 
 19.     count if stop<start
 20.     codebook patient_id
 21.     save ./output/tv_`var', replace
 22.     restore
 23. }
  113
(0 real changes made)

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        113       57.07       57.07
          2 |         85       42.93      100.00
------------+-----------------------------------
      Total |        198      100.00
(85 observations created)
(85 missing values generated)
(85 real changes made)
(198 missing values generated)
(198 real changes made)
(85 real changes made)
(note: file ./output/tv_covid_vacc_first_check.dta not found)
file ./output/tv_covid_vacc_first_check.dta saved
  0
(0 observations deleted)
  0

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [4,9951]                     units:  1
         unique values:  198                      missing .:  0/283

                  mean:   5260.98
              std. dev:   3047.42

           percentiles:        10%       25%       50%       75%       90%
                               876      2513      5966      7875      9167
(note: file ./output/tv_covid_vacc_first.dta not found)
file ./output/tv_covid_vacc_first.dta saved
  196
(0 real changes made)

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        196       98.99       98.99
          2 |          2        1.01      100.00
------------+-----------------------------------
      Total |        198      100.00
(2 observations created)
(2 missing values generated)
(2 real changes made)
(198 missing values generated)
(198 real changes made)
(2 real changes made)
(note: file ./output/tv_liver_trans_check.dta not found)
file ./output/tv_liver_trans_check.dta saved
  0
(0 observations deleted)
  0

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [4,9951]                     units:  1
         unique values:  198                      missing .:  0/200

                  mean:   5273.45
              std. dev:   2996.96

           percentiles:        10%       25%       50%       75%       90%
                               907      2561    5784.5      7852    9136.5
(note: file ./output/tv_liver_trans.dta not found)
file ./output/tv_liver_trans.dta saved

. 
. * Same for liver disease severity, but variable can start at 1 and remain for
>  whole of follow-up 
. preserve

. keep patient_id severe_disease_fu_date_update end_date severe_disease_bl

. * Drop updates after the end of follow-up 
. replace severe_disease_fu_date_update=. if severe_disease_fu_date_update>=end
> _date 
(0 real changes made)

. * Flag if variable is updated
. gen severe_disease=(severe_disease_fu_date_update!=.)

. tab severe_disease 

severe_dise |
        ase |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        158       79.80       79.80
          1 |         40       20.20      100.00
------------+-----------------------------------
      Total |        198      100.00

. replace severe_disease = 0 if severe_disease_bl==1
(0 real changes made)

. * Create extra row if variable is updated 
. gen expand = severe_disease + 1

. tab expand

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        158       79.80       79.80
          2 |         40       20.20      100.00
------------+-----------------------------------
      Total |        198      100.00

. expand expand, gen(newv)
(40 observations created)

. tab newv

       newv |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        198       83.19       83.19
          1 |         40       16.81      100.00
------------+-----------------------------------
      Total |        238      100.00

. * Update variables so row for when zero and row for when updated - if not upd
> ated whole time will be zero 
. gen start = date("01/03/2020", "DMY") if newv==0
(40 missing values generated)

. replace start = severe_disease_fu_date_update if newv==1
(40 real changes made)

. gen stop = severe_disease_fu_date_update if newv==0 & severe_disease==1
(198 missing values generated)

. count if stop!=.
  40

. replace stop = end_date if stop==. 
(198 real changes made)

. count if stop==.
  0

. replace severe_disease=0 if newv==0 & severe_disease_bl==0
(40 real changes made)

. replace severe_disease=1 if newv==0 & severe_disease_bl==1
(96 real changes made)

. save ./output/tv_severe_disease_check, replace
(note: file ./output/tv_severe_disease_check.dta not found)
file ./output/tv_severe_disease_check.dta saved

. keep patient_id severe_disease start stop

. * Check data 
. count if start==stop
  0

. * drop if start is same as stop - should not drop any in real data 
. drop if start==stop 
(0 observations deleted)

. count if stop<start
  0

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [4,9951]                     units:  1
         unique values:  198                      missing .:  0/238

                  mean:   5180.92
              std. dev:   3025.56

           percentiles:        10%       25%       50%       75%       90%
                               817      2416      5649      7871      8983

. save ./output/tv_severe_disease, replace
(note: file ./output/tv_severe_disease.dta not found)
file ./output/tv_severe_disease.dta saved

. restore

. 
. * Make age time-varying i.e. updating on 1st January each year
. use `tempfile', clear 

. * Determine end of follow-up date
. gen dereg_dateA = date(dereg_date, "YMD")
(500 missing values generated)

. format %dD/N/CY dereg_dateA

. drop dereg_date

. gen died_dateA = date(died_date_ons, "YMD")
(500 missing values generated)

. format %dD/N/CY died_dateA

. drop died_date_ons

. * Determine end of follow-up then add rows to update age for each year of fol
> low-up
. gen end_study = date("31/12/2022", "DMY")

. egen end_date = rowmin(dereg_dateA end_study died_dateA)

. keep patient_id age end_date

. gen yr_end = year(end_date)

. * Add rows to update age
. gen expand = 3 if yr_end==2022
(447 missing values generated)

. replace expand = 2 if yr_end==2021
(222 real changes made)

. replace expand = 1 if yr_end==2020
(225 real changes made)

. tab expand, m

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        225       22.50       22.50
          2 |        222       22.20       44.70
          3 |        553       55.30      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. expand expand, gen(newv)
(1,328 observations created)

. tab newv, nolabel

       newv |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,000       42.96       42.96
          1 |      1,328       57.04      100.00
------------+-----------------------------------
      Total |      2,328      100.00

. bys patient_id newv: gen number = _n 

. tab newv number, nolabel

           |        number
      newv |         1          2 |     Total
-----------+----------------------+----------
         0 |     1,000          0 |     1,000 
         1 |       775        553 |     1,328 
-----------+----------------------+----------
     Total |     1,775        553 |     2,328 

. gen start = date("01/03/2020", "DMY") if newv==0
(1,328 missing values generated)

. replace start = date("01/01/2021", "DMY") if newv==1 & number==1
(775 real changes made)

. replace start = date("01/01/2022", "DMY") if newv==1 & number==2
(553 real changes made)

. gen stop = date("01/01/2021", "DMY") if newv==0 
(1,328 missing values generated)

. replace stop = end_date if newv==0 & end_date<stop 
(225 real changes made)

. replace stop = date("01/01/2022", "DMY") if newv==1 & number==1 
(775 real changes made)

. replace stop = end_date if newv==1 & number==1 & end_date<stop
(222 real changes made)

. replace stop = date("31/12/2022", "DMY") if newv==1 & number==2 
(553 real changes made)

. replace stop = end_date if newv==1 & number==2 & end_date<stop
(178 real changes made)

. gen age_tv = age if newv==0
(1,328 missing values generated)

. replace age_tv = age+1 if newv==1 & number==1
(775 real changes made)

. replace age_tv = age+2 if newv==1 & number==2
(553 real changes made)

. keep patient_id start stop age_tv 

. drop if start==stop
(1 observation deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [3,9993]                     units:  1
         unique values:  1,000                    missing .:  0/2,327

                  mean:    4881.8
              std. dev:   2897.11

           percentiles:        10%       25%       50%       75%       90%
                               876      2319      4884      7295      8930

. save ./output/tv_age, replace 
(note: file ./output/tv_age.dta not found)
file ./output/tv_age.dta saved

. 
. * COVID waves 
. use `tempfile', clear

. * Determine end of follow-up date
. gen dereg_dateA = date(dereg_date, "YMD")
(500 missing values generated)

. format %dD/N/CY dereg_dateA

. drop dereg_date

. gen died_date_onsA = date(died_date_ons, "YMD")
(500 missing values generated)

. format %dD/N/CY died_date_onsA

. drop died_date_ons

. * Determine end of follow-up then add rows to update waves 
. gen end_study = date("31/12/2022", "DMY")

. egen end_date = rowmin(dereg_dateA end_study died_date_onsA)

. gen expand = 1 if end_date <= date("31/08/2020", "DMY")
(856 missing values generated)

. replace expand = 2 if end_date <= date("30/06/2021", "DMY") & expand==.
(207 real changes made)

. replace expand = 3 if end_date <= date("30/11/2021", "DMY") & expand==.
(83 real changes made)

. replace expand = 4 if end_date <= date("31/12/2022", "DMY") & expand==.
(566 real changes made)

. tab expand 

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        144       14.40       14.40
          2 |        207       20.70       35.10
          3 |         83        8.30       43.40
          4 |        566       56.60      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. keep patient_id expand end_date

. expand expand, gen(newv) 
(2,071 observations created)

. tab newv 

       newv |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,000       32.56       32.56
          1 |      2,071       67.44      100.00
------------+-----------------------------------
      Total |      3,071      100.00

. bys patient_id newv: gen number = _n 

. * wave 1 row 
. gen start = date("01/03/2020", "DMY") if newv==0
(2,071 missing values generated)

. gen wave = 1 if newv==0
(2,071 missing values generated)

. gen stop = date("01/09/2020", "DMY") if newv==0 
(2,071 missing values generated)

. replace stop = end_date if end_date<stop & wave==1
(144 real changes made)

. tab expand if stop==end_date & wave==1

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        144       99.31       99.31
          2 |          1        0.69      100.00
------------+-----------------------------------
      Total |        145      100.00

. * wave 2 row
. replace start = date("01/09/2020", "DMY") if newv==1 & number==1
(856 real changes made)

. replace wave = 2 if newv==1 & number==1
(856 real changes made)

. replace stop = date("01/07/2021", "DMY") if newv==1 & number==1
(856 real changes made)

. replace stop = end_date if end_date<stop & wave==2
(207 real changes made)

. * wave 3 row 
. replace start = date("01/07/2021", "DMY") if newv==1 & number==2
(649 real changes made)

. replace wave = 3 if newv==1 & number==2
(649 real changes made)

. replace stop = date("01/12/2021", "DMY") if newv==1 & number==2
(649 real changes made)

. replace stop = end_date if end_date<stop & wave==3
(83 real changes made)

. * wave 4 row 
. replace start = date("01/12/2021", "DMY") if newv==1 & number==3
(566 real changes made)

. replace wave = 4 if newv==1 & number==3
(566 real changes made)

. replace stop = date("31/12/2022", "DMY") if newv==1 & number==3
(566 real changes made)

. replace stop = end_date if end_date<stop & wave==4
(191 real changes made)

. keep patient_id start stop wave

. drop if start==stop 
(2 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [3,9993]                     units:  1
         unique values:  1,000                    missing .:  0/3,069

                  mean:   4861.37
              std. dev:   2895.62

           percentiles:        10%       25%       50%       75%       90%
                               876      2300      4866      7286      8930

. save ./output/tv_waves, replace
(note: file ./output/tv_waves.dta not found)
file ./output/tv_waves.dta saved

. 
. * Create files for outcomes
. use `tempfile', clear

. * Determine end of follow-up date
. foreach var in died_date_ons hosp_covid_primary hosp_covid_any dereg_date {
  2.     gen `var'A = date(`var', "YMD")
  3.     format `var'A %dD/N/CY
  4.     drop `var'
  5.     gen yr_`var' = year(`var'A)
  6.     tab yr_`var'
  7.     replace `var'A=. if yr_`var'==2023
  8. }
(500 missing values generated)
(500 missing values generated)

yr_died_dat |
      e_ons |      Freq.     Percent        Cum.
------------+-----------------------------------
       2020 |        116       23.20       23.20
       2021 |        148       29.60       52.80
       2022 |        134       26.80       79.60
       2023 |        102       20.40      100.00
------------+-----------------------------------
      Total |        500      100.00
(102 real changes made, 102 to missing)
(900 missing values generated)
(900 missing values generated)

yr_hosp_cov |
 id_primary |      Freq.     Percent        Cum.
------------+-----------------------------------
       2020 |         18       18.00       18.00
       2021 |         32       32.00       50.00
       2022 |         36       36.00       86.00
       2023 |         14       14.00      100.00
------------+-----------------------------------
      Total |        100      100.00
(14 real changes made, 14 to missing)
(900 missing values generated)
(900 missing values generated)

yr_hosp_cov |
     id_any |      Freq.     Percent        Cum.
------------+-----------------------------------
       2020 |         24       24.00       24.00
       2021 |         22       22.00       46.00
       2022 |         30       30.00       76.00
       2023 |         24       24.00      100.00
------------+-----------------------------------
      Total |        100      100.00
(24 real changes made, 24 to missing)
(500 missing values generated)
(500 missing values generated)

yr_dereg_da |
         te |      Freq.     Percent        Cum.
------------+-----------------------------------
       2020 |        123       24.60       24.60
       2021 |        133       26.60       51.20
       2022 |        134       26.80       78.00
       2023 |        110       22.00      100.00
------------+-----------------------------------
      Total |        500      100.00
(110 real changes made, 110 to missing)

. gen end_study = date("31/12/2022", "DMY")

. egen end_date = rowmin(dereg_dateA end_study died_date_onsA)

. 
. * Create flag indicating reason for end of follow-up 
. gen end_date_flag = (end_date==dereg_dateA)

. replace end_date_flag = 2 if end_date==died_date_onsA
(323 real changes made)

. replace end_date_flag = 3 if end_date==end_study
(375 real changes made)

. replace died_date_onsA=. if end_date<died_date_onsA
(75 real changes made, 75 to missing)

. replace died_ons_covid_flag_any=0 if end_date<died_date_onsA & died_ons_covid
> _flag_any==1
(335 real changes made)

. replace hosp_covid_anyA=. if end_date<hosp_covid_anyA
(19 real changes made, 19 to missing)

. gen hosp_any_flag = hosp_covid_anyA!=.

. 
. * Composite outcome 
. gen hosp_died_composite = (died_ons_covid_flag_any==1 | hosp_any_flag==1)

. egen hosp_died_dateA = rowmin(died_date_onsA hosp_covid_anyA)
(634 missing values generated)

. replace hosp_died_dateA=. if hosp_died_composite==0
(152 real changes made, 152 to missing)

. 
. * Check how composite is made up 
. tab died_ons_covid_flag_any hosp_any_flag

died_ons_c |
ovid_flag_ |     hosp_any_flag
       any |         0          1 |     Total
-----------+----------------------+----------
         0 |       786         49 |       835 
         1 |       157          8 |       165 
-----------+----------------------+----------
     Total |       943         57 |     1,000 

. di "Number where composite date = death date only"
Number where composite date = death date only

. count if hosp_died_dateA==died_date_onsA & hosp_died_dateA!=. & hosp_died_dat
> eA!=hosp_covid_anyA
  157

. di "Number where composite = hospitalisation date only"
Number where composite = hospitalisation date only

. count if hosp_died_dateA==hosp_covid_anyA & hosp_died_dateA!=. & hosp_died_da
> teA!=died_date_onsA
  57

. di "Number where composite = both death and hospitalisation date 
Number where composite = both death and hospitalisation date

. count if hosp_died_dateA==died_date_onsA & hosp_died_dateA!=. & hosp_died_dat
> eA==hosp_covid_anyA
  0

. 
. * Make file for each outcome: covid death, hospitalisation and composite 
. * Files contain patient ID, start = start study, stop = either end date for p
> atient or date of outcome 
. * and flag for outcome 
. * COVID death - covid code in any position
. preserve 

. keep patient_id end_date died_ons_covid_flag_any died_date_onsA

. gen start = date("01/03/2020", "DMY")

. egen stop = rowmin(died_date_onsA end_date)

. count if died_ons_covid_flag_any ==1 & end_date<died_date_onsA
  0

. replace died_ons_covid_flag_any=0 if end_date<died_date_onsA
(0 real changes made)

. keep patient_id start stop died_ons_covid_flag_any

. rename died_ons_covid_flag_any died_covid_any_flag

. save ./output/tv_outcome_died_covid_any, replace 
(note: file ./output/tv_outcome_died_covid_any.dta not found)
file ./output/tv_outcome_died_covid_any.dta saved

. tab died_covid_any_flag, m

died_covid_ |
   any_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        835       83.50       83.50
          1 |        165       16.50      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [3,9993]                     units:  1
         unique values:  1,000                    missing .:  0/1,000

                  mean:   4933.66
              std. dev:   2892.41

           percentiles:        10%       25%       50%       75%       90%
                             890.5    2414.5      4998    7352.5      8947

. restore 

. 
. * Hospitalisation - covid code in any position
. preserve 

. keep patient_id end_date hosp_any_flag hosp_covid_anyA end_date_flag

. gen start = date("01/03/2020", "DMY")

. egen stop = rowmin(hosp_covid_anyA end_date)

. count if hosp_any_flag ==1 & end_date<hosp_covid_anyA
  0

. tab end_date_flag if hosp_any_flag ==1 & end_date<hosp_covid_anyA
no observations

. replace hosp_any_flag=0 if end_date<hosp_covid_anyA
(0 real changes made)

. keep patient_id start stop hosp_any_flag

. save ./output/tv_outcome_hosp_any, replace 
(note: file ./output/tv_outcome_hosp_any.dta not found)
file ./output/tv_outcome_hosp_any.dta saved

. tab hosp_any_flag, m

hosp_any_fl |
         ag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        943       94.30       94.30
          1 |         57        5.70      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [3,9993]                     units:  1
         unique values:  1,000                    missing .:  0/1,000

                  mean:   4933.66
              std. dev:   2892.41

           percentiles:        10%       25%       50%       75%       90%
                             890.5    2414.5      4998    7352.5      8947

. count
  1,000

. bys patient_id: egen total_hosp = total(hosp_any_flag)

. tab total_hosp

 total_hosp |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        943       94.30       94.30
          1 |         57        5.70      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. restore 

. 
. * Composite 
. preserve 

. keep patient_id hosp_died* end_date

. gen start = date("01/03/2020", "DMY")

. egen stop = rowmin(hosp_died_dateA end_date)

. count if hosp_died_composite==1 & end_date<hosp_died_dateA
  0

. replace hosp_died_composite=0 if end_date<hosp_died_dateA
(0 real changes made)

. keep patient_id start stop hosp_died_composite

. rename hosp_died_composite composite_any_flag

. save ./output/tv_outcome_composite_any, replace 
(note: file ./output/tv_outcome_composite_any.dta not found)
file ./output/tv_outcome_composite_any.dta saved

. tab composite_any_flag, m

composite_a |
    ny_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        786       78.60       78.60
          1 |        214       21.40      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [3,9993]                     units:  1
         unique values:  1,000                    missing .:  0/1,000

                  mean:   4933.66
              std. dev:   2892.41

           percentiles:        10%       25%       50%       75%       90%
                             890.5    2414.5      4998    7352.5      8947

. restore 

. 
. * Merge files together for each outcome
. * Composite  
. use ./output/tv_severe_disease, clear 

. tvc_merge start stop using ./output/tv_covid_vacc_first, id(patient_id)

. tvc_merge start stop using ./output/tv_liver_trans, id(patient_id)

. tvc_merge start stop using ./output/time_varying_udca_120, id(patient_id)

. tvc_merge start stop using ./output/tv_age, id(patient_id)

. tvc_merge start stop using ./output/tv_outcome_composite_any, id(patient_id) 
> failure(composite_any_flag)

. * Dummy drug data includes people not in cohort, so drop these - should not b
> e any in real data 
. drop if age_tv==.
(2,703 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [3,9993]                     units:  1
         unique values:  1,000                    missing .:  0/2,651

                  mean:   4919.39
              std. dev:   2922.46

           percentiles:        10%       25%       50%       75%       90%
                               872      2339      4950      7385      8946

. * Check number of outcomes after merge  - there will be missings for rows aft
> er event
. tab composite_any_flag, m

composite_a |
    ny_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,321       87.55       87.55
          1 |        214        8.07       95.62
          . |        116        4.38      100.00
------------+-----------------------------------
      Total |      2,651      100.00

. missings report

Checking missings in all variables:
2049 observations with missing values

  +--------------------------------+
  |                      # missing |
  |--------------------------------|
  | composite_any_flag         116 |
  |               udca        2031 |
  |        liver_trans        1911 |
  |   covid_vacc_first        1911 |
  |     severe_disease        1911 |
  +--------------------------------+

. drop if composite_any_flag==.
(116 observations deleted)

. save ./output/tv_vars_composite_any, replace 
(note: file ./output/tv_vars_composite_any.dta not found)
file ./output/tv_vars_composite_any.dta saved

. 
. * COVID death - covid code in any position
. use ./output/tv_severe_disease, clear 

. tvc_merge start stop using ./output/tv_covid_vacc_first, id(patient_id)

. tvc_merge start stop using ./output/tv_liver_trans, id(patient_id)

. tvc_merge start stop using ./output/time_varying_udca_120, id(patient_id)

. tvc_merge start stop using ./output/tv_age, id(patient_id)

. tvc_merge start stop using ./output/tv_outcome_died_covid_any, id(patient_id)
>  failure(died_covid_any_flag)

. * Dummy drug data includes people not in cohort, so drop these - should not b
> e any in real data 
. drop if age_tv==.
(2,703 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [3,9993]                     units:  1
         unique values:  1,000                    missing .:  0/2,595

                  mean:      4919
              std. dev:   2923.66

           percentiles:        10%       25%       50%       75%       90%
                               872      2339      4960      7385      8946

. * Check number of outcomes after merge 
. tab died_covid_any_flag, m

died_covid_ |
   any_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,430       93.64       93.64
          1 |        165        6.36      100.00
------------+-----------------------------------
      Total |      2,595      100.00

. missings report

Checking missings in all variables:
1984 observations with missing values

  +------------------------------+
  |                    # missing |
  |------------------------------|
  |             udca        1984 |
  |      liver_trans        1868 |
  | covid_vacc_first        1868 |
  |   severe_disease        1868 |
  +------------------------------+

. save ./output/tv_vars_died_covid_any, replace 
(note: file ./output/tv_vars_died_covid_any.dta not found)
file ./output/tv_vars_died_covid_any.dta saved

. 
. * COVID hospitalisation - covid code in any position
. use ./output/tv_severe_disease, clear 

. tvc_merge start stop using ./output/tv_covid_vacc_first, id(patient_id)

. tvc_merge start stop using ./output/tv_liver_trans, id(patient_id)

. tvc_merge start stop using ./output/time_varying_udca_120, id(patient_id)

. tvc_merge start stop using ./output/tv_age, id(patient_id)

. tvc_merge start stop using ./output/tv_outcome_hosp_any, id(patient_id) failu
> re(hosp_any_flag)

. * Check number of outcomes after merge 
. tab hosp_any_flag, m

hosp_any_fl |
         ag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,478       46.28       46.28
          1 |         57        1.06       47.35
          . |      2,819       52.65      100.00
------------+-----------------------------------
      Total |      5,354      100.00

. bys patient_id: egen total_hosp = total(hosp_any_flag)

. tab total_hosp

 total_hosp |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,113       95.50       95.50
          1 |        241        4.50      100.00
------------+-----------------------------------
      Total |      5,354      100.00

. * Dummy drug data includes people not in cohort, so drop these - should not b
> e any in real data 
. drop if age_tv==.
(2,703 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [3,9993]                     units:  1
         unique values:  1,000                    missing .:  0/2,651

                  mean:   4919.39
              std. dev:   2922.46

           percentiles:        10%       25%       50%       75%       90%
                               872      2339      4950      7385      8946

. * Check number of outcomes after merge - there will be missings for rows afte
> r event
. tab hosp_any_flag, m 

hosp_any_fl |
         ag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,478       93.47       93.47
          1 |         57        2.15       95.62
          . |        116        4.38      100.00
------------+-----------------------------------
      Total |      2,651      100.00

. missings report

Checking missings in all variables:
2049 observations with missing values

  +------------------------------+
  |                    # missing |
  |------------------------------|
  |    hosp_any_flag         116 |
  |             udca        2031 |
  |      liver_trans        1911 |
  | covid_vacc_first        1911 |
  |   severe_disease        1911 |
  +------------------------------+

. drop if hosp_any_flag==.
(116 observations deleted)

. save ./output/tv_vars_hosp_any, replace 
(note: file ./output/tv_vars_hosp_any.dta not found)
file ./output/tv_vars_hosp_any.dta saved

. 
. /* Format file with static covariates: sex, region, covid high risk condition
> s, 
> ethnicity, imd, bmi, smoking. */
. 
. ** Need to decide on second line therapies 
. use `tempfile', clear

. describe 

Contains data from /tmp/St00015.000001
  obs:         1,000                          
 vars:           109                          14 Sep 2023 14:16
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
dereg_date      str10   %10s                  
has_pbc_date    int     %8.0g                 
has_psc_date    int     %8.0g                 
fu_liver_tran~d str10   %10s                  
fu_liver_tran~s str10   %10s                  
udca_last_date  str10   %10s                  
udca_first_af~r str10   %10s                  
udca_first_hi~y str10   %10s                  
covid_va~t_date str10   %10s                  
covid_vacc_se~e str10   %10s                  
covid_vacc_th~e str10   %10s                  
covid_vacc_fo~e str10   %10s                  
covid_~fth_date str10   %10s                  
date_most_rec~c str10   %10s                  
severe_disea~ed str10   %10s                  
severe_disea~cd str10   %10s                  
solid_organ_t~m str10   %10s                  solid_organ_transplant_nhsd_snome
                                                > d
solid_organ_n~w str10   %10s                  
solid_organ_t~s byte    %8.0g                 solid_organ_transplant_nhsd_opcs4
transplant_al~4 byte    %8.0g                 
transplant_th~4 str10   %10s                  
transplant_co~p byte    %8.0g                 transplant_conjunctiva_y_code_opc
                                                > s4
transplant_co~4 str10   %10s                  
transplant_st~4 str10   %10s                  
transplant_il.. byte    %8.0g                 transplant_ileum_1_Y_codes_opcs4
transplant_il.. byte    %8.0g                 transplant_ileum_2_Y_codes_opcs4
transpl~1_opcs4 str10   %10s                  
transpl~2_opcs4 str10   %10s                  
hosp_covid_pr~y str10   %10s                  
hosp_covid_any  str10   %10s                  
died_date_ons   str10   %10s                  
age             byte    %8.0g                 
sex             str1    %9s                   
stp             str4    %9s                   
region_nhs      str24   %24s                  
has_msoa        byte    %8.0g                 
imd             byte    %8.0g                 
eth             byte    %8.0g                 
ethnicity_sus   byte    %8.0g                 
ethnicity       byte    %8.0g                 
smoking_status  str1    %9s                   
bmi             float   %9.0g                 
has_pbc         byte    %8.0g                 
has_psc         byte    %8.0g                 
liver_transpl~l byte    %8.0g                 
udca_count_bl   byte    %8.0g                 
udca_count_fu   byte    %8.0g                 
oca_bl          byte    %8.0g                 
budesonide_co~u byte    %8.0g                 
budesonide_co~l byte    %8.0g                 
fenofibrate_c~u byte    %8.0g                 
fenofibrate_c~l byte    %8.0g                 
gc_count_fu     byte    %8.0g                 
gc_count_bl     byte    %8.0g                 
rituximab_bl    byte    %8.0g                 
severe_diseas~l byte    %8.0g                 
learning_disa~d byte    %8.0g                 
cancer_opensa~d byte    %8.0g                 
cancer_opensa~w byte    %8.0g                 
cancer_opensa~r byte    %8.0g                 
haematopoieti~d byte    %8.0g                 
haematopoiet~10 byte    %8.0g                 
haematopoieti~4 byte    %8.0g                 
haematologica~m byte    %8.0g                 haematological_malignancies_snome
                                                > d
haematologica~1 byte    %8.0g                 haematological_malignancies_icd10
sickle_cell_d~d byte    %8.0g                 
sickle_cell_~10 byte    %8.0g                 
haematopoieti~_ byte    %8.0g                 haematopoietic_stem_cell_snomed_e
                                                > ver
haematopoie~0_e byte    %8.0g                 haematopoietic_stem_cell_icd10_ev
                                                > er
haematopoie~4_e byte    %8.0g                 haematopoietic_stem_cell_opcs4_ev
                                                > er
v71             byte    %8.0g                 haematological_malignancies_snome
                                                > d_ever
v72             byte    %8.0g                 haematological_malignancies_icd10
                                                > _ever
ckd_stage_5_~ed byte    %8.0g                 
ckd_stage_5_~10 byte    %8.0g                 
immunosuppres~d byte    %8.0g                 
oral_steroid_~d byte    %8.0g                 
oral_s~3m_count byte    %8.0g                 
oral_s~2m_count byte    %8.0g                 
immunosuppres~r byte    %8.0g                 
oral_steroid_~r byte    %8.0g                 
immunosupress~d byte    %8.0g                 
immunosupress~w byte    %8.0g                 
hiv_aids_nhsd~d byte    %8.0g                 
hiv_aids_nhs~10 byte    %8.0g                 
multiple_scl~ed byte    %8.0g                 
multiple_scl~10 byte    %8.0g                 
motor_neurone~e byte    %8.0g                 motor_neurone_disease_nhsd_snomed
motor_neuron~10 byte    %8.0g                 
myasthenia_g~ed byte    %8.0g                 
myasthenia_g~10 byte    %8.0g                 
huntingtons_~ed byte    %8.0g                 
huntingtons_~10 byte    %8.0g                 
died_ons_live~y byte    %8.0g                 
died_ons_live~g byte    %8.0g                 
died_ons_covi~y byte    %8.0g                 
died_ons_covi~g byte    %8.0g                 
liver_transpl~e str10   %10s                  
severe_diseas~e str10   %10s                  
haematologica~d byte    %8.0g                 
haematologica~r byte    %8.0g                 
ckd_stage_5_~sd byte    %8.0g                 
hiv_aids_nhsd   byte    %8.0g                 
solid_organ_t~d str10   %10s                  
solid_organ_t~w str10   %10s                  
multiple_scl~sd byte    %8.0g                 
motor_neurone~d byte    %8.0g                 
myasthenia_g~sd byte    %8.0g                 
huntingtons_~sd byte    %8.0g                 
patient_id      int     %8.0g                 
-------------------------------------------------------------------------------
Sorted by: 

. * Format variables 
. * Sex
. gen male = 1 if sex == "M"
(511 missing values generated)

. replace male = 0 if sex == "F"
(502 real changes made)

. * Ethnicity
. replace ethnicity=6 if ethnicity==0
(55 real changes made)

. label define eth5                       1 "White"                            
>            ///
>                             2 "Mixed"                           ///          
>                                    
>                             3 "Asian"                                   ///
>                             4 "Black"                                   ///
>                             5 "Other"                                   ///
>                             6 "Unknown"

.                     
. 
. label values ethnicity eth5

. safetab ethnicity, m
10

  ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |        137       13.70       13.70
      Mixed |        206       20.60       34.30
      Asian |        225       22.50       56.80
      Black |        177       17.70       74.50
      Other |        200       20.00       94.50
    Unknown |         55        5.50      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. * Create White vs non-White ethnicity variable
. gen eth_bin = (ethnicity!=1)

. replace eth_bin = 2 if ethnicity==6
(55 real changes made)

. label define eth_3 0 "White" 1 "Non-White" 2 "Unknown"

. label values eth_bin eth_3

. tab eth_bin ethnicity, m 

           |                       ethnicity
   eth_bin |     White      Mixed      Asian      Black      Other |     Total
-----------+-------------------------------------------------------+----------
     White |       137          0          0          0          0 |       137 
 Non-White |         0        206        225        177        200 |       808 
   Unknown |         0          0          0          0          0 |        55 
-----------+-------------------------------------------------------+----------
     Total |       137        206        225        177        200 |     1,000 


           | ethnicity
   eth_bin |   Unknown |     Total
-----------+-----------+----------
     White |         0 |       137 
 Non-White |         0 |       808 
   Unknown |        55 |        55 
-----------+-----------+----------
     Total |        55 |     1,000 

. 
. 
. * IMD - should not be missing (i.e. 0) in real data
. replace imd=6 if imd==0
(47 real changes made)

. 
. * BMI categories
. * assume BMI's less than 10 are incorrect and set to missing 
. sum bmi, d 

                             bmi
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,000
25%     16.60778              0       Sum of Wgt.       1,000

50%      25.6845                      Mean           22.72443
                        Largest       Std. Dev.      13.42281
75%     32.45396       49.63896
90%      37.5406       50.48814       Variance       180.1718
95%     41.11365       50.64924       Skewness      -.5297416
99%     47.62017       52.83505       Kurtosis       2.287056

. replace bmi = . if bmi<10
(206 real changes made, 206 to missing)

. egen bmi_cat = cut(bmi), at(0, 1, 18.5, 24.9, 29.9, 39.9, 100) icodes
(206 missing values generated)

. bys bmi_cat: sum bmi

-------------------------------------------------------------------------------
-> bmi_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |         82    15.64375    2.288443   10.31201   18.47222

-------------------------------------------------------------------------------
-> bmi_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        189    22.07299    1.754937   18.53326   24.89909

-------------------------------------------------------------------------------
-> bmi_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        195     27.6185     1.43103   24.92195   29.88546

-------------------------------------------------------------------------------
-> bmi_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        264    34.23555    2.686642   29.91033    39.8931

-------------------------------------------------------------------------------
-> bmi_cat = 5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |         64    43.61569    3.053526   39.94916   52.83505

-------------------------------------------------------------------------------
-> bmi_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |          0


. * assume missing . is healthy range BMI
. replace bmi_cat = 2 if bmi_cat==. 
(206 real changes made)

. label define bmi 1 "Underweight" 2 "Healthy range" 3 "Overweight" 4 "Obese" 5
>  "Morbidly obese"

. label values bmi_cat bmi

. tab bmi_cat 

       bmi_cat |      Freq.     Percent        Cum.
---------------+-----------------------------------
   Underweight |         82        8.20        8.20
 Healthy range |        395       39.50       47.70
    Overweight |        195       19.50       67.20
         Obese |        264       26.40       93.60
Morbidly obese |         64        6.40      100.00
---------------+-----------------------------------
         Total |      1,000      100.00

. 
. * Smoking status - assume missings are non-smokers 
. gen smoking = 0 if smoking_status=="N"
(886 missing values generated)

. replace smoking = 1 if smoking_status=="S"
(187 real changes made)

. replace smoking = 2 if smoking_status=="E"
(155 real changes made)

. replace smoking = 1 if smoking==.
(544 real changes made)

. label define smok 1 "Current smoker" 2 "Ex-smoker" 0 "Never smoked" 

. label values smoking smok

. tab smoking 

       smoking |      Freq.     Percent        Cum.
---------------+-----------------------------------
  Never smoked |        114       11.40       11.40
Current smoker |        731       73.10       84.50
     Ex-smoker |        155       15.50      100.00
---------------+-----------------------------------
         Total |      1,000      100.00

. 
. * High risk covid conditions
. replace oral_steroid_drugs_nhsd=. if oral_steroid_drug_nhsd_3m_count < 2 & or
> al_steroid_drug_nhsd_12m_count < 4
(935 real changes made, 935 to missing)

. gen imid_nhsd=max(oral_steroid_drugs_nhsd, immunosuppresant_drugs_nhsd)

. gen rare_neuro_nhsd = max(multiple_sclerosis_nhsd, motor_neurone_disease_nhsd
> , myasthenia_gravis_nhsd, huntingtons_disease_nhsd)

. gen solid_organ_transplant_bin = solid_organ_transplant_nhsd_new!=""

. gen any_high_risk_condition = max(learning_disability_nhsd_snomed, cancer_ope
> nsafely_snomed_new, haematological_disease_nhsd, ///
> ckd_stage_5_nhsd, imid_nhsd, immunosupression_nhsd_new, hiv_aids_nhsd, solid_
> organ_transplant_bin, rare_neuro_nhsd)

. 
. * Time from most recent vaccination on 1st March 2021
. gen date_most_recent_cov_vacA = date(date_most_recent_cov_vac, "YMD")
(961 missing values generated)

. gen time_vacc = date("01Mar2021", "DMY") - date_most_recent_cov_vacA
(961 missing values generated)

. sum time_vacc, d

                          time_vacc
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            2              2
10%            6              4       Obs                  39
25%           17              6       Sum of Wgt.          39

50%           33                      Mean           29.92308
                        Largest       Std. Dev.      17.07473
75%           42             56
90%           56             57       Variance       291.5466
95%           59             59       Skewness       .0906015
99%           61             61       Kurtosis        1.94112

. xtile time_vacc_cat = time_vacc, nq(4)

. bys time_vacc_cat: sum time_vacc 

-------------------------------------------------------------------------------
-> time_vacc_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   time_vacc |         11    10.18182    6.242086          1         17

-------------------------------------------------------------------------------
-> time_vacc_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   time_vacc |         12    25.08333    6.542981         18         33

-------------------------------------------------------------------------------
-> time_vacc_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   time_vacc |          7    40.42857    1.718249         38         42

-------------------------------------------------------------------------------
-> time_vacc_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   time_vacc |          9    52.33333    6.519202         44         61

-------------------------------------------------------------------------------
-> time_vacc_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   time_vacc |          0


. 
. keep patient_id male stp any_high_risk_condition ethnicity imd bmi_cat smokin
> g eth_bin time_vacc_cat has_pbc oca_bl

. tempfile basefile

. save `basefile'
file /tmp/St00015.000008 saved

. foreach var in died_covid_any hosp_any composite_any {
  2.     preserve 
  3.     merge 1:m patient_id using ./output/tv_vars_`var' 
  4.     drop _merge 
  5.     save ./output/an_dataset_`var', replace
  6.     restore
  7. }

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,595  (_merge==3)
    -----------------------------------------
(note: file ./output/an_dataset_died_covid_any.dta not found)
file ./output/an_dataset_died_covid_any.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,535  (_merge==3)
    -----------------------------------------
(note: file ./output/an_dataset_hosp_any.dta not found)
file ./output/an_dataset_hosp_any.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,535  (_merge==3)
    -----------------------------------------
(note: file ./output/an_dataset_composite_any.dta not found)
file ./output/an_dataset_composite_any.dta saved

. 
. *****************************************
. * 90 day file: sensitivity analysis 
. use ./output/time_varying_udca_90, clear 

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [0,9995]                     units:  1
         unique values:  1,896                    missing .:  0/2,895

                  mean:   4979.64
              std. dev:   2881.38

           percentiles:        10%       25%       50%       75%       90%
                              1028      2509      4977      7487      8952

. merge m:1 patient_id using `tempfile', keepusing(severe_disease_fu_date sever
> e_disease_bl covid_vacc_first_date liver_transplant_fu_date dereg_date died_d
> ate_ons)

    Result                           # of obs.
    -----------------------------------------
    not matched                         3,398
        from master                     2,596  (_merge==1)
        from using                        802  (_merge==2)

    matched                               299  (_merge==3)
    -----------------------------------------

. * Should only be required for dummy data 
. keep if _merge==3
(3,398 observations deleted)

. * Only using start date as this is when udca exposure or 6 monthly check occu
> rs
. drop stop

. * Add in rows with each of the 6 monthly assessment dates 
. gen expand=1

. bys patient_id (start): replace expand=6 if _n==_N 
(198 real changes made)

. expand expand, generate(newv)
(990 observations created)

. bys patient_id newv: gen number = _n 

. replace start = date("01/09/2020", "DMY") if newv==1 & number==1
(198 real changes made)

. replace start = date("01/03/2021", "DMY") if newv==1 & number==2
(198 real changes made)

. replace start = date("01/09/2021", "DMY") if newv==1 & number==3
(198 real changes made)

. replace start = date("01/03/2022", "DMY") if newv==1 & number==4
(198 real changes made)

. replace start = date("01/09/2022", "DMY") if newv==1 & number==5
(198 real changes made)

. 
. * This gives a file where start dates are either exposure switching or 6-mont
> ly assessment dates 
. * These will be used to determine the closest date to time-varying covariate 
> dates identified in study definition 
. sort patient_id start 

. drop newv

. 
. * Determine end of follow-up date
. gen dereg_dateA = date(dereg_date, "YMD")
(620 missing values generated)

. format %dD/N/CY dereg_dateA

. drop dereg_date

. gen died_dateA = date(died_date_ons, "YMD")
(619 missing values generated)

. format %dD/N/CY died_dateA

. drop died_date_ons

. gen end_study = date("31/12/2022", "DMY")

. egen end_date = rowmin(dereg_dateA end_study died_dateA)

. 
. * Take out assessments after end_date 
. drop if start>end_date
(373 observations deleted)

. 
. * Determine number of days between each covariate and dates of UDCA change or
>  6 monthly check date 
. bys patient_id (start): egen last_assess = max(start)

. * Format dates  and identify date nearest after covariate updates 
. foreach var in covid_vacc_first_date severe_disease_fu_date liver_transplant_
> fu_date {
  2.     gen `var'A = date(`var', "YMD")
  3.     format `var'A %dD/N/CY 
  4.     drop `var'
  5.     * time between date of record and change in covariate - positive value
> s are those where record starts after 
.     * covariate change date 
.     gen time_`var' = start - `var'A
  6.     * Set time variable for records prior to change as missing
.     replace time_`var'=. if time_`var'<0
  7.     * Check if any are on index date (1st March) potentially severe diseas
> e - not others
.     di "Number where time-varying update same as assessment date"
  8.     count if time_`var'==0
  9.     di "Number where time-varying update is 1st March 2020"
 10.     count if `var'A==date("01/03/2020", "DMY")
 11.     * Find earliest start date after covariate update
.     * Note: there are some changes that occur after the last available 6 mont
> h assessment or exposure change
.     bys patient_id (time_`var'): gen `var'_updateN = start[1] if `var'A!=. & 
> time_`var'!=.
 12.     * Spread to all rows for patient 
.     bys patient_id: egen `var'_update = max(`var'_updateN)
 13.     format `var'_update %dD/N/CY 
 14.     di "Number where new variable is prior to original variable (should be
>  0)"
 15.     count if `var'_update < `var'A
 16.     di "Number where time varying update is after last assessment date"
 17.     count if `var'A > last_assess & `var'A!=.  & last_assess==start
 18.     di "Number of time-varying changes originally" 
 19.     * Using last_assess==start to count patients rather than rows
.     count if `var'A!=. & last_assess==start 
 20.     di "Number of dates for time-varying update"
 21.     count if `var'_update!=. & last_assess==start & `var'A!=.
 22. }
(79 missing values generated)
(79 missing values generated)
(669 real changes made, 669 to missing)
Number where time-varying update same as assessment date
  0
Number where time-varying update is 1st March 2020
  0
(748 missing values generated)
(404 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  98
Number of time-varying changes originally
  183
Number of dates for time-varying update
  85
(252 missing values generated)
(252 missing values generated)
(465 real changes made, 465 to missing)
Number where time-varying update same as assessment date
  0
Number where time-varying update is 1st March 2020
  0
(717 missing values generated)
(498 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  67
Number of time-varying changes originally
  140
Number of dates for time-varying update
  73
(898 missing values generated)
(898 missing values generated)
(11 real changes made, 11 to missing)
Number where time-varying update same as assessment date
  0
Number where time-varying update is 1st March 2020
  0
(909 missing values generated)
(907 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  2
Number of time-varying changes originally
  4
Number of dates for time-varying update
  2

. * For severe disease only update variable if no severe disease at baseline 
. count if severe_disease_fu_date_update==date("01/03/2020", "DMY") & severe_di
> sease_bl!=1 
  0

. tab severe_disease_bl

severe_dise |
     ase_bl |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        451       49.24       49.24
          1 |        465       50.76      100.00
------------+-----------------------------------
      Total |        916      100.00

. replace severe_disease_fu_date_update = . if severe_disease_bl==1
(198 real changes made, 198 to missing)

. 
. * Keep only change dates to create time-varying dataset
. keep patient_id covid_vacc_first_date_update severe_disease_fu_date_update li
> ver_transplant_fu_date_update severe_disease_bl end_date

. * Chercking number of patient_id's 
. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [4,9951]                     units:  1
         unique values:  198                      missing .:  0/916

                  mean:   5198.15
              std. dev:   3054.21

           percentiles:        10%       25%       50%       75%       90%
                               807    2464.5      5730      7852      9167

. duplicates drop 

Duplicates in terms of all variables

(718 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [4,9951]                     units:  1
         unique values:  198                      missing .:  0/198

                  mean:   5259.83
              std. dev:   2996.06

           percentiles:        10%       25%       50%       75%       90%
                               896      2539    5784.5      7833      9106

. count
  198

. * Create file for each covariate to merge onto udca exposure file 
. * First covid vaccination and liver transplant as all people will begin at ze
> ro 
. rename liver_transplant_fu_date_update liver_trans_date_update

. foreach var in covid_vacc_first liver_trans {
  2.     preserve
  3.     keep patient_id `var'_date_update end_date
  4.     * Drop updates after the end of follow-up 
.     count if `var'_date>=end_date 
  5.     replace `var'_date = . if `var'_date>=end_date 
  6.     * Flag if variable is updated
.     gen `var'=(`var'_date_update!=.)
  7.     * Create extra row if variable is updated 
.     gen expand = `var'+1
  8.     tab expand
  9.     expand expand, gen(newv)
 10.     * Update variables so row for when zero and row for when updated - if 
> not updated whole time will be zero 
.     gen start = date("01/03/2020", "DMY") if newv==0
 11.     replace start = `var'_date_update if newv==1
 12.     gen stop = `var'_date_update if newv==0
 13.     replace stop = end_date if stop==.
 14.     replace `var'=0 if newv==0
 15.     save ./output/tv_`var'_check, replace
 16.     keep patient_id `var' start stop
 17.     * Check data 
.     count if start==stop 
 18.     * drop where start is same as stop - should not drop any in real data 
.     drop if start==stop 
 19.     count if stop<start
 20.     codebook patient_id
 21.     save ./output/tv_90_`var', replace
 22.     restore
 23. }
  113
(0 real changes made)

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        113       57.07       57.07
          2 |         85       42.93      100.00
------------+-----------------------------------
      Total |        198      100.00
(85 observations created)
(85 missing values generated)
(85 real changes made)
(198 missing values generated)
(198 real changes made)
(85 real changes made)
file ./output/tv_covid_vacc_first_check.dta saved
  0
(0 observations deleted)
  0

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [4,9951]                     units:  1
         unique values:  198                      missing .:  0/283

                  mean:   5260.98
              std. dev:   3047.42

           percentiles:        10%       25%       50%       75%       90%
                               876      2513      5966      7875      9167
(note: file ./output/tv_90_covid_vacc_first.dta not found)
file ./output/tv_90_covid_vacc_first.dta saved
  196
(0 real changes made)

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        196       98.99       98.99
          2 |          2        1.01      100.00
------------+-----------------------------------
      Total |        198      100.00
(2 observations created)
(2 missing values generated)
(2 real changes made)
(198 missing values generated)
(198 real changes made)
(2 real changes made)
file ./output/tv_liver_trans_check.dta saved
  0
(0 observations deleted)
  0

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [4,9951]                     units:  1
         unique values:  198                      missing .:  0/200

                  mean:   5273.45
              std. dev:   2996.96

           percentiles:        10%       25%       50%       75%       90%
                               907      2561    5784.5      7852    9136.5
(note: file ./output/tv_90_liver_trans.dta not found)
file ./output/tv_90_liver_trans.dta saved

. 
. * Same for liver disease severity, but variable can start at 1 and remain for
>  whole of follow-up 
. preserve

. keep patient_id severe_disease_fu_date_update end_date severe_disease_bl

. * Drop updates after the end of follow-up 
. replace severe_disease_fu_date_update=. if severe_disease_fu_date_update>=end
> _date 
(0 real changes made)

. * Flag if variable is updated
. gen severe_disease=(severe_disease_fu_date_update!=.)

. tab severe_disease 

severe_dise |
        ase |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        158       79.80       79.80
          1 |         40       20.20      100.00
------------+-----------------------------------
      Total |        198      100.00

. replace severe_disease = 0 if severe_disease_bl==1
(0 real changes made)

. * Create extra row if variable is updated 
. gen expand = severe_disease + 1

. tab expand

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        158       79.80       79.80
          2 |         40       20.20      100.00
------------+-----------------------------------
      Total |        198      100.00

. expand expand, gen(newv)
(40 observations created)

. tab newv

       newv |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        198       83.19       83.19
          1 |         40       16.81      100.00
------------+-----------------------------------
      Total |        238      100.00

. * Update variables so row for when zero and row for when updated - if not upd
> ated whole time will be zero 
. gen start = date("01/03/2020", "DMY") if newv==0
(40 missing values generated)

. replace start = severe_disease_fu_date_update if newv==1
(40 real changes made)

. gen stop = severe_disease_fu_date_update if newv==0 & severe_disease==1
(198 missing values generated)

. count if stop!=.
  40

. replace stop = end_date if stop==. 
(198 real changes made)

. count if stop==.
  0

. replace severe_disease=0 if newv==0 & severe_disease_bl==0
(40 real changes made)

. replace severe_disease=1 if newv==0 & severe_disease_bl==1
(96 real changes made)

. save ./output/tv_severe_disease_check, replace
file ./output/tv_severe_disease_check.dta saved

. keep patient_id severe_disease start stop

. * Check data 
. count if start==stop
  0

. * drop if start is same as stop - should not drop any in real data 
. drop if start==stop 
(0 observations deleted)

. count if stop<start
  0

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [4,9951]                     units:  1
         unique values:  198                      missing .:  0/238

                  mean:   5180.92
              std. dev:   3025.56

           percentiles:        10%       25%       50%       75%       90%
                               817      2416      5649      7871      8983

. save ./output/tv_90_severe_disease, replace
(note: file ./output/tv_90_severe_disease.dta not found)
file ./output/tv_90_severe_disease.dta saved

. restore

. 
. * Merge files together for each outcome
. * Composite  
. use ./output/tv_90_severe_disease, clear 

. tvc_merge start stop using ./output/tv_90_covid_vacc_first, id(patient_id)

. tvc_merge start stop using ./output/tv_90_liver_trans, id(patient_id)

. tvc_merge start stop using ./output/time_varying_udca_90, id(patient_id)

. tvc_merge start stop using ./output/tv_age, id(patient_id)

. tvc_merge start stop using ./output/tv_outcome_composite_any, id(patient_id) 
> failure(composite_any_flag)

. * Dummy drug data includes people not in cohort, so drop these - should not b
> e any in real data 
. drop if age_tv==.
(2,703 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [3,9993]                     units:  1
         unique values:  1,000                    missing .:  0/2,651

                  mean:   4919.39
              std. dev:   2922.46

           percentiles:        10%       25%       50%       75%       90%
                               872      2339      4950      7385      8946

. * Check number of outcomes after merge  - there will be missings for rows aft
> er event
. tab composite_any_flag, m

composite_a |
    ny_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,321       87.55       87.55
          1 |        214        8.07       95.62
          . |        116        4.38      100.00
------------+-----------------------------------
      Total |      2,651      100.00

. missings report

Checking missings in all variables:
2049 observations with missing values

  +--------------------------------+
  |                      # missing |
  |--------------------------------|
  | composite_any_flag         116 |
  |               udca        2031 |
  |        liver_trans        1911 |
  |   covid_vacc_first        1911 |
  |     severe_disease        1911 |
  +--------------------------------+

. drop if composite_any_flag==.
(116 observations deleted)

. save ./output/tv_vars_90_composite_any, replace 
(note: file ./output/tv_vars_90_composite_any.dta not found)
file ./output/tv_vars_90_composite_any.dta saved

. 
. * COVID death - covid code in any position
. use ./output/tv_90_severe_disease, clear 

. tvc_merge start stop using ./output/tv_90_covid_vacc_first, id(patient_id)

. tvc_merge start stop using ./output/tv_90_liver_trans, id(patient_id)

. tvc_merge start stop using ./output/time_varying_udca_90, id(patient_id)

. tvc_merge start stop using ./output/tv_age, id(patient_id)

. tvc_merge start stop using ./output/tv_outcome_died_covid_any, id(patient_id)
>  failure(died_covid_any_flag)

. * Dummy drug data includes people not in cohort, so drop these - should not b
> e any in real data 
. drop if age_tv==.
(2,703 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [3,9993]                     units:  1
         unique values:  1,000                    missing .:  0/2,595

                  mean:      4919
              std. dev:   2923.66

           percentiles:        10%       25%       50%       75%       90%
                               872      2339      4960      7385      8946

. * Check number of outcomes after merge 
. tab died_covid_any_flag, m

died_covid_ |
   any_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,430       93.64       93.64
          1 |        165        6.36      100.00
------------+-----------------------------------
      Total |      2,595      100.00

. missings report

Checking missings in all variables:
1984 observations with missing values

  +------------------------------+
  |                    # missing |
  |------------------------------|
  |             udca        1984 |
  |      liver_trans        1868 |
  | covid_vacc_first        1868 |
  |   severe_disease        1868 |
  +------------------------------+

. save ./output/tv_vars_90_died_covid_any, replace 
(note: file ./output/tv_vars_90_died_covid_any.dta not found)
file ./output/tv_vars_90_died_covid_any.dta saved

. 
. * COVID hospitalisation - covid code in any position
. use ./output/tv_90_severe_disease, clear 

. tvc_merge start stop using ./output/tv_90_covid_vacc_first, id(patient_id)

. tvc_merge start stop using ./output/tv_90_liver_trans, id(patient_id)

. tvc_merge start stop using ./output/time_varying_udca_90, id(patient_id)

. tvc_merge start stop using ./output/tv_age, id(patient_id)

. tvc_merge start stop using ./output/tv_outcome_hosp_any, id(patient_id) failu
> re(hosp_any_flag)

. * Check number of outcomes after merge 
. tab hosp_any_flag, m

hosp_any_fl |
         ag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,478       46.28       46.28
          1 |         57        1.06       47.35
          . |      2,819       52.65      100.00
------------+-----------------------------------
      Total |      5,354      100.00

. bys patient_id: egen total_hosp = total(hosp_any_flag)

. tab total_hosp

 total_hosp |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,113       95.50       95.50
          1 |        241        4.50      100.00
------------+-----------------------------------
      Total |      5,354      100.00

. * Dummy drug data includes people not in cohort, so drop these - should not b
> e any in real data 
. drop if age_tv==.
(2,703 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [3,9993]                     units:  1
         unique values:  1,000                    missing .:  0/2,651

                  mean:   4919.39
              std. dev:   2922.46

           percentiles:        10%       25%       50%       75%       90%
                               872      2339      4950      7385      8946

. * Check number of outcomes after merge - there will be missings for rows afte
> r event
. tab hosp_any_flag, m 

hosp_any_fl |
         ag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,478       93.47       93.47
          1 |         57        2.15       95.62
          . |        116        4.38      100.00
------------+-----------------------------------
      Total |      2,651      100.00

. missings report

Checking missings in all variables:
2049 observations with missing values

  +------------------------------+
  |                    # missing |
  |------------------------------|
  |    hosp_any_flag         116 |
  |             udca        2031 |
  |      liver_trans        1911 |
  | covid_vacc_first        1911 |
  |   severe_disease        1911 |
  +------------------------------+

. drop if hosp_any_flag==.
(116 observations deleted)

. save ./output/tv_vars_90_hosp_any, replace 
(note: file ./output/tv_vars_90_hosp_any.dta not found)
file ./output/tv_vars_90_hosp_any.dta saved

. 
. use `basefile', clear

. foreach var in died_covid_any hosp_any composite_any {
  2.     preserve 
  3.     merge 1:m patient_id using ./output/tv_vars_90_`var' 
  4.     drop _merge 
  5.     save ./output/an_dataset_90_`var', replace
  6.     restore
  7. }

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,595  (_merge==3)
    -----------------------------------------
(note: file ./output/an_dataset_90_died_covid_any.dta not found)
file ./output/an_dataset_90_died_covid_any.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,535  (_merge==3)
    -----------------------------------------
(note: file ./output/an_dataset_90_hosp_any.dta not found)
file ./output/an_dataset_90_hosp_any.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,535  (_merge==3)
    -----------------------------------------
(note: file ./output/an_dataset_90_composite_any.dta not found)
file ./output/an_dataset_90_composite_any.dta saved

. 
. *** 120 day overlap file: sensitivity analysis 
. use ./output/time_varying_udca_overlap_120, clear 

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [0,9995]                     units:  1
         unique values:  1,896                    missing .:  0/2,895

                  mean:   4979.64
              std. dev:   2881.38

           percentiles:        10%       25%       50%       75%       90%
                              1028      2509      4977      7487      8952

. merge m:1 patient_id using `tempfile', keepusing(severe_disease_fu_date sever
> e_disease_bl covid_vacc_first_date liver_transplant_fu_date dereg_date died_d
> ate_ons)

    Result                           # of obs.
    -----------------------------------------
    not matched                         3,398
        from master                     2,596  (_merge==1)
        from using                        802  (_merge==2)

    matched                               299  (_merge==3)
    -----------------------------------------

. * Should only be required for dummy data 
. keep if _merge==3
(3,398 observations deleted)

. * Only using start date as this is when udca exposure or 6 monthly check occu
> rs
. drop stop

. * Add in rows with each of the 6 monthly assessment dates 
. gen expand=1

. bys patient_id (start): replace expand=6 if _n==_N 
(198 real changes made)

. expand expand, generate(newv)
(990 observations created)

. bys patient_id newv: gen number = _n 

. replace start = date("01/09/2020", "DMY") if newv==1 & number==1
(198 real changes made)

. replace start = date("01/03/2021", "DMY") if newv==1 & number==2
(198 real changes made)

. replace start = date("01/09/2021", "DMY") if newv==1 & number==3
(198 real changes made)

. replace start = date("01/03/2022", "DMY") if newv==1 & number==4
(198 real changes made)

. replace start = date("01/09/2022", "DMY") if newv==1 & number==5
(198 real changes made)

. 
. * This gives a file where start dates are either exposure switching or 6-mont
> ly assessment dates 
. * These will be used to determine the closest date to time-varying covariate 
> dates identified in study definition 
. sort patient_id start 

. drop newv

. 
. * Determine end of follow-up date
. gen dereg_dateA = date(dereg_date, "YMD")
(620 missing values generated)

. format %dD/N/CY dereg_dateA

. drop dereg_date

. gen died_dateA = date(died_date_ons, "YMD")
(619 missing values generated)

. format %dD/N/CY died_dateA

. drop died_date_ons

. gen end_study = date("31/12/2022", "DMY")

. egen end_date = rowmin(dereg_dateA end_study died_dateA)

. 
. * Take out assessments after end_date 
. drop if start>end_date
(373 observations deleted)

. 
. * Determine number of days between each covariate and dates of UDCA change or
>  6 monthly check date 
. bys patient_id (start): egen last_assess = max(start)

. * Format dates  and identify date nearest after covariate updates 
. foreach var in covid_vacc_first_date severe_disease_fu_date liver_transplant_
> fu_date {
  2.     gen `var'A = date(`var', "YMD")
  3.     format `var'A %dD/N/CY 
  4.     drop `var'
  5.     * time between date of record and change in covariate - positive value
> s are those where record starts after 
.     * covariate change date 
.     gen time_`var' = start - `var'A
  6.     * Set time variable for records prior to change as missing
.     replace time_`var'=. if time_`var'<0
  7.     * Check if any are on index date (1st March) potentially severe diseas
> e - not others
.     di "Number where time-varying update same as assessment date"
  8.     count if time_`var'==0
  9.     di "Number where time-varying update is 1st March 2020"
 10.     count if `var'A==date("01/03/2020", "DMY")
 11.     * Find earliest start date after covariate update
.     * Note: there are some changes that occur after the last available 6 mont
> h assessment or exposure change
.     bys patient_id (time_`var'): gen `var'_updateN = start[1] if `var'A!=. & 
> time_`var'!=.
 12.     * Spread to all rows for patient 
.     bys patient_id: egen `var'_update = max(`var'_updateN)
 13.     format `var'_update %dD/N/CY 
 14.     di "Number where new variable is prior to original variable (should be
>  0)"
 15.     count if `var'_update < `var'A
 16.     di "Number where time varying update is after last assessment date"
 17.     count if `var'A > last_assess & `var'A!=.  & last_assess==start
 18.     di "Number of time-varying changes originally" 
 19.     * Using last_assess==start to count patients rather than rows
.     count if `var'A!=. & last_assess==start 
 20.     di "Number of dates for time-varying update"
 21.     count if `var'_update!=. & last_assess==start & `var'A!=.
 22. }
(79 missing values generated)
(79 missing values generated)
(669 real changes made, 669 to missing)
Number where time-varying update same as assessment date
  0
Number where time-varying update is 1st March 2020
  0
(748 missing values generated)
(404 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  98
Number of time-varying changes originally
  183
Number of dates for time-varying update
  85
(252 missing values generated)
(252 missing values generated)
(465 real changes made, 465 to missing)
Number where time-varying update same as assessment date
  0
Number where time-varying update is 1st March 2020
  0
(717 missing values generated)
(498 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  67
Number of time-varying changes originally
  140
Number of dates for time-varying update
  73
(898 missing values generated)
(898 missing values generated)
(11 real changes made, 11 to missing)
Number where time-varying update same as assessment date
  0
Number where time-varying update is 1st March 2020
  0
(909 missing values generated)
(907 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  2
Number of time-varying changes originally
  4
Number of dates for time-varying update
  2

. * For severe disease only update variable if no severe disease at baseline 
. count if severe_disease_fu_date_update==date("01/03/2020", "DMY") & severe_di
> sease_bl!=1 
  0

. tab severe_disease_bl

severe_dise |
     ase_bl |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        451       49.24       49.24
          1 |        465       50.76      100.00
------------+-----------------------------------
      Total |        916      100.00

. replace severe_disease_fu_date_update = . if severe_disease_bl==1
(198 real changes made, 198 to missing)

. 
. * Keep only change dates to create time-varying dataset
. keep patient_id covid_vacc_first_date_update severe_disease_fu_date_update li
> ver_transplant_fu_date_update severe_disease_bl end_date

. * Chercking number of patient_id's 
. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [4,9951]                     units:  1
         unique values:  198                      missing .:  0/916

                  mean:   5198.15
              std. dev:   3054.21

           percentiles:        10%       25%       50%       75%       90%
                               807    2464.5      5730      7852      9167

. duplicates drop 

Duplicates in terms of all variables

(718 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [4,9951]                     units:  1
         unique values:  198                      missing .:  0/198

                  mean:   5259.83
              std. dev:   2996.06

           percentiles:        10%       25%       50%       75%       90%
                               896      2539    5784.5      7833      9106

. count
  198

. * Create file for each covariate to merge onto udca exposure file 
. * First covid vaccination and liver transplant as all people will begin at ze
> ro 
. rename liver_transplant_fu_date_update liver_trans_date_update

. foreach var in covid_vacc_first liver_trans {
  2.     preserve
  3.     keep patient_id `var'_date_update end_date
  4.     * Drop updates after the end of follow-up 
.     count if `var'_date>=end_date 
  5.     replace `var'_date = . if `var'_date>=end_date 
  6.     * Flag if variable is updated
.     gen `var'=(`var'_date_update!=.)
  7.     * Create extra row if variable is updated 
.     gen expand = `var'+1
  8.     tab expand
  9.     expand expand, gen(newv)
 10.     * Update variables so row for when zero and row for when updated - if 
> not updated whole time will be zero 
.     gen start = date("01/03/2020", "DMY") if newv==0
 11.     replace start = `var'_date_update if newv==1
 12.     gen stop = `var'_date_update if newv==0
 13.     replace stop = end_date if stop==.
 14.     replace `var'=0 if newv==0
 15.     save ./output/tv_`var'_check, replace
 16.     keep patient_id `var' start stop
 17.     * Check data 
.     count if start==stop 
 18.     * drop where start is same as stop - should not drop any in real data 
.     drop if start==stop 
 19.     count if stop<start
 20.     codebook patient_id
 21.     save ./output/tv_overlap_120_`var', replace
 22.     restore
 23. }
  113
(0 real changes made)

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        113       57.07       57.07
          2 |         85       42.93      100.00
------------+-----------------------------------
      Total |        198      100.00
(85 observations created)
(85 missing values generated)
(85 real changes made)
(198 missing values generated)
(198 real changes made)
(85 real changes made)
file ./output/tv_covid_vacc_first_check.dta saved
  0
(0 observations deleted)
  0

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [4,9951]                     units:  1
         unique values:  198                      missing .:  0/283

                  mean:   5260.98
              std. dev:   3047.42

           percentiles:        10%       25%       50%       75%       90%
                               876      2513      5966      7875      9167
(note: file ./output/tv_overlap_120_covid_vacc_first.dta not found)
file ./output/tv_overlap_120_covid_vacc_first.dta saved
  196
(0 real changes made)

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        196       98.99       98.99
          2 |          2        1.01      100.00
------------+-----------------------------------
      Total |        198      100.00
(2 observations created)
(2 missing values generated)
(2 real changes made)
(198 missing values generated)
(198 real changes made)
(2 real changes made)
file ./output/tv_liver_trans_check.dta saved
  0
(0 observations deleted)
  0

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [4,9951]                     units:  1
         unique values:  198                      missing .:  0/200

                  mean:   5273.45
              std. dev:   2996.96

           percentiles:        10%       25%       50%       75%       90%
                               907      2561    5784.5      7852    9136.5
(note: file ./output/tv_overlap_120_liver_trans.dta not found)
file ./output/tv_overlap_120_liver_trans.dta saved

. 
. * Same for liver disease severity, but variable can start at 1 and remain for
>  whole of follow-up 
. preserve

. keep patient_id severe_disease_fu_date_update end_date severe_disease_bl

. * Drop updates after the end of follow-up 
. replace severe_disease_fu_date_update=. if severe_disease_fu_date_update>=end
> _date 
(0 real changes made)

. * Flag if variable is updated
. gen severe_disease=(severe_disease_fu_date_update!=.)

. tab severe_disease 

severe_dise |
        ase |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        158       79.80       79.80
          1 |         40       20.20      100.00
------------+-----------------------------------
      Total |        198      100.00

. replace severe_disease = 0 if severe_disease_bl==1
(0 real changes made)

. * Create extra row if variable is updated 
. gen expand = severe_disease + 1

. tab expand

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        158       79.80       79.80
          2 |         40       20.20      100.00
------------+-----------------------------------
      Total |        198      100.00

. expand expand, gen(newv)
(40 observations created)

. tab newv

       newv |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        198       83.19       83.19
          1 |         40       16.81      100.00
------------+-----------------------------------
      Total |        238      100.00

. * Update variables so row for when zero and row for when updated - if not upd
> ated whole time will be zero 
. gen start = date("01/03/2020", "DMY") if newv==0
(40 missing values generated)

. replace start = severe_disease_fu_date_update if newv==1
(40 real changes made)

. gen stop = severe_disease_fu_date_update if newv==0 & severe_disease==1
(198 missing values generated)

. count if stop!=.
  40

. replace stop = end_date if stop==. 
(198 real changes made)

. count if stop==.
  0

. replace severe_disease=0 if newv==0 & severe_disease_bl==0
(40 real changes made)

. replace severe_disease=1 if newv==0 & severe_disease_bl==1
(96 real changes made)

. save ./output/tv_severe_disease_check, replace
file ./output/tv_severe_disease_check.dta saved

. keep patient_id severe_disease start stop

. * Check data 
. count if start==stop
  0

. * drop if start is same as stop - should not drop any in real data 
. drop if start==stop 
(0 observations deleted)

. count if stop<start
  0

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [4,9951]                     units:  1
         unique values:  198                      missing .:  0/238

                  mean:   5180.92
              std. dev:   3025.56

           percentiles:        10%       25%       50%       75%       90%
                               817      2416      5649      7871      8983

. save ./output/tv_overlap_120_severe_disease, replace
(note: file ./output/tv_overlap_120_severe_disease.dta not found)
file ./output/tv_overlap_120_severe_disease.dta saved

. restore

. 
. * Merge files together for each outcome
. * Composite  
. use ./output/tv_overlap_120_severe_disease, clear 

. tvc_merge start stop using ./output/tv_overlap_120_covid_vacc_first, id(patie
> nt_id)

. tvc_merge start stop using ./output/tv_overlap_120_liver_trans, id(patient_id
> )

. tvc_merge start stop using ./output/time_varying_udca_overlap_120, id(patient
> _id)

. tvc_merge start stop using ./output/tv_age, id(patient_id)

. tvc_merge start stop using ./output/tv_outcome_composite_any, id(patient_id) 
> failure(composite_any_flag)

. * Dummy drug data includes people not in cohort, so drop these - should not b
> e any in real data 
. drop if age_tv==.
(2,703 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [3,9993]                     units:  1
         unique values:  1,000                    missing .:  0/2,651

                  mean:   4919.39
              std. dev:   2922.46

           percentiles:        10%       25%       50%       75%       90%
                               872      2339      4950      7385      8946

. * Check number of outcomes after merge  - there will be missings for rows aft
> er event
. tab composite_any_flag, m

composite_a |
    ny_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,321       87.55       87.55
          1 |        214        8.07       95.62
          . |        116        4.38      100.00
------------+-----------------------------------
      Total |      2,651      100.00

. missings report

Checking missings in all variables:
2049 observations with missing values

  +--------------------------------+
  |                      # missing |
  |--------------------------------|
  | composite_any_flag         116 |
  |               udca        2031 |
  |        liver_trans        1911 |
  |   covid_vacc_first        1911 |
  |     severe_disease        1911 |
  +--------------------------------+

. drop if composite_any_flag==.
(116 observations deleted)

. save ./output/tv_vars_overlap_120_composite_any, replace 
(note: file ./output/tv_vars_overlap_120_composite_any.dta not found)
file ./output/tv_vars_overlap_120_composite_any.dta saved

. 
. * COVID death - covid code in any position
. use ./output/tv_overlap_120_severe_disease, clear 

. tvc_merge start stop using ./output/tv_overlap_120_covid_vacc_first, id(patie
> nt_id)

. tvc_merge start stop using ./output/tv_overlap_120_liver_trans, id(patient_id
> )

. tvc_merge start stop using ./output/time_varying_udca_overlap_120, id(patient
> _id)

. tvc_merge start stop using ./output/tv_age, id(patient_id)

. tvc_merge start stop using ./output/tv_outcome_died_covid_any, id(patient_id)
>  failure(died_covid_any_flag)

. * Dummy drug data includes people not in cohort, so drop these - should not b
> e any in real data 
. drop if age_tv==.
(2,703 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [3,9993]                     units:  1
         unique values:  1,000                    missing .:  0/2,595

                  mean:      4919
              std. dev:   2923.66

           percentiles:        10%       25%       50%       75%       90%
                               872      2339      4960      7385      8946

. * Check number of outcomes after merge 
. tab died_covid_any_flag, m

died_covid_ |
   any_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,430       93.64       93.64
          1 |        165        6.36      100.00
------------+-----------------------------------
      Total |      2,595      100.00

. missings report

Checking missings in all variables:
1984 observations with missing values

  +------------------------------+
  |                    # missing |
  |------------------------------|
  |             udca        1984 |
  |      liver_trans        1868 |
  | covid_vacc_first        1868 |
  |   severe_disease        1868 |
  +------------------------------+

. save ./output/tv_vars_overlap_120_died_covid_any, replace 
(note: file ./output/tv_vars_overlap_120_died_covid_any.dta not found)
file ./output/tv_vars_overlap_120_died_covid_any.dta saved

. 
. * COVID hospitalisation - covid code in any position
. use ./output/tv_overlap_120_severe_disease, clear 

. tvc_merge start stop using ./output/tv_overlap_120_covid_vacc_first, id(patie
> nt_id)

. tvc_merge start stop using ./output/tv_overlap_120_liver_trans, id(patient_id
> )

. tvc_merge start stop using ./output/time_varying_udca_overlap_120, id(patient
> _id)

. tvc_merge start stop using ./output/tv_age, id(patient_id)

. tvc_merge start stop using ./output/tv_outcome_hosp_any, id(patient_id) failu
> re(hosp_any_flag)

. * Check number of outcomes after merge 
. tab hosp_any_flag, m

hosp_any_fl |
         ag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,478       46.28       46.28
          1 |         57        1.06       47.35
          . |      2,819       52.65      100.00
------------+-----------------------------------
      Total |      5,354      100.00

. bys patient_id: egen total_hosp = total(hosp_any_flag)

. tab total_hosp

 total_hosp |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,113       95.50       95.50
          1 |        241        4.50      100.00
------------+-----------------------------------
      Total |      5,354      100.00

. * Dummy drug data includes people not in cohort, so drop these - should not b
> e any in real data 
. drop if age_tv==.
(2,703 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [3,9993]                     units:  1
         unique values:  1,000                    missing .:  0/2,651

                  mean:   4919.39
              std. dev:   2922.46

           percentiles:        10%       25%       50%       75%       90%
                               872      2339      4950      7385      8946

. * Check number of outcomes after merge - there will be missings for rows afte
> r event
. tab hosp_any_flag, m 

hosp_any_fl |
         ag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,478       93.47       93.47
          1 |         57        2.15       95.62
          . |        116        4.38      100.00
------------+-----------------------------------
      Total |      2,651      100.00

. missings report

Checking missings in all variables:
2049 observations with missing values

  +------------------------------+
  |                    # missing |
  |------------------------------|
  |    hosp_any_flag         116 |
  |             udca        2031 |
  |      liver_trans        1911 |
  | covid_vacc_first        1911 |
  |   severe_disease        1911 |
  +------------------------------+

. drop if hosp_any_flag==.
(116 observations deleted)

. save ./output/tv_vars_overlap_120_hosp_any, replace 
(note: file ./output/tv_vars_overlap_120_hosp_any.dta not found)
file ./output/tv_vars_overlap_120_hosp_any.dta saved

. 
. use `basefile', clear

. foreach var in died_covid_any hosp_any composite_any {
  2.     preserve 
  3.     merge 1:m patient_id using ./output/tv_vars_overlap_120_`var' 
  4.     drop _merge 
  5.     save ./output/an_dataset_overlap_120_`var', replace
  6.     restore
  7. }

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,595  (_merge==3)
    -----------------------------------------
(note: file ./output/an_dataset_overlap_120_died_covid_any.dta not found)
file ./output/an_dataset_overlap_120_died_covid_any.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,535  (_merge==3)
    -----------------------------------------
(note: file ./output/an_dataset_overlap_120_hosp_any.dta not found)
file ./output/an_dataset_overlap_120_hosp_any.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,535  (_merge==3)
    -----------------------------------------
(note: file ./output/an_dataset_overlap_120_composite_any.dta not found)
file ./output/an_dataset_overlap_120_composite_any.dta saved

. 
. *** vaccination file: sensitivity analysis 
. ** Creating file where count of vaccinations updates over time
. use ./output/time_varying_udca_120, clear 

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [0,9995]                     units:  1
         unique values:  1,896                    missing .:  0/2,895

                  mean:   4979.64
              std. dev:   2881.38

           percentiles:        10%       25%       50%       75%       90%
                              1028      2509      4977      7487      8952

. merge m:1 patient_id using `tempfile', keepusing(covid_vacc* dereg_date died_
> date_ons)

    Result                           # of obs.
    -----------------------------------------
    not matched                         3,398
        from master                     2,596  (_merge==1)
        from using                        802  (_merge==2)

    matched                               299  (_merge==3)
    -----------------------------------------

. * Should only be required for dummy data 
. keep if _merge==3
(3,398 observations deleted)

. * Only using start date as this is when udca exposure or 6 monthly check occu
> rs
. drop stop

. * Add in rows with each of the 6 monthly assessment dates 
. gen expand=1

. bys patient_id (start): replace expand=6 if _n==_N 
(198 real changes made)

. expand expand, generate(newv)
(990 observations created)

. bys patient_id newv: gen number = _n 

. replace start = date("01/09/2020", "DMY") if newv==1 & number==1
(198 real changes made)

. replace start = date("01/03/2021", "DMY") if newv==1 & number==2
(198 real changes made)

. replace start = date("01/09/2021", "DMY") if newv==1 & number==3
(198 real changes made)

. replace start = date("01/03/2022", "DMY") if newv==1 & number==4
(198 real changes made)

. replace start = date("01/09/2022", "DMY") if newv==1 & number==5
(198 real changes made)

. 
. * This gives a file where start dates are either exposure switching or 6-mont
> ly assessment dates 
. * These will be used to determine the closest date to time-varying covariate 
> dates identified in study definition 
. sort patient_id start 

. drop newv

. 
. * Determine end of follow-up date
. gen dereg_dateA = date(dereg_date, "YMD")
(620 missing values generated)

. format %dD/N/CY dereg_dateA

. drop dereg_date

. gen died_dateA = date(died_date_ons, "YMD")
(619 missing values generated)

. format %dD/N/CY died_dateA

. drop died_date_ons

. gen end_study = date("31/12/2022", "DMY")

. egen end_date = rowmin(dereg_dateA end_study died_dateA)

. 
. * Take out assessments after end_date 
. drop if start>end_date
(373 observations deleted)

. 
. * Determine number of days between each covariate and dates of UDCA change or
>  6 monthly check date 
. bys patient_id (start): egen last_assess = max(start)

. * Format dates  and identify date nearest after covariate updates 
. foreach var in covid_vacc_first_date covid_vacc_second_date covid_vacc_third_
> date covid_vacc_fourth_date covid_vacc_fifth_date {
  2.     gen `var'A = date(`var', "YMD")
  3.     format `var'A %dD/N/CY 
  4.     drop `var'
  5.     * time between date of record and change in covariate - positive value
> s are those where record starts after 
.     * covariate change date 
.     gen time_`var' = start - `var'A
  6.     * Set time variable for records prior to change as missing
.     replace time_`var'=. if time_`var'<0
  7.     * Check if any are on index date (1st March) potentially severe diseas
> e - not others
.     di "Number where time-varying update same as assessment date"
  8.     count if time_`var'==0
  9.     di "Number where time-varying update is 1st March 2020"
 10.     count if `var'A==date("01/03/2020", "DMY")
 11.     * Find earliest start date after covariate update
.     * Note: there are some changes that occur after the last available 6 mont
> h assessment or exposure change
.     bys patient_id (time_`var'): gen `var'_updateN = start[1] if `var'A!=. & 
> time_`var'!=.
 12.     * Spread to all rows for patient 
.     bys patient_id: egen `var'_update = max(`var'_updateN)
 13.     format `var'_update %dD/N/CY 
 14.     di "Number where new variable is prior to original variable (should be
>  0)"
 15.     count if `var'_update < `var'A
 16.     di "Number where time varying update is after last assessment date"
 17.     count if `var'A > last_assess & `var'A!=.  & last_assess==start
 18.     di "Number of time-varying changes originally" 
 19.     * Using last_assess==start to count patients rather than rows
.     count if `var'A!=. & last_assess==start 
 20.     di "Number of dates for time-varying update"
 21.     count if `var'_update!=. & last_assess==start & `var'A!=.
 22. }
(79 missing values generated)
(79 missing values generated)
(669 real changes made, 669 to missing)
Number where time-varying update same as assessment date
  0
Number where time-varying update is 1st March 2020
  0
(748 missing values generated)
(404 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  98
Number of time-varying changes originally
  183
Number of dates for time-varying update
  85
(203 missing values generated)
(203 missing values generated)
(583 real changes made, 583 to missing)
Number where time-varying update same as assessment date
  0
Number where time-varying update is 1st March 2020
  0
(786 missing values generated)
(517 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  93
Number of time-varying changes originally
  159
Number of dates for time-varying update
  66
(818 missing values generated)
(818 missing values generated)
(91 real changes made, 91 to missing)
Number where time-varying update same as assessment date
  0
Number where time-varying update is 1st March 2020
  0
(909 missing values generated)
(878 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  15
Number of time-varying changes originally
  21
Number of dates for time-varying update
  6
(446 missing values generated)
(446 missing values generated)
(5 real changes made, 5 to missing)
Number where time-varying update same as assessment date
  0
Number where time-varying update is 1st March 2020
  0
(451 missing values generated)
(451 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  1
Number of time-varying changes originally
  97
Number of dates for time-varying update
  96
(449 missing values generated)
(449 missing values generated)
(4 real changes made, 4 to missing)
Number where time-varying update same as assessment date
  0
Number where time-varying update is 1st March 2020
  0
(453 missing values generated)
(449 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  0
Number of time-varying changes originally
  97
Number of dates for time-varying update
  97

. 
. * Keep only change dates to create time-varying dataset
. keep patient_id covid_vacc_first_date_update covid_vacc_second_date_update co
> vid_vacc_third_date_update covid_vacc_fourth_date_update covid_vacc_fifth_dat
> e_update end_date

. * Chercking number of patient_id's 
. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [4,9951]                     units:  1
         unique values:  198                      missing .:  0/916

                  mean:   5198.15
              std. dev:   3054.21

           percentiles:        10%       25%       50%       75%       90%
                               807    2464.5      5730      7852      9167

. duplicates drop 

Duplicates in terms of all variables

(718 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [4,9951]                     units:  1
         unique values:  198                      missing .:  0/198

                  mean:   5259.83
              std. dev:   2996.06

           percentiles:        10%       25%       50%       75%       90%
                               896      2539    5784.5      7833      9106

. count
  198

. * Create dataset where rows are updated when person is vaccinated/re-vaccinat
> ed  
. foreach var in covid_vacc_first covid_vacc_second covid_vacc_third covid_vacc
> _fourth covid_vacc_fifth {
  2.     count if `var'_date_update>=end_date 
  3.     replace `var'_date_update = . if `var'_date>=end_date 
  4.     * Create flag for each vaccination date 
.     gen `var'_flag = (`var'_date_update!=.)
  5. }
  113
(0 real changes made)
  132
(0 real changes made)
  192
(0 real changes made)
  102
(0 real changes made)
  101
(0 real changes made)

. * Check not date where prior vaccination is missing 
. count if covid_vacc_first_flag==0 & covid_vacc_second_flag==1
  18

. count if covid_vacc_second_flag==0 & covid_vacc_third_flag==1
  0

. count if covid_vacc_third_flag==0 & covid_vacc_fourth_flag==1
  92

. count if covid_vacc_fourth_flag==0 & covid_vacc_fifth_flag==1
  49

. 
. * Determine total number of vaccinations 
. egen total_vaccs = rowtotal(covid_vacc_first_flag covid_vacc_second_flag covi
> d_vacc_third_flag covid_vacc_fourth_flag covid_vacc_fifth_flag)

. tab total_vaccs

total_vaccs |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         28       14.14       14.14
          1 |         69       34.85       48.99
          2 |         41       20.71       69.70
          3 |         43       21.72       91.41
          4 |         15        7.58       98.99
          5 |          2        1.01      100.00
------------+-----------------------------------
      Total |        198      100.00

. * Create time varying vaccination count variable 
. gen vacc_count_tv = 0

. * expand row up to total number of vaccinations 
. gen expand = total_vaccs + 1

. tab expand 

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         28       14.14       14.14
          2 |         69       34.85       48.99
          3 |         41       20.71       69.70
          4 |         43       21.72       91.41
          5 |         15        7.58       98.99
          6 |          2        1.01      100.00
------------+-----------------------------------
      Total |        198      100.00

. expand expand, gen(newv)
(350 observations created)

. bys patient_id newv: gen number = _n 

. * Update variables so row for when zero and row for each vaccination - if not
>  updated whole time will be zero 
. gen start = date("01/03/2020", "DMY") if newv==0
(350 missing values generated)

. replace start = covid_vacc_first_date_update if newv==1 & number == 1
(85 real changes made)

. gen stop = covid_vacc_first_date_update if newv==0 & covid_vacc_first_date_up
> date!=.
(463 missing values generated)

. replace stop = end_date if stop==. & expand==1
(28 real changes made)

. replace stop = covid_vacc_second_date_update if newv==1 & number==1
(66 real changes made)

. replace vacc_count_tv = 1 if newv==1 & number==1
(170 real changes made)

. * Second vaccination 
. replace start = covid_vacc_second_date_update if newv==1 & number == 2
(60 real changes made)

. replace stop = covid_vacc_third_date_update if newv==1 & number==2 & covid_va
> cc_third_date_update!=.
(6 real changes made)

. replace stop = end_date if newv==1 & number==2 & covid_vacc_third_date_update
> ==.
(95 real changes made)

. replace vacc_count_tv = 2 if newv==1 & number==2
(101 real changes made)

. * Third vaccination 
. replace start = covid_vacc_third_date_update if newv==1 & number == 3
(6 real changes made)

. replace stop = covid_vacc_fourth_date_update if newv==1 & number==3 & covid_v
> acc_fourth_date_update!=.
(46 real changes made)

. replace stop = end_date if newv==1 & number==3 & covid_vacc_fourth_date_updat
> e==.
(14 real changes made)

. replace vacc_count_tv = 3 if newv==1 & number==3
(60 real changes made)

. * Fourth vaccination 
. replace start = covid_vacc_fourth_date_update if newv==1 & number == 4
(16 real changes made)

. replace stop = covid_vacc_fifth_date_update if newv==1 & number==4 & covid_va
> cc_fifth_date_update!=.
(17 real changes made)

. replace stop = end_date if newv==1 & number==4 & covid_vacc_fifth_date_update
> ==.
(0 real changes made)

. replace vacc_count_tv = 4 if newv==1 & number==4
(17 real changes made)

. * Fifth vaccination 
. replace start = covid_vacc_fifth_date_update if newv==1 & number == 5
(2 real changes made)

. replace stop = end_date if newv==1 & number==5
(2 real changes made)

. replace vacc_count_tv = 5 if newv==1 & number==5
(2 real changes made)

. save ./output/tv_120_total_vaccs_check, replace
(note: file ./output/tv_120_total_vaccs_check.dta not found)
file ./output/tv_120_total_vaccs_check.dta saved

. keep patient_id vacc_count_tv start stop

. * Check data 
. count if start==stop 
  101

. * drop where start is same as stop - should not drop any in real data 
. drop if start==stop 
(101 observations deleted)

. count if stop<start
  136

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [4,9951]                     units:  1
         unique values:  198                      missing .:  0/447

                  mean:   5353.93
              std. dev:   3072.14

           percentiles:        10%       25%       50%       75%       90%
                               807      2539      6059      7983      9265

. save ./output/tv_120_total_vaccs, replace
(note: file ./output/tv_120_total_vaccs.dta not found)
file ./output/tv_120_total_vaccs.dta saved

. 
. 
. * Merge files together for each outcome
. * Composite  
. use ./output/tv_severe_disease, clear 

. tvc_merge start stop using ./output/tv_covid_vacc_first, id(patient_id)

. tvc_merge start stop using ./output/tv_120_total_vaccs, id(patient_id)

. tvc_merge start stop using ./output/tv_liver_trans, id(patient_id)

. tvc_merge start stop using ./output/time_varying_udca_120, id(patient_id)

. tvc_merge start stop using ./output/tv_age, id(patient_id)

. tvc_merge start stop using ./output/tv_outcome_composite_any, id(patient_id) 
> failure(composite_any_flag)

. * Dummy drug data includes people not in cohort, so drop these - should not b
> e any in real data 
. drop if age_tv==.
(2,703 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [3,9993]                     units:  1
         unique values:  1,000                    missing .:  0/2,698

                  mean:   4930.98
              std. dev:   2922.43

           percentiles:        10%       25%       50%       75%       90%
                               872      2358      4980      7443      8946

. * Check number of outcomes after merge  - there will be missings for rows aft
> er event
. tab composite_any_flag, m

composite_a |
    ny_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,365       87.66       87.66
          1 |        214        7.93       95.59
          . |        119        4.41      100.00
------------+-----------------------------------
      Total |      2,698      100.00

. missings report

Checking missings in all variables:
2062 observations with missing values

  +--------------------------------+
  |                      # missing |
  |--------------------------------|
  | composite_any_flag         119 |
  |               udca        2042 |
  |        liver_trans        1911 |
  |      vacc_count_tv        1911 |
  |   covid_vacc_first        1911 |
  |--------------------------------|
  |     severe_disease        1911 |
  +--------------------------------+

. drop if composite_any_flag==.
(119 observations deleted)

. save ./output/tv_vars_120_vacc_composite_any, replace 
(note: file ./output/tv_vars_120_vacc_composite_any.dta not found)
file ./output/tv_vars_120_vacc_composite_any.dta saved

. 
. * COVID death - covid code in any position
. use ./output/tv_severe_disease, clear 

. tvc_merge start stop using ./output/tv_covid_vacc_first, id(patient_id)

. tvc_merge start stop using ./output/tv_120_total_vaccs, id(patient_id)

. tvc_merge start stop using ./output/tv_liver_trans, id(patient_id)

. tvc_merge start stop using ./output/time_varying_udca_120, id(patient_id)

. tvc_merge start stop using ./output/tv_age, id(patient_id)

. tvc_merge start stop using ./output/tv_outcome_died_covid_any, id(patient_id)
>  failure(died_covid_any_flag)

. * Dummy drug data includes people not in cohort, so drop these - should not b
> e any in real data 
. drop if age_tv==.
(2,703 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [3,9993]                     units:  1
         unique values:  1,000                    missing .:  0/2,642

                  mean:   4930.84
              std. dev:   2923.61

           percentiles:        10%       25%       50%       75%       90%
                               874      2358      4997      7443      8946

. * Check number of outcomes after merge 
. tab died_covid_any_flag, m

died_covid_ |
   any_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,477       93.75       93.75
          1 |        165        6.25      100.00
------------+-----------------------------------
      Total |      2,642      100.00

. missings report

Checking missings in all variables:
1995 observations with missing values

  +------------------------------+
  |                    # missing |
  |------------------------------|
  |             udca        1995 |
  |      liver_trans        1868 |
  |    vacc_count_tv        1868 |
  | covid_vacc_first        1868 |
  |   severe_disease        1868 |
  +------------------------------+

. save ./output/tv_vars_120_vacc_died_covid_any, replace 
(note: file ./output/tv_vars_120_vacc_died_covid_any.dta not found)
file ./output/tv_vars_120_vacc_died_covid_any.dta saved

. 
. * COVID hospitalisation - covid code in any position
. use ./output/tv_severe_disease, clear 

. tvc_merge start stop using ./output/tv_covid_vacc_first, id(patient_id)

. tvc_merge start stop using ./output/tv_120_total_vaccs, id(patient_id)

. tvc_merge start stop using ./output/tv_liver_trans, id(patient_id)

. tvc_merge start stop using ./output/time_varying_udca_120, id(patient_id)

. tvc_merge start stop using ./output/tv_age, id(patient_id)

. tvc_merge start stop using ./output/tv_outcome_hosp_any, id(patient_id) failu
> re(hosp_any_flag)

. * Check number of outcomes after merge 
. tab hosp_any_flag, m

hosp_any_fl |
         ag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,522       46.70       46.70
          1 |         57        1.06       47.75
          . |      2,822       52.25      100.00
------------+-----------------------------------
      Total |      5,401      100.00

. bys patient_id: egen total_hosp = total(hosp_any_flag)

. tab total_hosp

 total_hosp |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,154       95.43       95.43
          1 |        247        4.57      100.00
------------+-----------------------------------
      Total |      5,401      100.00

. * Dummy drug data includes people not in cohort, so drop these - should not b
> e any in real data 
. drop if age_tv==.
(2,703 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [3,9993]                     units:  1
         unique values:  1,000                    missing .:  0/2,698

                  mean:   4930.98
              std. dev:   2922.43

           percentiles:        10%       25%       50%       75%       90%
                               872      2358      4980      7443      8946

. * Check number of outcomes after merge - there will be missings for rows afte
> r event
. tab hosp_any_flag, m 

hosp_any_fl |
         ag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,522       93.48       93.48
          1 |         57        2.11       95.59
          . |        119        4.41      100.00
------------+-----------------------------------
      Total |      2,698      100.00

. missings report

Checking missings in all variables:
2062 observations with missing values

  +------------------------------+
  |                    # missing |
  |------------------------------|
  |    hosp_any_flag         119 |
  |             udca        2042 |
  |      liver_trans        1911 |
  |    vacc_count_tv        1911 |
  | covid_vacc_first        1911 |
  |------------------------------|
  |   severe_disease        1911 |
  +------------------------------+

. drop if hosp_any_flag==.
(119 observations deleted)

. save ./output/tv_vars_120_vacc_hosp_any, replace 
(note: file ./output/tv_vars_120_vacc_hosp_any.dta not found)
file ./output/tv_vars_120_vacc_hosp_any.dta saved

. 
. use `basefile', clear

. foreach var in died_covid_any hosp_any composite_any {
  2.     preserve 
  3.     merge 1:m patient_id using ./output/tv_vars_120_vacc_`var' 
  4.     drop _merge 
  5.     save ./output/an_dataset_120_vacc_`var', replace
  6.     restore
  7. }

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,642  (_merge==3)
    -----------------------------------------
(note: file ./output/an_dataset_120_vacc_died_covid_any.dta not found)
file ./output/an_dataset_120_vacc_died_covid_any.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,579  (_merge==3)
    -----------------------------------------
(note: file ./output/an_dataset_120_vacc_hosp_any.dta not found)
file ./output/an_dataset_120_vacc_hosp_any.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,579  (_merge==3)
    -----------------------------------------
(note: file ./output/an_dataset_120_vacc_composite_any.dta not found)
file ./output/an_dataset_120_vacc_composite_any.dta saved

. 
. log close 
      name:  <unnamed>
       log:  /workspace/logs/time_varying.log
  log type:  text
 closed on:  14 Sep 2023, 14:18:06
-------------------------------------------------------------------------------
