
. 
. tempfile tempfile 

. import delimited using ./output/input_pbc.csv
(106 vars, 1,000 obs)

. describe

Contains data
  obs:         1,000                          
 vars:           106                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
dereg_date      str10   %10s                  
has_pbc_date    int     %8.0g                 
has_psc_date    int     %8.0g                 
fu_liver_tran~d str10   %10s                  
fu_liver_tran~s str10   %10s                  
udca_last_date  str10   %10s                  
udca_first_af~r str10   %10s                  
udca_first_hi~y str10   %10s                  
covid_va~t_date str10   %10s                  
covid_vacc_se~e str10   %10s                  
covid_vacc_th~e str10   %10s                  
covid_vacc_fo~e str10   %10s                  
covid_~fth_date str10   %10s                  
severe_disea~ed str10   %10s                  
severe_disea~cd str10   %10s                  
solid_organ_t~m str10   %10s                  solid_organ_transplant_nhsd_snome
                                                > d
solid_organ_n~w str10   %10s                  
solid_organ_t~s byte    %8.0g                 solid_organ_transplant_nhsd_opcs4
transplant_al~4 byte    %8.0g                 
transplant_th~4 str10   %10s                  
transplant_co~p byte    %8.0g                 transplant_conjunctiva_y_code_opc
                                                > s4
transplant_co~4 str10   %10s                  
transplant_st~4 str10   %10s                  
transplant_il.. byte    %8.0g                 transplant_ileum_1_Y_codes_opcs4
transplant_il.. byte    %8.0g                 transplant_ileum_2_Y_codes_opcs4
transpl~1_opcs4 str10   %10s                  
transpl~2_opcs4 str10   %10s                  
hosp_covid_pr~y str10   %10s                  
hosp_covid_any  str10   %10s                  
died_date_ons   str10   %10s                  
age             byte    %8.0g                 
sex             str1    %9s                   
stp             str4    %9s                   
region_nhs      str24   %24s                  
has_msoa        byte    %8.0g                 
imd             byte    %8.0g                 
eth             byte    %8.0g                 
ethnicity_sus   byte    %8.0g                 
ethnicity       byte    %8.0g                 
smoking_status  str1    %9s                   
bmi             float   %9.0g                 
has_pbc         byte    %8.0g                 
has_psc         byte    %8.0g                 
liver_transpl~l byte    %8.0g                 
udca_count_bl   byte    %8.0g                 
udca_count_fu   byte    %8.0g                 
oca_bl          byte    %8.0g                 
budesonide_co~u byte    %8.0g                 
budesonide_co~l byte    %8.0g                 
fenofibrate_c~u byte    %8.0g                 
fenofibrate_c~l byte    %8.0g                 
gc_count_fu     byte    %8.0g                 
gc_count_bl     byte    %8.0g                 
rituximab_bl    byte    %8.0g                 
severe_diseas~l byte    %8.0g                 
learning_disa~d byte    %8.0g                 
cancer_opensa~d byte    %8.0g                 
cancer_opensa~w byte    %8.0g                 
cancer_opensa~r byte    %8.0g                 
haematopoieti~d byte    %8.0g                 
haematopoiet~10 byte    %8.0g                 
haematopoieti~4 byte    %8.0g                 
haematologica~m byte    %8.0g                 haematological_malignancies_snome
                                                > d
haematologica~1 byte    %8.0g                 haematological_malignancies_icd10
sickle_cell_d~d byte    %8.0g                 
sickle_cell_~10 byte    %8.0g                 
haematopoieti~_ byte    %8.0g                 haematopoietic_stem_cell_snomed_e
                                                > ver
haematopoie~0_e byte    %8.0g                 haematopoietic_stem_cell_icd10_ev
                                                > er
haematopoie~4_e byte    %8.0g                 haematopoietic_stem_cell_opcs4_ev
                                                > er
v70             byte    %8.0g                 haematological_malignancies_snome
                                                > d_ever
v71             byte    %8.0g                 haematological_malignancies_icd10
                                                > _ever
ckd_stage_5_~ed byte    %8.0g                 
ckd_stage_5_~10 byte    %8.0g                 
immunosuppres~d byte    %8.0g                 
oral_steroid_~d byte    %8.0g                 
oral_s~3m_count byte    %8.0g                 
oral_s~2m_count byte    %8.0g                 
immunosuppres~r byte    %8.0g                 
oral_steroid_~r byte    %8.0g                 
immunosupress~d byte    %8.0g                 
immunosupress~w byte    %8.0g                 
hiv_aids_nhsd~d byte    %8.0g                 
hiv_aids_nhs~10 byte    %8.0g                 
multiple_scl~ed byte    %8.0g                 
multiple_scl~10 byte    %8.0g                 
motor_neurone~e byte    %8.0g                 motor_neurone_disease_nhsd_snomed
motor_neuron~10 byte    %8.0g                 
myasthenia_g~ed byte    %8.0g                 
myasthenia_g~10 byte    %8.0g                 
huntingtons_~ed byte    %8.0g                 
huntingtons_~10 byte    %8.0g                 
died_ons_covi~y byte    %8.0g                 
died_ons_covi~g byte    %8.0g                 
liver_transpl~e str10   %10s                  
severe_diseas~e str10   %10s                  
haematologica~d byte    %8.0g                 
haematologica~r byte    %8.0g                 
ckd_stage_5_~sd byte    %8.0g                 
hiv_aids_nhsd   byte    %8.0g                 
solid_organ_t~d str10   %10s                  
solid_organ_t~w str10   %10s                  
multiple_scl~sd byte    %8.0g                 
motor_neurone~d byte    %8.0g                 
myasthenia_g~sd byte    %8.0g                 
huntingtons_~sd byte    %8.0g                 
patient_id      int     %8.0g                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. save `tempfile' 
file /tmp/St00015.000001 saved

. 
. * Use time-varying exposure file and add in rows for the 6 monthly covariate 
> assessment times 
. use ./output/time_varying_udca_120, clear 

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [0,9995]                     units:  1
         unique values:  1,896                    missing .:  0/2,909

                  mean:   4979.99
              std. dev:   2881.99

           percentiles:        10%       25%       50%       75%       90%
                              1025      2509      4978      7477      8957

. merge m:1 patient_id using `tempfile', keepusing(severe_disease_fu_date sever
> e_disease_bl covid_vacc_first_date liver_transplant_fu_date dereg_date died_d
> ate_ons)

    Result                           # of obs.
    -----------------------------------------
    not matched                         1,806
        from master                     1,806  (_merge==1)
        from using                          0  (_merge==2)

    matched                             1,103  (_merge==3)
    -----------------------------------------

. * Should only be required for dummy data 
. keep if _merge==3
(1,806 observations deleted)

. * Only using start date as this is when udca exposure or 6 monthly check occu
> rs
. drop stop

. gen expand=1

. bys patient_id (start): replace expand=6 if _n==_N 
(1000 real changes made)

. expand expand, generate(newv)
(5,000 observations created)

. bys patient_id newv: gen number = _n 

. replace start = date("01/09/2020", "DMY") if newv==1 & number==1
(1,000 real changes made)

. replace start = date("01/03/2021", "DMY") if newv==1 & number==2
(1,000 real changes made)

. replace start = date("01/09/2021", "DMY") if newv==1 & number==3
(1,000 real changes made)

. replace start = date("01/03/2022", "DMY") if newv==1 & number==4
(1,000 real changes made)

. replace start = date("01/09/2022", "DMY") if newv==1 & number==5
(1,000 real changes made)

. 
. sort patient_id start 

. drop newv

. 
. * Determine end of follow-up date
. gen dereg_dateA = date(dereg_date, "YMD")
(3,053 missing values generated)

. format %dD/N/CY dereg_dateA

. drop dereg_date

. gen died_dateA = date(died_date_ons, "YMD")
(3,053 missing values generated)

. format %dD/N/CY died_dateA

. drop died_date_ons

. gen end_study = date("31/12/2022", "DMY")

. egen end_date = rowmin(dereg_dateA end_study died_dateA)

. 
. * Determine number of days between each covariate and dates of UDCA change or
>  6 monthly check date 
. 
. * Format dates  and identify date nearest after covariate updates 
. foreach var in covid_vacc_first_date severe_disease_fu_date liver_transplant_
> fu_date {
  2.     gen `var'A = date(`var', "YMD")
  3.     format `var'A %dD/N/CY 
  4.     drop `var'
  5.     * time between date of record and change in covariate
.     gen time_`var' = start - `var'A
  6.     * Set time variable for records prior to change as missing
.     replace time_`var'=. if time_`var'<0
  7.     * Find earliest start date after covariate update
.     bys patient_id (time_`var'): gen `var'_update = start[1] if `var'A!=.
  8.     format `var'_update %dD/N/CY 
  9.     count if `var'_update < `var'A
 10. }
(608 missing values generated)
(608 missing values generated)
(3,773 real changes made, 3,773 to missing)
(608 missing values generated)
  908
(1,420 missing values generated)
(1,420 missing values generated)
(2,717 real changes made, 2,717 to missing)
(1,420 missing values generated)
  914
(5,963 missing values generated)
(5,963 missing values generated)
(95 real changes made, 95 to missing)
(5,963 missing values generated)
  67

. * For severe disease only update variable if no severe disease at baseline 
. replace severe_disease_fu_date_update = . if severe_disease_bl==1
(2,276 real changes made, 2,276 to missing)

. 
. * Keep only change dates to create time-varying dataset
. keep patient_id covid_vacc_first_date_update severe_disease_fu_date_update li
> ver_transplant_fu_date_update severe_disease_bl end_date

. * Chercking number of patient_id's 
. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [19,9989]                    units:  1
         unique values:  1,000                    missing .:  0/6,103

                  mean:      4959
              std. dev:   2855.13

           percentiles:        10%       25%       50%       75%       90%
                              1073      2481      5057      7271      8957

. duplicates drop 

Duplicates in terms of all variables

(5,103 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [19,9989]                    units:  1
         unique values:  1,000                    missing .:  0/1,000

                  mean:    4949.8
              std. dev:    2855.3

           percentiles:        10%       25%       50%       75%       90%
                              1063    2461.5    5051.5      7259    8954.5

. * Create file for each covariate to merge onto udca exposure file 
. * First covid vaccination and liver transplant as all people will begin at ze
> ro 
. rename liver_transplant_fu_date_update liver_trans_date_update

. foreach var in covid_vacc_first liver_trans {
  2.     preserve
  3.     keep patient_id `var'_date_update end_date
  4.     * Drop updates after the end of follow-up 
.     replace `var'_date = . if `var'_date>end_date 
  5.     * Flag if variable is updated
.     gen `var'=(`var'_date_update!=.)
  6.     * Create extra row if variable is updated 
.     gen expand = `var'+1
  7.     tab expand
  8.     expand expand, gen(newv)
  9.     * Update variables so row for when zero and row for when updated - if 
> not updated whole time will be zero 
.     gen start = date("01/03/2020", "DMY") if newv==0
 10.     replace start = `var'_date_update if newv==1
 11.     gen stop = `var'_date_update if newv==0
 12.     replace stop = end_date if stop==.
 13.     replace `var'=0 if newv==0
 14.     save ./output/tv_`var'_check, replace
 15.     keep patient_id `var' start stop
 16.     * Check data 
.     count if start==stop 
 17.     * drop start==stop but should not drop any in real data 
.     drop if start==stop 
 18.     count if stop<start
 19.     codebook patient_id
 20.     save ./output/tv_`var', replace
 21.     restore
 22. }
(409 real changes made, 409 to missing)

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        508       50.80       50.80
          2 |        492       49.20      100.00
------------+-----------------------------------
      Total |      1,000      100.00
(492 observations created)
(492 missing values generated)
(492 real changes made)
(1,000 missing values generated)
(1,000 real changes made)
(492 real changes made)
(note: file ./output/tv_covid_vacc_first_check.dta not found)
file ./output/tv_covid_vacc_first_check.dta saved
  24
(24 observations deleted)
  0

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [19,9989]                    units:  1
         unique values:  1,000                    missing .:  0/1,468

                  mean:   4969.55
              std. dev:   2869.04

           percentiles:        10%       25%       50%       75%       90%
                              1076      2463      5037    7309.5      8977
(note: file ./output/tv_covid_vacc_first.dta not found)
file ./output/tv_covid_vacc_first.dta saved
(7 real changes made, 7 to missing)

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        984       98.40       98.40
          2 |         16        1.60      100.00
------------+-----------------------------------
      Total |      1,000      100.00
(16 observations created)
(16 missing values generated)
(16 real changes made)
(1,000 missing values generated)
(1,000 real changes made)
(16 real changes made)
(note: file ./output/tv_liver_trans_check.dta not found)
file ./output/tv_liver_trans_check.dta saved
  3
(3 observations deleted)
  0

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [19,9989]                    units:  1
         unique values:  1,000                    missing .:  0/1,013

                  mean:   4947.41
              std. dev:   2854.84

           percentiles:        10%       25%       50%       75%       90%
                              1073      2460      5052      7252      8957
(note: file ./output/tv_liver_trans.dta not found)
file ./output/tv_liver_trans.dta saved

. 
. * Same for liver disease severity, but variable can start at 1 so remains as 
> this for whole of follow-up 
. preserve

. keep patient_id severe_disease_fu_date_update end_date severe_disease_bl

. * Drop updates after the end of follow-up 
. replace severe_disease_fu_date_update=. if severe_disease_fu_date_update>end_
> date 
(142 real changes made, 142 to missing)

. * Flag if variable is updated
. gen severe_disease=(severe_disease_fu_date_update!=.)

. tab severe_disease 

severe_dise |
        ase |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        749       74.90       74.90
          1 |        251       25.10      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. replace severe_disease = 0 if severe_disease_bl==1
(0 real changes made)

. * Create extra row if variable is updated 
. gen expand = severe_disease + 1

. tab expand

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        749       74.90       74.90
          2 |        251       25.10      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. expand expand, gen(newv)
(251 observations created)

. * Update variables so row for when zero and row for when updated - if not upd
> ated whole time will be zero 
. gen start = date("01/03/2020", "DMY") if newv==0
(251 missing values generated)

. replace start = severe_disease_fu_date_update if newv==1
(251 real changes made)

. gen stop = severe_disease_fu_date_update if newv==0
(1,000 missing values generated)

. replace stop = end_date if stop==.
(1,000 real changes made)

. replace severe_disease=0 if newv==0 & severe_disease_bl==0
(251 real changes made)

. replace severe_disease=1 if newv==0 & severe_disease_bl==1
(500 real changes made)

. save ./output/tv_severe_disease_check, replace
(note: file ./output/tv_severe_disease_check.dta not found)
file ./output/tv_severe_disease_check.dta saved

. keep patient_id severe_disease start stop

. * Check data 
. count if start==stop
  10

. * drop start==stop but should not drop any in real data 
. drop if start==stop 
(10 observations deleted)

. count if stop<start
  0

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [19,9989]                    units:  1
         unique values:  1,000                    missing .:  0/1,241

                  mean:   4953.07
              std. dev:   2888.76

           percentiles:        10%       25%       50%       75%       90%
                              1034      2416      5041      7356      8977

. save ./output/tv_severe_disease, replace
(note: file ./output/tv_severe_disease.dta not found)
file ./output/tv_severe_disease.dta saved

. restore

. 
. * Make age time-varying i.e. updating on 1st January each year
. use `tempfile', clear 

. * Determine end of follow-up date
. gen dereg_dateA = date(dereg_date, "YMD")
(500 missing values generated)

. format %dD/N/CY dereg_dateA

. drop dereg_date

. gen died_dateA = date(died_date_ons, "YMD")
(500 missing values generated)

. format %dD/N/CY died_dateA

. drop died_date_ons

. gen end_study = date("31/12/2022", "DMY")

. egen end_date = rowmin(dereg_dateA end_study died_dateA)

. keep patient_id age end_date

. gen yr_end = year(end_date)

. * Add rows to update age
. gen expand = 3 if yr_end==2022
(490 missing values generated)

. replace expand = 2 if yr_end==2021
(254 real changes made)

. replace expand = 1 if yr_end==2020
(236 real changes made)

. tab expand, m

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        236       23.60       23.60
          2 |        254       25.40       49.00
          3 |        510       51.00      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. expand expand, gen(newv)
(1,274 observations created)

. tab newv, nolabel

       newv |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,000       43.98       43.98
          1 |      1,274       56.02      100.00
------------+-----------------------------------
      Total |      2,274      100.00

. bys patient_id newv: gen number = _n 

. tab newv number, nolabel

           |        number
      newv |         1          2 |     Total
-----------+----------------------+----------
         0 |     1,000          0 |     1,000 
         1 |       764        510 |     1,274 
-----------+----------------------+----------
     Total |     1,764        510 |     2,274 

. gen start = date("01/03/2020", "DMY") if newv==0
(1,274 missing values generated)

. replace start = date("01/01/2021", "DMY") if newv==1 & number==1
(764 real changes made)

. replace start = date("01/01/2022", "DMY") if newv==1 & number==2
(510 real changes made)

. gen stop = date("01/01/2021", "DMY") if newv==0 
(1,274 missing values generated)

. replace stop = end_date if newv==0 & end_date<stop 
(236 real changes made)

. replace stop = date("01/01/2022", "DMY") if newv==1 & number==1 
(764 real changes made)

. replace stop = end_date if newv==1 & number==1 & end_date<stop
(254 real changes made)

. replace stop = date("31/12/2022", "DMY") if newv==1 & number==2 
(510 real changes made)

. replace stop = end_date if newv==1 & number==2 & end_date<stop
(183 real changes made)

. gen age_tv = age if newv==0
(1,274 missing values generated)

. replace age_tv = age+1 if newv==1 & number==1
(764 real changes made)

. replace age_tv = age+2 if newv==1 & number==2
(510 real changes made)

. keep patient_id start stop age_tv 

. drop if start==stop
(0 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [19,9989]                    units:  1
         unique values:  1,000                    missing .:  0/2,274

                  mean:    4967.2
              std. dev:    2863.5

           percentiles:        10%       25%       50%       75%       90%
                              1053      2460      5051      7271      8969

. save ./output/tv_age, replace 
(note: file ./output/tv_age.dta not found)
file ./output/tv_age.dta saved

. 
. * COVID waves 
. use `tempfile', clear

. * Determine end of follow-up date
. gen dereg_dateA = date(dereg_date, "YMD")
(500 missing values generated)

. format %dD/N/CY dereg_dateA

. drop dereg_date

. gen died_date_onsA = date(died_date_ons, "YMD")
(500 missing values generated)

. format %dD/N/CY died_date_onsA

. drop died_date_ons

. gen end_study = date("31/12/2022", "DMY")

. egen end_date = rowmin(dereg_dateA end_study died_date_onsA)

. gen expand = 1 if end_date <= date("31/08/2020", "DMY")
(850 missing values generated)

. replace expand = 2 if end_date <= date("30/06/2021", "DMY") & expand==.
(210 real changes made)

. replace expand = 3 if end_date <= date("30/11/2021", "DMY") & expand==.
(114 real changes made)

. replace expand = 4 if end_date <= date("31/12/2022", "DMY") & expand==.
(526 real changes made)

. tab expand 

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        150       15.00       15.00
          2 |        210       21.00       36.00
          3 |        114       11.40       47.40
          4 |        526       52.60      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. keep patient_id expand end_date

. expand expand, gen(newv) 
(2,016 observations created)

. tab newv 

       newv |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,000       33.16       33.16
          1 |      2,016       66.84      100.00
------------+-----------------------------------
      Total |      3,016      100.00

. bys patient_id newv: gen number = _n 

. * wave 1 row 
. gen start = date("01/03/2020", "DMY") if newv==0
(2,016 missing values generated)

. gen wave = 1 if newv==0
(2,016 missing values generated)

. gen stop = date("01/09/2020", "DMY") if newv==0 
(2,016 missing values generated)

. replace stop = end_date if end_date<stop & wave==1
(150 real changes made)

. tab expand if stop==end_date & wave==1

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        150      100.00      100.00
------------+-----------------------------------
      Total |        150      100.00

. * wave 2 row
. replace start = date("01/09/2020", "DMY") if newv==1 & number==1
(850 real changes made)

. replace wave = 2 if newv==1 & number==1
(850 real changes made)

. replace stop = date("01/07/2021", "DMY") if newv==1 & number==1
(850 real changes made)

. replace stop = end_date if end_date<stop & wave==2
(210 real changes made)

. * wave 3 row 
. replace start = date("01/07/2021", "DMY") if newv==1 & number==2
(640 real changes made)

. replace wave = 3 if newv==1 & number==2
(640 real changes made)

. replace stop = date("01/12/2021", "DMY") if newv==1 & number==2
(640 real changes made)

. replace stop = end_date if end_date<stop & wave==3
(114 real changes made)

. * wave 4 row 
. replace start = date("01/12/2021", "DMY") if newv==1 & number==3
(526 real changes made)

. replace wave = 4 if newv==1 & number==3
(526 real changes made)

. replace stop = date("31/12/2022", "DMY") if newv==1 & number==3
(526 real changes made)

. replace stop = end_date if end_date<stop & wave==4
(199 real changes made)

. keep patient_id start stop wave

. drop if start==stop 
(2 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [19,9989]                    units:  1
         unique values:  1,000                    missing .:  0/3,014

                  mean:   4982.17
              std. dev:   2862.63

           percentiles:        10%       25%       50%       75%       90%
                              1076      2463      5052      7309      8977

. save ./output/tv_waves, replace
(note: file ./output/tv_waves.dta not found)
file ./output/tv_waves.dta saved

. 
. * Outcomes 
. use `tempfile', clear

. * Determine end of follow-up date
. gen dereg_dateA = date(dereg_date, "YMD")
(500 missing values generated)

. format %dD/N/CY dereg_dateA

. drop dereg_date

. gen died_date_onsA = date(died_date_ons, "YMD")
(500 missing values generated)

. format %dD/N/CY died_date_onsA

. drop died_date_ons

. gen end_study = date("31/12/2022", "DMY")

. egen end_date = rowmin(dereg_dateA end_study died_date_onsA)

. gen hosp_covid_anyA = date(hosp_covid_any, "YMD")
(900 missing values generated)

. * Flag hospitalised with covid 
. gen hosp_any_flag = hosp_covid_anyA!=.

. 
. * Composite outcome 
. gen hosp_died_composite = (died_ons_covid_flag_any==1 | hosp_any_flag==1)

. egen hosp_died_dateA = rowmin(died_date_onsA hosp_covid_anyA)
(451 missing values generated)

. 
. * Make file for each outcome: covid death, hospitalisation and composite 
. * Files contain patient ID, start = start study, stop = either end date for p
> atient or date of outcome and flag for outcome 
. * COVID death - any position
. preserve 

. keep patient_id end_date died_ons_covid_flag_any died_date_onsA

. gen start = date("01/03/2020", "DMY")

. egen stop = rowmin(died_date_onsA end_date)

. count if died_ons_covid_flag_any ==1 & end_date<died_date_onsA
  347

. replace died_ons_covid_flag_any=0 if end_date<died_date_onsA
(347 real changes made)

. keep patient_id start stop died_ons_covid_flag_any

. rename died_ons_covid_flag_any died_covid_any_flag

. save ./output/tv_outcome_died_covid_any, replace 
(note: file ./output/tv_outcome_died_covid_any.dta not found)
file ./output/tv_outcome_died_covid_any.dta saved

. tab died_covid_any_flag, m

died_covid_ |
   any_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        847       84.70       84.70
          1 |        153       15.30      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [19,9989]                    units:  1
         unique values:  1,000                    missing .:  0/1,000

                  mean:    4949.8
              std. dev:    2855.3

           percentiles:        10%       25%       50%       75%       90%
                              1063    2461.5    5051.5      7259    8954.5

. restore 

. 
. * Hospitalisation - any position
. preserve 

. keep patient_id end_date hosp_any_flag hosp_covid_anyA

. gen start = date("01/03/2020", "DMY")

. egen stop = rowmin(hosp_covid_anyA end_date)

. count if hosp_any_flag ==1 & end_date<hosp_covid_anyA
  42

. replace hosp_any_flag=0 if end_date<hosp_covid_anyA
(42 real changes made)

. keep patient_id start stop hosp_any_flag

. save ./output/tv_outcome_hosp_any, replace 
(note: file ./output/tv_outcome_hosp_any.dta not found)
file ./output/tv_outcome_hosp_any.dta saved

. tab hosp_any_flag, m

hosp_any_fl |
         ag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        942       94.20       94.20
          1 |         58        5.80      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [19,9989]                    units:  1
         unique values:  1,000                    missing .:  0/1,000

                  mean:    4949.8
              std. dev:    2855.3

           percentiles:        10%       25%       50%       75%       90%
                              1063    2461.5    5051.5      7259    8954.5

. restore 

. 
. * Composite 
. preserve 

. keep patient_id hosp_died* end_date

. gen start = date("01/03/2020", "DMY")

. egen stop = rowmin(hosp_died_dateA end_date)

. count if hosp_died_composite==1 & end_date<hosp_died_dateA
  336

. replace hosp_died_composite=0 if end_date<hosp_died_dateA
(336 real changes made)

. keep patient_id start stop hosp_died_composite

. rename hosp_died_composite composite_any_flag

. save ./output/tv_outcome_composite_any, replace 
(note: file ./output/tv_outcome_composite_any.dta not found)
file ./output/tv_outcome_composite_any.dta saved

. tab composite_any_flag, m

composite_a |
    ny_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        787       78.70       78.70
          1 |        213       21.30      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [19,9989]                    units:  1
         unique values:  1,000                    missing .:  0/1,000

                  mean:    4949.8
              std. dev:    2855.3

           percentiles:        10%       25%       50%       75%       90%
                              1063    2461.5    5051.5      7259    8954.5

. restore 

. 
. * Merge files together for each outcome
. * Composite  
. use ./output/tv_severe_disease, clear 

. tvc_merge start stop using ./output/tv_covid_vacc_first, id(patient_id)

. tvc_merge start stop using ./output/tv_liver_trans, id(patient_id)

. tvc_merge start stop using ./output/time_varying_udca_120, id(patient_id)

. tvc_merge start stop using ./output/tv_age, id(patient_id)

. tvc_merge start stop using ./output/tv_waves, id(patient_id)

. tvc_merge start stop using ./output/tv_outcome_composite_any, id(patient_id) 
> failure(composite_any_flag)

. * Dummy drug data includes people not in cohort, so drop these - should not b
> e any in real data 
. drop if age_tv==.
(1,806 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [19,9989]                    units:  1
         unique values:  1,000                    missing .:  0/5,025

                  mean:   4982.22
              std. dev:   2865.19

           percentiles:        10%       25%       50%       75%       90%
                              1076      2460      5051      7292      8977

. * Check number of outcomes after merge  - there will be missings for rows aft
> er event
. tab composite_any_flag, m

composite_a |
    ny_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,621       91.96       91.96
          1 |        213        4.24       96.20
          . |        191        3.80      100.00
------------+-----------------------------------
      Total |      5,025      100.00

. missings report

Checking missings in all variables:
191 observations with missing values

  +--------------------------------+
  |                      # missing |
  |--------------------------------|
  | composite_any_flag         191 |
  +--------------------------------+

. save ./output/tv_vars_composite_any, replace 
(note: file ./output/tv_vars_composite_any.dta not found)
file ./output/tv_vars_composite_any.dta saved

. 
. * COVID death - any position
. use ./output/tv_severe_disease, clear 

. tvc_merge start stop using ./output/tv_covid_vacc_first, id(patient_id)

. tvc_merge start stop using ./output/tv_liver_trans, id(patient_id)

. tvc_merge start stop using ./output/time_varying_udca_120, id(patient_id)

. tvc_merge start stop using ./output/tv_age, id(patient_id)

. tvc_merge start stop using ./output/tv_waves, id(patient_id)

. tvc_merge start stop using ./output/tv_outcome_died_covid_any, id(patient_id)
>  failure(died_covid_any_flag)

. * Dummy drug data includes people not in cohort, so drop these - should not b
> e any in real data 
. drop if age_tv==.
(1,806 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [19,9989]                    units:  1
         unique values:  1,000                    missing .:  0/4,967

                  mean:   4987.05
              std. dev:   2867.24

           percentiles:        10%       25%       50%       75%       90%
                              1076      2463      5052      7309      8977

. * Check number of outcomes after merge 
. tab died_covid_any_flag, m

died_covid_ |
   any_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,814       96.92       96.92
          1 |        153        3.08      100.00
------------+-----------------------------------
      Total |      4,967      100.00

. missings report

Checking missings in all variables:
0 observations with missing values

. save ./output/tv_vars_died_covid_any, replace 
(note: file ./output/tv_vars_died_covid_any.dta not found)
file ./output/tv_vars_died_covid_any.dta saved

. 
. * COVID hospitalisation - any position
. use ./output/tv_severe_disease, clear 

. tvc_merge start stop using ./output/tv_covid_vacc_first, id(patient_id)

. tvc_merge start stop using ./output/tv_liver_trans, id(patient_id)

. tvc_merge start stop using ./output/time_varying_udca_120, id(patient_id)

. tvc_merge start stop using ./output/tv_age, id(patient_id)

. tvc_merge start stop using ./output/tv_waves, id(patient_id)

. tvc_merge start stop using ./output/tv_outcome_hosp_any, id(patient_id) failu
> re(hosp_any_flag)

. * Check number of outcomes after merge 
. tab hosp_any_flag, m

hosp_any_fl |
         ag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,776       69.92       69.92
          1 |         58        0.85       70.77
          . |      1,997       29.23      100.00
------------+-----------------------------------
      Total |      6,831      100.00

. * Dummy drug data includes people not in cohort, so drop these - should not b
> e any in real data 
. drop if age_tv==.
(1,806 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [19,9989]                    units:  1
         unique values:  1,000                    missing .:  0/5,025

                  mean:   4982.22
              std. dev:   2865.19

           percentiles:        10%       25%       50%       75%       90%
                              1076      2460      5051      7292      8977

. * Check number of outcomes after merge - there will be missings for rows afte
> r event
. tab hosp_any_flag, m 

hosp_any_fl |
         ag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,776       95.04       95.04
          1 |         58        1.15       96.20
          . |        191        3.80      100.00
------------+-----------------------------------
      Total |      5,025      100.00

. missings report

Checking missings in all variables:
191 observations with missing values

  +---------------------------+
  |                 # missing |
  |---------------------------|
  | hosp_any_flag         191 |
  +---------------------------+

. save ./output/tv_vars_hosp_any, replace 
(note: file ./output/tv_vars_hosp_any.dta not found)
file ./output/tv_vars_hosp_any.dta saved

. 
. /* Format file with static covariates: sex, region, covid high risk condition
> s, 
> ethnicity, imd, bmi, smoking. */
. 
. ** Need to decide on second line therapies 
. use `tempfile', clear

. describe 

Contains data from /tmp/St00015.000001
  obs:         1,000                          
 vars:           106                          10 Jul 2023 12:26
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
dereg_date      str10   %10s                  
has_pbc_date    int     %8.0g                 
has_psc_date    int     %8.0g                 
fu_liver_tran~d str10   %10s                  
fu_liver_tran~s str10   %10s                  
udca_last_date  str10   %10s                  
udca_first_af~r str10   %10s                  
udca_first_hi~y str10   %10s                  
covid_va~t_date str10   %10s                  
covid_vacc_se~e str10   %10s                  
covid_vacc_th~e str10   %10s                  
covid_vacc_fo~e str10   %10s                  
covid_~fth_date str10   %10s                  
severe_disea~ed str10   %10s                  
severe_disea~cd str10   %10s                  
solid_organ_t~m str10   %10s                  solid_organ_transplant_nhsd_snome
                                                > d
solid_organ_n~w str10   %10s                  
solid_organ_t~s byte    %8.0g                 solid_organ_transplant_nhsd_opcs4
transplant_al~4 byte    %8.0g                 
transplant_th~4 str10   %10s                  
transplant_co~p byte    %8.0g                 transplant_conjunctiva_y_code_opc
                                                > s4
transplant_co~4 str10   %10s                  
transplant_st~4 str10   %10s                  
transplant_il.. byte    %8.0g                 transplant_ileum_1_Y_codes_opcs4
transplant_il.. byte    %8.0g                 transplant_ileum_2_Y_codes_opcs4
transpl~1_opcs4 str10   %10s                  
transpl~2_opcs4 str10   %10s                  
hosp_covid_pr~y str10   %10s                  
hosp_covid_any  str10   %10s                  
died_date_ons   str10   %10s                  
age             byte    %8.0g                 
sex             str1    %9s                   
stp             str4    %9s                   
region_nhs      str24   %24s                  
has_msoa        byte    %8.0g                 
imd             byte    %8.0g                 
eth             byte    %8.0g                 
ethnicity_sus   byte    %8.0g                 
ethnicity       byte    %8.0g                 
smoking_status  str1    %9s                   
bmi             float   %9.0g                 
has_pbc         byte    %8.0g                 
has_psc         byte    %8.0g                 
liver_transpl~l byte    %8.0g                 
udca_count_bl   byte    %8.0g                 
udca_count_fu   byte    %8.0g                 
oca_bl          byte    %8.0g                 
budesonide_co~u byte    %8.0g                 
budesonide_co~l byte    %8.0g                 
fenofibrate_c~u byte    %8.0g                 
fenofibrate_c~l byte    %8.0g                 
gc_count_fu     byte    %8.0g                 
gc_count_bl     byte    %8.0g                 
rituximab_bl    byte    %8.0g                 
severe_diseas~l byte    %8.0g                 
learning_disa~d byte    %8.0g                 
cancer_opensa~d byte    %8.0g                 
cancer_opensa~w byte    %8.0g                 
cancer_opensa~r byte    %8.0g                 
haematopoieti~d byte    %8.0g                 
haematopoiet~10 byte    %8.0g                 
haematopoieti~4 byte    %8.0g                 
haematologica~m byte    %8.0g                 haematological_malignancies_snome
                                                > d
haematologica~1 byte    %8.0g                 haematological_malignancies_icd10
sickle_cell_d~d byte    %8.0g                 
sickle_cell_~10 byte    %8.0g                 
haematopoieti~_ byte    %8.0g                 haematopoietic_stem_cell_snomed_e
                                                > ver
haematopoie~0_e byte    %8.0g                 haematopoietic_stem_cell_icd10_ev
                                                > er
haematopoie~4_e byte    %8.0g                 haematopoietic_stem_cell_opcs4_ev
                                                > er
v70             byte    %8.0g                 haematological_malignancies_snome
                                                > d_ever
v71             byte    %8.0g                 haematological_malignancies_icd10
                                                > _ever
ckd_stage_5_~ed byte    %8.0g                 
ckd_stage_5_~10 byte    %8.0g                 
immunosuppres~d byte    %8.0g                 
oral_steroid_~d byte    %8.0g                 
oral_s~3m_count byte    %8.0g                 
oral_s~2m_count byte    %8.0g                 
immunosuppres~r byte    %8.0g                 
oral_steroid_~r byte    %8.0g                 
immunosupress~d byte    %8.0g                 
immunosupress~w byte    %8.0g                 
hiv_aids_nhsd~d byte    %8.0g                 
hiv_aids_nhs~10 byte    %8.0g                 
multiple_scl~ed byte    %8.0g                 
multiple_scl~10 byte    %8.0g                 
motor_neurone~e byte    %8.0g                 motor_neurone_disease_nhsd_snomed
motor_neuron~10 byte    %8.0g                 
myasthenia_g~ed byte    %8.0g                 
myasthenia_g~10 byte    %8.0g                 
huntingtons_~ed byte    %8.0g                 
huntingtons_~10 byte    %8.0g                 
died_ons_covi~y byte    %8.0g                 
died_ons_covi~g byte    %8.0g                 
liver_transpl~e str10   %10s                  
severe_diseas~e str10   %10s                  
haematologica~d byte    %8.0g                 
haematologica~r byte    %8.0g                 
ckd_stage_5_~sd byte    %8.0g                 
hiv_aids_nhsd   byte    %8.0g                 
solid_organ_t~d str10   %10s                  
solid_organ_t~w str10   %10s                  
multiple_scl~sd byte    %8.0g                 
motor_neurone~d byte    %8.0g                 
myasthenia_g~sd byte    %8.0g                 
huntingtons_~sd byte    %8.0g                 
patient_id      int     %8.0g                 
-------------------------------------------------------------------------------
Sorted by: 

. * Sex
. gen male = 1 if sex == "M"
(498 missing values generated)

. replace male = 0 if sex == "F"
(488 real changes made)

. * Ethnicity
. replace ethnicity=6 if ethnicity==0
(49 real changes made)

. label define eth5                       1 "White"                            
>            ///
>                             2 "Mixed"                           ///          
>                                    
>                             3 "Asian"                                   ///
>                             4 "Black"                                   ///
>                             5 "Other"                                   ///
>                             6 "Unknown"

.                     
. 
. label values ethnicity eth5

. safetab ethnicity, m
10

  ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |        136       13.60       13.60
      Mixed |        199       19.90       33.50
      Asian |        210       21.00       54.50
      Black |        205       20.50       75.00
      Other |        201       20.10       95.10
    Unknown |         49        4.90      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. * IMD
. replace imd=6 if imd==0
(54 real changes made)

. 
. * BMI categories
. egen bmi_cat = cut(bmi), at(0, 1, 18.5, 24.9, 29.9, 39.9, 100) icodes

. bys bmi_cat: sum bmi

-------------------------------------------------------------------------------
-> bmi_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        199           0           0          0          0

-------------------------------------------------------------------------------
-> bmi_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |         85    14.45949    3.252124   3.873663   18.48774

-------------------------------------------------------------------------------
-> bmi_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        185    22.00969    1.716329   18.53792   24.83978

-------------------------------------------------------------------------------
-> bmi_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        191    27.32346    1.386647   24.93484   29.79936

-------------------------------------------------------------------------------
-> bmi_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        276    33.80112    2.638655   29.90364   39.87712

-------------------------------------------------------------------------------
-> bmi_cat = 5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |         64    42.87403    2.905725   39.92033   52.93908


. * add missing . to zero category
. replace bmi_cat = 0 if bmi_cat==. 
(0 real changes made)

. label define bmi 0 "Missing" 1 "Underweight" 2 "Healthy range" 3 "Overweight"
>  4 "Obese" 5 "Morbidly obese"

. label values bmi_cat bmi

. 
. * Smoking status
. gen smoking = 0 if smoking_status=="N"
(903 missing values generated)

. replace smoking = 1 if smoking_status=="S"
(198 real changes made)

. replace smoking = 2 if smoking_status=="E"
(158 real changes made)

. replace smoking = 3 if smoking==.
(547 real changes made)

. 
. * High risk covid conditions
. replace oral_steroid_drugs_nhsd=. if oral_steroid_drug_nhsd_3m_count < 2 & or
> al_steroid_drug_nhsd_12m_count < 4
(942 real changes made, 942 to missing)

. gen imid_nhsd=max(oral_steroid_drugs_nhsd, immunosuppresant_drugs_nhsd)

. gen rare_neuro_nhsd = max(multiple_sclerosis_nhsd, motor_neurone_disease_nhsd
> , myasthenia_gravis_nhsd, huntingtons_disease_nhsd)

. gen solid_organ_transplant_bin = solid_organ_transplant_nhsd_new!=""

. gen any_high_risk_condition = max(learning_disability_nhsd_snomed, cancer_ope
> nsafely_snomed_new, haematological_disease_nhsd, ///
> ckd_stage_5_nhsd, imid_nhsd, immunosupression_nhsd_new, hiv_aids_nhsd, solid_
> organ_transplant_bin, rare_neuro_nhsd)

. 
. keep patient_id male stp any_high_risk_condition ethnicity imd bmi_cat smokin
> g 

. 
. foreach var in died_covid_any hosp_any composite_any {
  2.     preserve 
  3.     merge 1:m patient_id using ./output/tv_vars_`var' 
  4.     drop _merge 
  5.     save ./output/an_dataset_`var', replace
  6.     restore
  7. }

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             4,967  (_merge==3)
    -----------------------------------------
(note: file ./output/an_dataset_died_covid_any.dta not found)
file ./output/an_dataset_died_covid_any.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             5,025  (_merge==3)
    -----------------------------------------
(note: file ./output/an_dataset_hosp_any.dta not found)
file ./output/an_dataset_hosp_any.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             5,025  (_merge==3)
    -----------------------------------------
(note: file ./output/an_dataset_composite_any.dta not found)
file ./output/an_dataset_composite_any.dta saved

. 
. log close 
      name:  <unnamed>
       log:  /workspace/logs/time_varying.log
  log type:  text
 closed on:  10 Jul 2023, 12:26:54
-------------------------------------------------------------------------------
