
. 
. tempfile tempfile 

. import delimited using ./output/input_pbc.csv
(106 vars, 1,000 obs)

. describe

Contains data
  obs:         1,000                          
 vars:           106                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
dereg_date      str10   %10s                  
has_pbc_date    int     %8.0g                 
has_psc_date    int     %8.0g                 
fu_liver_tran~d str10   %10s                  
fu_liver_tran~s str10   %10s                  
udca_last_date  str10   %10s                  
udca_first_af~r str10   %10s                  
udca_first_hi~y str10   %10s                  
covid_va~t_date str10   %10s                  
covid_vacc_se~e str10   %10s                  
covid_vacc_th~e str10   %10s                  
covid_vacc_fo~e str10   %10s                  
covid_~fth_date str10   %10s                  
severe_disea~ed str10   %10s                  
severe_disea~cd str10   %10s                  
solid_organ_t~m str10   %10s                  solid_organ_transplant_nhsd_snome
                                                > d
solid_organ_n~w str10   %10s                  
solid_organ_t~s byte    %8.0g                 solid_organ_transplant_nhsd_opcs4
transplant_al~4 byte    %8.0g                 
transplant_th~4 str10   %10s                  
transplant_co~p byte    %8.0g                 transplant_conjunctiva_y_code_opc
                                                > s4
transplant_co~4 str10   %10s                  
transplant_st~4 str10   %10s                  
transplant_il.. byte    %8.0g                 transplant_ileum_1_Y_codes_opcs4
transplant_il.. byte    %8.0g                 transplant_ileum_2_Y_codes_opcs4
transpl~1_opcs4 str10   %10s                  
transpl~2_opcs4 str10   %10s                  
hosp_covid_pr~y str10   %10s                  
hosp_covid_any  str10   %10s                  
died_date_ons   str10   %10s                  
age             byte    %8.0g                 
sex             str1    %9s                   
stp             str4    %9s                   
region_nhs      str24   %24s                  
has_msoa        byte    %8.0g                 
imd             byte    %8.0g                 
eth             byte    %8.0g                 
ethnicity_sus   byte    %8.0g                 
ethnicity       byte    %8.0g                 
smoking_status  str1    %9s                   
bmi             float   %9.0g                 
has_pbc         byte    %8.0g                 
has_psc         byte    %8.0g                 
liver_transpl~l byte    %8.0g                 
udca_count_bl   byte    %8.0g                 
udca_count_fu   byte    %8.0g                 
oca_bl          byte    %8.0g                 
budesonide_co~u byte    %8.0g                 
budesonide_co~l byte    %8.0g                 
fenofibrate_c~u byte    %8.0g                 
fenofibrate_c~l byte    %8.0g                 
gc_count_fu     byte    %8.0g                 
gc_count_bl     byte    %8.0g                 
rituximab_bl    byte    %8.0g                 
severe_diseas~l byte    %8.0g                 
learning_disa~d byte    %8.0g                 
cancer_opensa~d byte    %8.0g                 
cancer_opensa~w byte    %8.0g                 
cancer_opensa~r byte    %8.0g                 
haematopoieti~d byte    %8.0g                 
haematopoiet~10 byte    %8.0g                 
haematopoieti~4 byte    %8.0g                 
haematologica~m byte    %8.0g                 haematological_malignancies_snome
                                                > d
haematologica~1 byte    %8.0g                 haematological_malignancies_icd10
sickle_cell_d~d byte    %8.0g                 
sickle_cell_~10 byte    %8.0g                 
haematopoieti~_ byte    %8.0g                 haematopoietic_stem_cell_snomed_e
                                                > ver
haematopoie~0_e byte    %8.0g                 haematopoietic_stem_cell_icd10_ev
                                                > er
haematopoie~4_e byte    %8.0g                 haematopoietic_stem_cell_opcs4_ev
                                                > er
v70             byte    %8.0g                 haematological_malignancies_snome
                                                > d_ever
v71             byte    %8.0g                 haematological_malignancies_icd10
                                                > _ever
ckd_stage_5_~ed byte    %8.0g                 
ckd_stage_5_~10 byte    %8.0g                 
immunosuppres~d byte    %8.0g                 
oral_steroid_~d byte    %8.0g                 
oral_s~3m_count byte    %8.0g                 
oral_s~2m_count byte    %8.0g                 
immunosuppres~r byte    %8.0g                 
oral_steroid_~r byte    %8.0g                 
immunosupress~d byte    %8.0g                 
immunosupress~w byte    %8.0g                 
hiv_aids_nhsd~d byte    %8.0g                 
hiv_aids_nhs~10 byte    %8.0g                 
multiple_scl~ed byte    %8.0g                 
multiple_scl~10 byte    %8.0g                 
motor_neurone~e byte    %8.0g                 motor_neurone_disease_nhsd_snomed
motor_neuron~10 byte    %8.0g                 
myasthenia_g~ed byte    %8.0g                 
myasthenia_g~10 byte    %8.0g                 
huntingtons_~ed byte    %8.0g                 
huntingtons_~10 byte    %8.0g                 
died_ons_covi~y byte    %8.0g                 
died_ons_covi~g byte    %8.0g                 
liver_transpl~e str10   %10s                  
severe_diseas~e str10   %10s                  
haematologica~d byte    %8.0g                 
haematologica~r byte    %8.0g                 
ckd_stage_5_~sd byte    %8.0g                 
hiv_aids_nhsd   byte    %8.0g                 
solid_organ_t~d str10   %10s                  
solid_organ_t~w str10   %10s                  
multiple_scl~sd byte    %8.0g                 
motor_neurone~d byte    %8.0g                 
myasthenia_g~sd byte    %8.0g                 
huntingtons_~sd byte    %8.0g                 
patient_id      int     %8.0g                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. save `tempfile' 
file /tmp/St00015.000001 saved

. 
. /* Time-varying covariates are assessed 6-monthly and at time of exposure swi
> tching.
> As disease severity, covid vaccination and liver transplant will only switch 
> once need to identify
> nearest date after date identified in study definition */ 
. * Note: currently just doing 120 day file as this is the primary exposure def
> inition 
. use ./output/time_varying_udca_120, clear 

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [2,9999]                     units:  1
         unique values:  1,888                    missing .:  0/2,900

                  mean:   4915.28
              std. dev:   2862.96

           percentiles:        10%       25%       50%       75%       90%
                               960    2446.5      4883      7445    8883.5

. merge m:1 patient_id using `tempfile', keepusing(severe_disease_fu_date sever
> e_disease_bl covid_vacc_first_date liver_transplant_fu_date dereg_date died_d
> ate_ons)

    Result                           # of obs.
    -----------------------------------------
    not matched                         1,788
        from master                     1,788  (_merge==1)
        from using                          0  (_merge==2)

    matched                             1,112  (_merge==3)
    -----------------------------------------

. * Should only be required for dummy data 
. keep if _merge==3
(1,788 observations deleted)

. * Only using start date as this is when udca exposure or 6 monthly check occu
> rs
. drop stop

. * Add in rows with each of the 6 monthly assessment dates 
. gen expand=1

. bys patient_id (start): replace expand=6 if _n==_N 
(1000 real changes made)

. expand expand, generate(newv)
(5,000 observations created)

. bys patient_id newv: gen number = _n 

. replace start = date("01/09/2020", "DMY") if newv==1 & number==1
(1,000 real changes made)

. replace start = date("01/03/2021", "DMY") if newv==1 & number==2
(1,000 real changes made)

. replace start = date("01/09/2021", "DMY") if newv==1 & number==3
(1,000 real changes made)

. replace start = date("01/03/2022", "DMY") if newv==1 & number==4
(1,000 real changes made)

. replace start = date("01/09/2022", "DMY") if newv==1 & number==5
(1,000 real changes made)

. 
. * This gives a file where start dates are either exposure switching or 6-mont
> ly assessment dates 
. * These will be used to determine the closest date to time-varying covariate 
> dates identified in study definition 
. sort patient_id start 

. drop newv

. 
. * Determine end of follow-up date
. gen dereg_dateA = date(dereg_date, "YMD")
(3,058 missing values generated)

. format %dD/N/CY dereg_dateA

. drop dereg_date

. gen died_dateA = date(died_date_ons, "YMD")
(3,064 missing values generated)

. format %dD/N/CY died_dateA

. drop died_date_ons

. gen end_study = date("31/12/2022", "DMY")

. egen end_date = rowmin(dereg_dateA end_study died_dateA)

. 
. * Take out assessments after end_date 
. drop if start>end_date
(2,003 observations deleted)

. 
. * Determine number of days between each covariate and dates of UDCA change or
>  6 monthly check date 
. bys patient_id (start): egen last_assess = max(start)

. * Format dates  and identify date nearest after covariate updates 
. foreach var in covid_vacc_first_date severe_disease_fu_date liver_transplant_
> fu_date {
  2.     gen `var'A = date(`var', "YMD")
  3.     format `var'A %dD/N/CY 
  4.     drop `var'
  5.     * time between date of record and change in covariate - positive value
> s are those where record starts after 
.     * covariate change date 
.     gen time_`var' = start - `var'A
  6.     * Set time variable for records prior to change as missing
.     replace time_`var'=. if time_`var'<0
  7.     * Check if any are on index date (1st March) potentially severe diseas
> e - not others
.     di "Number where time-varying update same as assessment date"
  8.     count if time_`var'==0
  9.     di "Number where time-varying update is 1st March 2020"
 10.     count if `var'A==date("01/03/2020", "DMY")
 11.     * Find earliest start date after covariate update
.     * Note: there are some changes that occur after the last available 6 mont
> h assessment or exposure change
.     bys patient_id (time_`var'): gen `var'_updateN = start[1] if `var'A!=. & 
> time_`var'!=.
 12.     * Spread to all rows for patient 
.     bys patient_id: egen `var'_update = max(`var'_updateN)
 13.     format `var'_update %dD/N/CY 
 14.     di "Number where new variable is prior to original variable (should be
>  0)"
 15.     count if `var'_update < `var'A
 16.     di "Number where time varying update is after last assessment date"
 17.     count if `var'A > last_assess & `var'A!=.  & last_assess==start
 18.     di "Number of time-varying changes originally" 
 19.     * Using last_assess==start to count patients rather than rows
.     count if `var'A!=. & last_assess==start 
 20.     di "Number of dates for time-varying update"
 21.     count if `var'_update!=. & last_assess==start & `var'A!=.
 22. }
(441 missing values generated)
(441 missing values generated)
(2,928 real changes made, 2,928 to missing)
Number where time-varying update same as assessment date
  1
Number where time-varying update is 1st March 2020
  0
(3,369 missing values generated)
(1995 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  529
Number of time-varying changes originally
  901
Number of dates for time-varying update
  372
(1,030 missing values generated)
(1,030 missing values generated)
(2,014 real changes made, 2,014 to missing)
Number where time-varying update same as assessment date
  1
Number where time-varying update is 1st March 2020
  0
(3,044 missing values generated)
(2092 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  367
Number of time-varying changes originally
  750
Number of dates for time-varying update
  383
(3,979 missing values generated)
(3,979 missing values generated)
(88 real changes made, 88 to missing)
Number where time-varying update same as assessment date
  0
Number where time-varying update is 1st March 2020
  0
(4,067 missing values generated)
(4018 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  14
Number of time-varying changes originally
  32
Number of dates for time-varying update
  18

. * For severe disease only update variable if no severe disease at baseline 
. count if severe_disease_fu_date_update==date("01/03/2020", "DMY") & severe_di
> sease_bl!=1 
  0

. tab severe_disease_bl

severe_dise |
     ase_bl |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,024       49.26       49.26
          1 |      2,085       50.74      100.00
------------+-----------------------------------
      Total |      4,109      100.00

. replace severe_disease_fu_date_update = . if severe_disease_bl==1
(1,012 real changes made, 1,012 to missing)

. 
. * Keep only change dates to create time-varying dataset
. keep patient_id covid_vacc_first_date_update severe_disease_fu_date_update li
> ver_transplant_fu_date_update severe_disease_bl end_date

. * Chercking number of patient_id's 
. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [14,9974]                    units:  1
         unique values:  1,000                    missing .:  0/4,109

                  mean:   5031.48
              std. dev:   2863.85

           percentiles:        10%       25%       50%       75%       90%
                              1015      2547      5057      7545      8982

. duplicates drop 

Duplicates in terms of all variables

(3,109 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [14,9974]                    units:  1
         unique values:  1,000                    missing .:  0/1,000

                  mean:   4969.73
              std. dev:   2851.49

           percentiles:        10%       25%       50%       75%       90%
                            1049.5    2535.5      5007    7445.5      8918

. * Create file for each covariate to merge onto udca exposure file 
. * First covid vaccination and liver transplant as all people will begin at ze
> ro 
. rename liver_transplant_fu_date_update liver_trans_date_update

. foreach var in covid_vacc_first liver_trans {
  2.     preserve
  3.     keep patient_id `var'_date_update end_date
  4.     * Drop updates after the end of follow-up 
.     count if `var'_date>=end_date 
  5.     replace `var'_date = . if `var'_date>=end_date 
  6.     * Flag if variable is updated
.     gen `var'=(`var'_date_update!=.)
  7.     * Create extra row if variable is updated 
.     gen expand = `var'+1
  8.     tab expand
  9.     expand expand, gen(newv)
 10.     * Update variables so row for when zero and row for when updated - if 
> not updated whole time will be zero 
.     gen start = date("01/03/2020", "DMY") if newv==0
 11.     replace start = `var'_date_update if newv==1
 12.     gen stop = `var'_date_update if newv==0
 13.     replace stop = end_date if stop==.
 14.     replace `var'=0 if newv==0
 15.     save ./output/tv_`var'_check, replace
 16.     keep patient_id `var' start stop
 17.     * Check data 
.     count if start==stop 
 18.     * drop where start is same as stop - should not drop any in real data 
.     drop if start==stop 
 19.     count if stop<start
 20.     codebook patient_id
 21.     save ./output/tv_`var', replace
 22.     restore
 23. }
  629
(1 real change made, 1 to missing)

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        629       62.90       62.90
          2 |        371       37.10      100.00
------------+-----------------------------------
      Total |      1,000      100.00
(371 observations created)
(371 missing values generated)
(371 real changes made)
(1,000 missing values generated)
(1,000 real changes made)
(371 real changes made)
(note: file ./output/tv_covid_vacc_first_check.dta not found)
file ./output/tv_covid_vacc_first_check.dta saved
  0
(0 observations deleted)
  0

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [14,9974]                    units:  1
         unique values:  1,000                    missing .:  0/1,371

                  mean:   5019.12
              std. dev:   2862.64

           percentiles:        10%       25%       50%       75%       90%
                              1021      2541      5057      7495      8967
(note: file ./output/tv_covid_vacc_first.dta not found)
file ./output/tv_covid_vacc_first.dta saved
  982
(0 real changes made)

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        982       98.20       98.20
          2 |         18        1.80      100.00
------------+-----------------------------------
      Total |      1,000      100.00
(18 observations created)
(18 missing values generated)
(18 real changes made)
(1,000 missing values generated)
(1,000 real changes made)
(18 real changes made)
(note: file ./output/tv_liver_trans_check.dta not found)
file ./output/tv_liver_trans_check.dta saved
  0
(0 observations deleted)
  0

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [14,9974]                    units:  1
         unique values:  1,000                    missing .:  0/1,018

                  mean:   4962.14
              std. dev:   2851.44

           percentiles:        10%       25%       50%       75%       90%
                              1042      2524      5002      7425      8919
(note: file ./output/tv_liver_trans.dta not found)
file ./output/tv_liver_trans.dta saved

. 
. * Same for liver disease severity, but variable can start at 1 and remain for
>  whole of follow-up 
. preserve

. keep patient_id severe_disease_fu_date_update end_date severe_disease_bl

. * Drop updates after the end of follow-up 
. replace severe_disease_fu_date_update=. if severe_disease_fu_date_update>=end
> _date 
(1 real change made, 1 to missing)

. * Flag if variable is updated
. gen severe_disease=(severe_disease_fu_date_update!=.)

. tab severe_disease 

severe_dise |
        ase |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        812       81.20       81.20
          1 |        188       18.80      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. replace severe_disease = 0 if severe_disease_bl==1
(0 real changes made)

. * Create extra row if variable is updated 
. gen expand = severe_disease + 1

. tab expand

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        812       81.20       81.20
          2 |        188       18.80      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. expand expand, gen(newv)
(188 observations created)

. tab newv

       newv |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,000       84.18       84.18
          1 |        188       15.82      100.00
------------+-----------------------------------
      Total |      1,188      100.00

. * Update variables so row for when zero and row for when updated - if not upd
> ated whole time will be zero 
. gen start = date("01/03/2020", "DMY") if newv==0
(188 missing values generated)

. replace start = severe_disease_fu_date_update if newv==1
(188 real changes made)

. gen stop = severe_disease_fu_date_update if newv==0 & severe_disease==1
(1,000 missing values generated)

. count if stop!=.
  188

. replace stop = end_date if stop==. 
(1,000 real changes made)

. count if stop==.
  0

. replace severe_disease=0 if newv==0 & severe_disease_bl==0
(188 real changes made)

. replace severe_disease=1 if newv==0 & severe_disease_bl==1
(500 real changes made)

. save ./output/tv_severe_disease_check, replace
(note: file ./output/tv_severe_disease_check.dta not found)
file ./output/tv_severe_disease_check.dta saved

. keep patient_id severe_disease start stop

. * Check data 
. count if start==stop
  0

. * drop if start is same as stop - should not drop any in real data 
. drop if start==stop 
(0 observations deleted)

. count if stop<start
  0

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [14,9974]                    units:  1
         unique values:  1,000                    missing .:  0/1,188

                  mean:   4989.31
              std. dev:   2851.82

           percentiles:        10%       25%       50%       75%       90%
                              1021      2541      5037    7474.5      8919

. save ./output/tv_severe_disease, replace
(note: file ./output/tv_severe_disease.dta not found)
file ./output/tv_severe_disease.dta saved

. restore

. 
. * Make age time-varying i.e. updating on 1st January each year
. use `tempfile', clear 

. * Determine end of follow-up date
. gen dereg_dateA = date(dereg_date, "YMD")
(500 missing values generated)

. format %dD/N/CY dereg_dateA

. drop dereg_date

. gen died_dateA = date(died_date_ons, "YMD")
(500 missing values generated)

. format %dD/N/CY died_dateA

. drop died_date_ons

. * Determine end of follow-up then add rows to update age for each year of fol
> low-up
. gen end_study = date("31/12/2022", "DMY")

. egen end_date = rowmin(dereg_dateA end_study died_dateA)

. keep patient_id age end_date

. gen yr_end = year(end_date)

. * Add rows to update age
. gen expand = 3 if yr_end==2022
(486 missing values generated)

. replace expand = 2 if yr_end==2021
(252 real changes made)

. replace expand = 1 if yr_end==2020
(234 real changes made)

. tab expand, m

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        234       23.40       23.40
          2 |        252       25.20       48.60
          3 |        514       51.40      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. expand expand, gen(newv)
(1,280 observations created)

. tab newv, nolabel

       newv |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,000       43.86       43.86
          1 |      1,280       56.14      100.00
------------+-----------------------------------
      Total |      2,280      100.00

. bys patient_id newv: gen number = _n 

. tab newv number, nolabel

           |        number
      newv |         1          2 |     Total
-----------+----------------------+----------
         0 |     1,000          0 |     1,000 
         1 |       766        514 |     1,280 
-----------+----------------------+----------
     Total |     1,766        514 |     2,280 

. gen start = date("01/03/2020", "DMY") if newv==0
(1,280 missing values generated)

. replace start = date("01/01/2021", "DMY") if newv==1 & number==1
(766 real changes made)

. replace start = date("01/01/2022", "DMY") if newv==1 & number==2
(514 real changes made)

. gen stop = date("01/01/2021", "DMY") if newv==0 
(1,280 missing values generated)

. replace stop = end_date if newv==0 & end_date<stop 
(234 real changes made)

. replace stop = date("01/01/2022", "DMY") if newv==1 & number==1 
(766 real changes made)

. replace stop = end_date if newv==1 & number==1 & end_date<stop
(252 real changes made)

. replace stop = date("31/12/2022", "DMY") if newv==1 & number==2 
(514 real changes made)

. replace stop = end_date if newv==1 & number==2 & end_date<stop
(207 real changes made)

. gen age_tv = age if newv==0
(1,280 missing values generated)

. replace age_tv = age+1 if newv==1 & number==1
(766 real changes made)

. replace age_tv = age+2 if newv==1 & number==2
(514 real changes made)

. keep patient_id start stop age_tv 

. drop if start==stop
(2 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [14,9974]                    units:  1
         unique values:  1,000                    missing .:  0/2,278

                  mean:   5022.56
              std. dev:   2873.54

           percentiles:        10%       25%       50%       75%       90%
                              1007      2541      5047      7549      9000

. save ./output/tv_age, replace 
(note: file ./output/tv_age.dta not found)
file ./output/tv_age.dta saved

. 
. * COVID waves 
. use `tempfile', clear

. * Determine end of follow-up date
. gen dereg_dateA = date(dereg_date, "YMD")
(500 missing values generated)

. format %dD/N/CY dereg_dateA

. drop dereg_date

. gen died_date_onsA = date(died_date_ons, "YMD")
(500 missing values generated)

. format %dD/N/CY died_date_onsA

. drop died_date_ons

. * Determine end of follow-up then add rows to update waves 
. gen end_study = date("31/12/2022", "DMY")

. egen end_date = rowmin(dereg_dateA end_study died_date_onsA)

. gen expand = 1 if end_date <= date("31/08/2020", "DMY")
(866 missing values generated)

. replace expand = 2 if end_date <= date("30/06/2021", "DMY") & expand==.
(239 real changes made)

. replace expand = 3 if end_date <= date("30/11/2021", "DMY") & expand==.
(94 real changes made)

. replace expand = 4 if end_date <= date("31/12/2022", "DMY") & expand==.
(533 real changes made)

. tab expand 

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        134       13.40       13.40
          2 |        239       23.90       37.30
          3 |         94        9.40       46.70
          4 |        533       53.30      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. keep patient_id expand end_date

. expand expand, gen(newv) 
(2,026 observations created)

. tab newv 

       newv |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,000       33.05       33.05
          1 |      2,026       66.95      100.00
------------+-----------------------------------
      Total |      3,026      100.00

. bys patient_id newv: gen number = _n 

. * wave 1 row 
. gen start = date("01/03/2020", "DMY") if newv==0
(2,026 missing values generated)

. gen wave = 1 if newv==0
(2,026 missing values generated)

. gen stop = date("01/09/2020", "DMY") if newv==0 
(2,026 missing values generated)

. replace stop = end_date if end_date<stop & wave==1
(134 real changes made)

. tab expand if stop==end_date & wave==1

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        134       97.81       97.81
          2 |          3        2.19      100.00
------------+-----------------------------------
      Total |        137      100.00

. * wave 2 row
. replace start = date("01/09/2020", "DMY") if newv==1 & number==1
(866 real changes made)

. replace wave = 2 if newv==1 & number==1
(866 real changes made)

. replace stop = date("01/07/2021", "DMY") if newv==1 & number==1
(866 real changes made)

. replace stop = end_date if end_date<stop & wave==2
(239 real changes made)

. * wave 3 row 
. replace start = date("01/07/2021", "DMY") if newv==1 & number==2
(627 real changes made)

. replace wave = 3 if newv==1 & number==2
(627 real changes made)

. replace stop = date("01/12/2021", "DMY") if newv==1 & number==2
(627 real changes made)

. replace stop = end_date if end_date<stop & wave==3
(94 real changes made)

. * wave 4 row 
. replace start = date("01/12/2021", "DMY") if newv==1 & number==3
(533 real changes made)

. replace wave = 4 if newv==1 & number==3
(533 real changes made)

. replace stop = date("31/12/2022", "DMY") if newv==1 & number==3
(533 real changes made)

. replace stop = end_date if end_date<stop & wave==4
(226 real changes made)

. keep patient_id start stop wave

. drop if start==stop 
(4 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [14,9974]                    units:  1
         unique values:  1,000                    missing .:  0/3,022

                  mean:   5014.15
              std. dev:   2866.24

           percentiles:        10%       25%       50%       75%       90%
                              1014      2547    5046.5      7495      9000

. save ./output/tv_waves, replace
(note: file ./output/tv_waves.dta not found)
file ./output/tv_waves.dta saved

. 
. * Create files for outcomes
. use `tempfile', clear

. * Determine end of follow-up date
. gen dereg_dateA = date(dereg_date, "YMD")
(500 missing values generated)

. format %dD/N/CY dereg_dateA

. drop dereg_date

. gen died_date_onsA = date(died_date_ons, "YMD")
(500 missing values generated)

. format %dD/N/CY died_date_onsA

. drop died_date_ons

. gen end_study = date("31/12/2022", "DMY")

. egen end_date = rowmin(dereg_dateA end_study died_date_onsA)

. * Create flag indicating reason for end of follow-up 
. gen end_date_flag = (end_date==dereg_dateA)

. replace end_date_flag = 2 if end_date==died_date_onsA
(335 real changes made)

. replace end_date_flag = 3 if end_date==end_study
(307 real changes made)

. gen hosp_covid_anyA = date(hosp_covid_any, "YMD")
(900 missing values generated)

. gen yr_hosp = year(hosp_covid_anyA)
(900 missing values generated)

. tab yr_hosp

    yr_hosp |      Freq.     Percent        Cum.
------------+-----------------------------------
       2020 |         25       25.00       25.00
       2021 |         31       31.00       56.00
       2022 |         28       28.00       84.00
       2023 |         16       16.00      100.00
------------+-----------------------------------
      Total |        100      100.00

. * Flag hospitalised with covid 
. gen hosp_any_flag = hosp_covid_anyA!=.

. 
. * Composite outcome 
. gen hosp_died_composite = (died_ons_covid_flag_any==1 | hosp_any_flag==1)

. egen hosp_died_dateA = rowmin(died_date_onsA hosp_covid_anyA)
(452 missing values generated)

. 
. * Make file for each outcome: covid death, hospitalisation and composite 
. * Files contain patient ID, start = start study, stop = either end date for p
> atient or date of outcome 
. * and flag for outcome 
. * COVID death - covid code in any position
. preserve 

. keep patient_id end_date died_ons_covid_flag_any died_date_onsA

. gen start = date("01/03/2020", "DMY")

. egen stop = rowmin(died_date_onsA end_date)

. count if died_ons_covid_flag_any ==1 & end_date<died_date_onsA
  335

. replace died_ons_covid_flag_any=0 if end_date<died_date_onsA
(335 real changes made)

. keep patient_id start stop died_ons_covid_flag_any

. rename died_ons_covid_flag_any died_covid_any_flag

. save ./output/tv_outcome_died_covid_any, replace 
(note: file ./output/tv_outcome_died_covid_any.dta not found)
file ./output/tv_outcome_died_covid_any.dta saved

. tab died_covid_any_flag, m

died_covid_ |
   any_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        835       83.50       83.50
          1 |        165       16.50      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [14,9974]                    units:  1
         unique values:  1,000                    missing .:  0/1,000

                  mean:   4969.73
              std. dev:   2851.49

           percentiles:        10%       25%       50%       75%       90%
                            1049.5    2535.5      5007    7445.5      8918

. restore 

. 
. * Hospitalisation - covid code in any position
. preserve 

. keep patient_id end_date hosp_any_flag hosp_covid_anyA

. gen start = date("01/03/2020", "DMY")

. egen stop = rowmin(hosp_covid_anyA end_date)

. count if hosp_any_flag ==1 & end_date<hosp_covid_anyA
  54

. replace hosp_any_flag=0 if end_date<hosp_covid_anyA
(54 real changes made)

. keep patient_id start stop hosp_any_flag

. save ./output/tv_outcome_hosp_any, replace 
(note: file ./output/tv_outcome_hosp_any.dta not found)
file ./output/tv_outcome_hosp_any.dta saved

. tab hosp_any_flag, m

hosp_any_fl |
         ag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        954       95.40       95.40
          1 |         46        4.60      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [14,9974]                    units:  1
         unique values:  1,000                    missing .:  0/1,000

                  mean:   4969.73
              std. dev:   2851.49

           percentiles:        10%       25%       50%       75%       90%
                            1049.5    2535.5      5007    7445.5      8918

. count
  1,000

. bys patient_id: egen total_hosp = total(hosp_any_flag)

. tab total_hosp

 total_hosp |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        954       95.40       95.40
          1 |         46        4.60      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. restore 

. 
. * Composite 
. preserve 

. keep patient_id hosp_died* end_date

. gen start = date("01/03/2020", "DMY")

. egen stop = rowmin(hosp_died_dateA end_date)

. count if hosp_died_composite==1 & end_date<hosp_died_dateA
  332

. replace hosp_died_composite=0 if end_date<hosp_died_dateA
(332 real changes made)

. keep patient_id start stop hosp_died_composite

. rename hosp_died_composite composite_any_flag

. save ./output/tv_outcome_composite_any, replace 
(note: file ./output/tv_outcome_composite_any.dta not found)
file ./output/tv_outcome_composite_any.dta saved

. tab composite_any_flag, m

composite_a |
    ny_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        779       77.90       77.90
          1 |        221       22.10      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [14,9974]                    units:  1
         unique values:  1,000                    missing .:  0/1,000

                  mean:   4969.73
              std. dev:   2851.49

           percentiles:        10%       25%       50%       75%       90%
                            1049.5    2535.5      5007    7445.5      8918

. restore 

. 
. * Merge files together for each outcome
. * Composite  
. use ./output/tv_severe_disease, clear 

. tvc_merge start stop using ./output/tv_covid_vacc_first, id(patient_id)

. tvc_merge start stop using ./output/tv_liver_trans, id(patient_id)

. tvc_merge start stop using ./output/time_varying_udca_120, id(patient_id)

. tvc_merge start stop using ./output/tv_age, id(patient_id)

. tvc_merge start stop using ./output/tv_outcome_composite_any, id(patient_id) 
> failure(composite_any_flag)

. * Dummy drug data includes people not in cohort, so drop these - should not b
> e any in real data 
. drop if age_tv==.
(1,788 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [14,9974]                    units:  1
         unique values:  1,000                    missing .:  0/2,994

                  mean:   5019.63
              std. dev:    2871.8

           percentiles:        10%       25%       50%       75%       90%
                              1007      2536      5046      7545      9000

. * Check number of outcomes after merge  - there will be missings for rows aft
> er event
. tab composite_any_flag, m

composite_a |
    ny_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,665       89.01       89.01
          1 |        221        7.38       96.39
          . |        108        3.61      100.00
------------+-----------------------------------
      Total |      2,994      100.00

. missings report

Checking missings in all variables:
108 observations with missing values

  +--------------------------------+
  |                      # missing |
  |--------------------------------|
  | composite_any_flag         108 |
  +--------------------------------+

. drop if composite_any_flag==.
(108 observations deleted)

. save ./output/tv_vars_composite_any, replace 
(note: file ./output/tv_vars_composite_any.dta not found)
file ./output/tv_vars_composite_any.dta saved

. 
. * COVID death - covid code in any position
. use ./output/tv_severe_disease, clear 

. tvc_merge start stop using ./output/tv_covid_vacc_first, id(patient_id)

. tvc_merge start stop using ./output/tv_liver_trans, id(patient_id)

. tvc_merge start stop using ./output/time_varying_udca_120, id(patient_id)

. tvc_merge start stop using ./output/tv_age, id(patient_id)

. tvc_merge start stop using ./output/tv_outcome_died_covid_any, id(patient_id)
>  failure(died_covid_any_flag)

. * Dummy drug data includes people not in cohort, so drop these - should not b
> e any in real data 
. drop if age_tv==.
(1,788 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [14,9974]                    units:  1
         unique values:  1,000                    missing .:  0/2,948

                  mean:   5016.34
              std. dev:   2867.64

           percentiles:        10%       25%       50%       75%       90%
                              1007    2535.5      5046      7520      9000

. * Check number of outcomes after merge 
. tab died_covid_any_flag, m

died_covid_ |
   any_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,783       94.40       94.40
          1 |        165        5.60      100.00
------------+-----------------------------------
      Total |      2,948      100.00

. missings report

Checking missings in all variables:
0 observations with missing values

. save ./output/tv_vars_died_covid_any, replace 
(note: file ./output/tv_vars_died_covid_any.dta not found)
file ./output/tv_vars_died_covid_any.dta saved

. 
. * COVID hospitalisation - covid code in any position
. use ./output/tv_severe_disease, clear 

. tvc_merge start stop using ./output/tv_covid_vacc_first, id(patient_id)

. tvc_merge start stop using ./output/tv_liver_trans, id(patient_id)

. tvc_merge start stop using ./output/time_varying_udca_120, id(patient_id)

. tvc_merge start stop using ./output/tv_age, id(patient_id)

. tvc_merge start stop using ./output/tv_outcome_hosp_any, id(patient_id) failu
> re(hosp_any_flag)

. * Check number of outcomes after merge 
. tab hosp_any_flag, m

hosp_any_fl |
         ag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,840       59.39       59.39
          1 |         46        0.96       60.35
          . |      1,896       39.65      100.00
------------+-----------------------------------
      Total |      4,782      100.00

. bys patient_id: egen total_hosp = total(hosp_any_flag)

. tab total_hosp

 total_hosp |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,572       95.61       95.61
          1 |        210        4.39      100.00
------------+-----------------------------------
      Total |      4,782      100.00

. * Dummy drug data includes people not in cohort, so drop these - should not b
> e any in real data 
. drop if age_tv==.
(1,788 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [14,9974]                    units:  1
         unique values:  1,000                    missing .:  0/2,994

                  mean:   5019.63
              std. dev:    2871.8

           percentiles:        10%       25%       50%       75%       90%
                              1007      2536      5046      7545      9000

. * Check number of outcomes after merge - there will be missings for rows afte
> r event
. tab hosp_any_flag, m 

hosp_any_fl |
         ag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,840       94.86       94.86
          1 |         46        1.54       96.39
          . |        108        3.61      100.00
------------+-----------------------------------
      Total |      2,994      100.00

. missings report

Checking missings in all variables:
108 observations with missing values

  +---------------------------+
  |                 # missing |
  |---------------------------|
  | hosp_any_flag         108 |
  +---------------------------+

. drop if hosp_any_flag==.
(108 observations deleted)

. save ./output/tv_vars_hosp_any, replace 
(note: file ./output/tv_vars_hosp_any.dta not found)
file ./output/tv_vars_hosp_any.dta saved

. 
. /* Format file with static covariates: sex, region, covid high risk condition
> s, 
> ethnicity, imd, bmi, smoking. */
. 
. ** Need to decide on second line therapies 
. use `tempfile', clear

. describe 

Contains data from /tmp/St00015.000001
  obs:         1,000                          
 vars:           106                          18 Aug 2023 15:25
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
dereg_date      str10   %10s                  
has_pbc_date    int     %8.0g                 
has_psc_date    int     %8.0g                 
fu_liver_tran~d str10   %10s                  
fu_liver_tran~s str10   %10s                  
udca_last_date  str10   %10s                  
udca_first_af~r str10   %10s                  
udca_first_hi~y str10   %10s                  
covid_va~t_date str10   %10s                  
covid_vacc_se~e str10   %10s                  
covid_vacc_th~e str10   %10s                  
covid_vacc_fo~e str10   %10s                  
covid_~fth_date str10   %10s                  
severe_disea~ed str10   %10s                  
severe_disea~cd str10   %10s                  
solid_organ_t~m str10   %10s                  solid_organ_transplant_nhsd_snome
                                                > d
solid_organ_n~w str10   %10s                  
solid_organ_t~s byte    %8.0g                 solid_organ_transplant_nhsd_opcs4
transplant_al~4 byte    %8.0g                 
transplant_th~4 str10   %10s                  
transplant_co~p byte    %8.0g                 transplant_conjunctiva_y_code_opc
                                                > s4
transplant_co~4 str10   %10s                  
transplant_st~4 str10   %10s                  
transplant_il.. byte    %8.0g                 transplant_ileum_1_Y_codes_opcs4
transplant_il.. byte    %8.0g                 transplant_ileum_2_Y_codes_opcs4
transpl~1_opcs4 str10   %10s                  
transpl~2_opcs4 str10   %10s                  
hosp_covid_pr~y str10   %10s                  
hosp_covid_any  str10   %10s                  
died_date_ons   str10   %10s                  
age             byte    %8.0g                 
sex             str1    %9s                   
stp             str4    %9s                   
region_nhs      str24   %24s                  
has_msoa        byte    %8.0g                 
imd             byte    %8.0g                 
eth             byte    %8.0g                 
ethnicity_sus   byte    %8.0g                 
ethnicity       byte    %8.0g                 
smoking_status  str1    %9s                   
bmi             float   %9.0g                 
has_pbc         byte    %8.0g                 
has_psc         byte    %8.0g                 
liver_transpl~l byte    %8.0g                 
udca_count_bl   byte    %8.0g                 
udca_count_fu   byte    %8.0g                 
oca_bl          byte    %8.0g                 
budesonide_co~u byte    %8.0g                 
budesonide_co~l byte    %8.0g                 
fenofibrate_c~u byte    %8.0g                 
fenofibrate_c~l byte    %8.0g                 
gc_count_fu     byte    %8.0g                 
gc_count_bl     byte    %8.0g                 
rituximab_bl    byte    %8.0g                 
severe_diseas~l byte    %8.0g                 
learning_disa~d byte    %8.0g                 
cancer_opensa~d byte    %8.0g                 
cancer_opensa~w byte    %8.0g                 
cancer_opensa~r byte    %8.0g                 
haematopoieti~d byte    %8.0g                 
haematopoiet~10 byte    %8.0g                 
haematopoieti~4 byte    %8.0g                 
haematologica~m byte    %8.0g                 haematological_malignancies_snome
                                                > d
haematologica~1 byte    %8.0g                 haematological_malignancies_icd10
sickle_cell_d~d byte    %8.0g                 
sickle_cell_~10 byte    %8.0g                 
haematopoieti~_ byte    %8.0g                 haematopoietic_stem_cell_snomed_e
                                                > ver
haematopoie~0_e byte    %8.0g                 haematopoietic_stem_cell_icd10_ev
                                                > er
haematopoie~4_e byte    %8.0g                 haematopoietic_stem_cell_opcs4_ev
                                                > er
v70             byte    %8.0g                 haematological_malignancies_snome
                                                > d_ever
v71             byte    %8.0g                 haematological_malignancies_icd10
                                                > _ever
ckd_stage_5_~ed byte    %8.0g                 
ckd_stage_5_~10 byte    %8.0g                 
immunosuppres~d byte    %8.0g                 
oral_steroid_~d byte    %8.0g                 
oral_s~3m_count byte    %8.0g                 
oral_s~2m_count byte    %8.0g                 
immunosuppres~r byte    %8.0g                 
oral_steroid_~r byte    %8.0g                 
immunosupress~d byte    %8.0g                 
immunosupress~w byte    %8.0g                 
hiv_aids_nhsd~d byte    %8.0g                 
hiv_aids_nhs~10 byte    %8.0g                 
multiple_scl~ed byte    %8.0g                 
multiple_scl~10 byte    %8.0g                 
motor_neurone~e byte    %8.0g                 motor_neurone_disease_nhsd_snomed
motor_neuron~10 byte    %8.0g                 
myasthenia_g~ed byte    %8.0g                 
myasthenia_g~10 byte    %8.0g                 
huntingtons_~ed byte    %8.0g                 
huntingtons_~10 byte    %8.0g                 
died_ons_covi~y byte    %8.0g                 
died_ons_covi~g byte    %8.0g                 
liver_transpl~e str10   %10s                  
severe_diseas~e str10   %10s                  
haematologica~d byte    %8.0g                 
haematologica~r byte    %8.0g                 
ckd_stage_5_~sd byte    %8.0g                 
hiv_aids_nhsd   byte    %8.0g                 
solid_organ_t~d str10   %10s                  
solid_organ_t~w str10   %10s                  
multiple_scl~sd byte    %8.0g                 
motor_neurone~d byte    %8.0g                 
myasthenia_g~sd byte    %8.0g                 
huntingtons_~sd byte    %8.0g                 
patient_id      int     %8.0g                 
-------------------------------------------------------------------------------
Sorted by: 

. * Format variables 
. * Sex
. gen male = 1 if sex == "M"
(493 missing values generated)

. replace male = 0 if sex == "F"
(478 real changes made)

. * Ethnicity
. replace ethnicity=6 if ethnicity==0
(41 real changes made)

. label define eth5                       1 "White"                            
>            ///
>                             2 "Mixed"                           ///          
>                                    
>                             3 "Asian"                                   ///
>                             4 "Black"                                   ///
>                             5 "Other"                                   ///
>                             6 "Unknown"

.                     
. 
. label values ethnicity eth5

. safetab ethnicity, m
10

  ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |        152       15.20       15.20
      Mixed |        190       19.00       34.20
      Asian |        199       19.90       54.10
      Black |        218       21.80       75.90
      Other |        200       20.00       95.90
    Unknown |         41        4.10      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. * Create White vs non-White ethnicity variable
. gen eth_bin = (ethnicity!=1)

. tab eth_bin ethnicity, m 

           |                       ethnicity
   eth_bin |     White      Mixed      Asian      Black      Other |     Total
-----------+-------------------------------------------------------+----------
         0 |       152          0          0          0          0 |       152 
         1 |         0        190        199        218        200 |       848 
-----------+-------------------------------------------------------+----------
     Total |       152        190        199        218        200 |     1,000 


           | ethnicity
   eth_bin |   Unknown |     Total
-----------+-----------+----------
         0 |         0 |       152 
         1 |        41 |       848 
-----------+-----------+----------
     Total |        41 |     1,000 

. label define eth2 0 "White" 1 "Non-White"

. label values eth_bin eth2 

. 
. * IMD - should not be missing (i.e. 0) in real data
. replace imd=6 if imd==0
(45 real changes made)

. 
. * BMI categories
. egen bmi_cat = cut(bmi), at(0, 1, 18.5, 24.9, 29.9, 39.9, 100) icodes

. bys bmi_cat: sum bmi

-------------------------------------------------------------------------------
-> bmi_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        199           0           0          0          0

-------------------------------------------------------------------------------
-> bmi_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        125     13.9534    3.574112   2.749661   18.48268

-------------------------------------------------------------------------------
-> bmi_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        189    22.12708    1.835691   18.51279     24.833

-------------------------------------------------------------------------------
-> bmi_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        188    27.41659    1.492979   24.92099   29.88993

-------------------------------------------------------------------------------
-> bmi_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        260    34.19291    2.795426   29.90575   39.78086

-------------------------------------------------------------------------------
-> bmi_cat = 5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |         39    42.76828    2.615726   39.90075   51.95408


. * assume missing . is healthy range BMI
. replace bmi_cat = 2 if bmi_cat==. 
(0 real changes made)

. label define bmi 1 "Underweight" 2 "Healthy range" 3 "Overweight" 4 "Obese" 5
>  "Morbidly obese"

. label values bmi_cat bmi

. 
. * Smoking status - assume missings are non-smokers 
. gen smoking = 0 if smoking_status=="N"
(903 missing values generated)

. replace smoking = 1 if smoking_status=="S"
(219 real changes made)

. replace smoking = 2 if smoking_status=="E"
(128 real changes made)

. replace smoking = 1 if smoking==.
(556 real changes made)

. label define smok 1 "Current smoker" 2 "Ex-smoker" 0 "Never smoked" 

. label values smoking smok

. 
. * High risk covid conditions
. replace oral_steroid_drugs_nhsd=. if oral_steroid_drug_nhsd_3m_count < 2 & or
> al_steroid_drug_nhsd_12m_count < 4
(934 real changes made, 934 to missing)

. gen imid_nhsd=max(oral_steroid_drugs_nhsd, immunosuppresant_drugs_nhsd)

. gen rare_neuro_nhsd = max(multiple_sclerosis_nhsd, motor_neurone_disease_nhsd
> , myasthenia_gravis_nhsd, huntingtons_disease_nhsd)

. gen solid_organ_transplant_bin = solid_organ_transplant_nhsd_new!=""

. gen any_high_risk_condition = max(learning_disability_nhsd_snomed, cancer_ope
> nsafely_snomed_new, haematological_disease_nhsd, ///
> ckd_stage_5_nhsd, imid_nhsd, immunosupression_nhsd_new, hiv_aids_nhsd, solid_
> organ_transplant_bin, rare_neuro_nhsd)

. 
. keep patient_id male stp any_high_risk_condition ethnicity imd bmi_cat smokin
> g 

. 
. foreach var in died_covid_any hosp_any composite_any {
  2.     preserve 
  3.     merge 1:m patient_id using ./output/tv_vars_`var' 
  4.     drop _merge 
  5.     save ./output/an_dataset_`var', replace
  6.     restore
  7. }

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,948  (_merge==3)
    -----------------------------------------
(note: file ./output/an_dataset_died_covid_any.dta not found)
file ./output/an_dataset_died_covid_any.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,886  (_merge==3)
    -----------------------------------------
(note: file ./output/an_dataset_hosp_any.dta not found)
file ./output/an_dataset_hosp_any.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,886  (_merge==3)
    -----------------------------------------
(note: file ./output/an_dataset_composite_any.dta not found)
file ./output/an_dataset_composite_any.dta saved

. 
. log close 
      name:  <unnamed>
       log:  /workspace/logs/time_varying.log
  log type:  text
 closed on:  18 Aug 2023, 15:25:42
-------------------------------------------------------------------------------
