
. 
. tempfile tempfile 

. import delimited using ./output/input_pbc.csv
(109 vars, 1,000 obs)

. describe

Contains data
  obs:         1,000                          
 vars:           109                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
dereg_date      str10   %10s                  
has_pbc_date    int     %8.0g                 
has_psc_date    int     %8.0g                 
fu_liver_tran~d str10   %10s                  
fu_liver_tran~s str10   %10s                  
udca_last_date  str10   %10s                  
udca_first_af~r str10   %10s                  
udca_first_hi~y str10   %10s                  
covid_va~t_date str10   %10s                  
covid_vacc_se~e str10   %10s                  
covid_vacc_th~e str10   %10s                  
covid_vacc_fo~e str10   %10s                  
covid_~fth_date str10   %10s                  
date_most_rec~c str10   %10s                  
severe_disea~ed str10   %10s                  
severe_disea~cd str10   %10s                  
solid_organ_t~m str10   %10s                  solid_organ_transplant_nhsd_snome
                                                > d
solid_organ_n~w str10   %10s                  
solid_organ_t~s byte    %8.0g                 solid_organ_transplant_nhsd_opcs4
transplant_al~4 byte    %8.0g                 
transplant_th~4 str10   %10s                  
transplant_co~p byte    %8.0g                 transplant_conjunctiva_y_code_opc
                                                > s4
transplant_co~4 str10   %10s                  
transplant_st~4 str10   %10s                  
transplant_il.. byte    %8.0g                 transplant_ileum_1_Y_codes_opcs4
transplant_il.. byte    %8.0g                 transplant_ileum_2_Y_codes_opcs4
transpl~1_opcs4 str10   %10s                  
transpl~2_opcs4 str10   %10s                  
hosp_covid_pr~y str10   %10s                  
hosp_covid_any  str10   %10s                  
died_date_ons   str10   %10s                  
age             int     %8.0g                 
sex             str1    %9s                   
stp             str4    %9s                   
region_nhs      str24   %24s                  
has_msoa        byte    %8.0g                 
imd             byte    %8.0g                 
eth             byte    %8.0g                 
ethnicity_sus   byte    %8.0g                 
ethnicity       byte    %8.0g                 
smoking_status  str1    %9s                   
bmi             float   %9.0g                 
has_pbc         byte    %8.0g                 
has_psc         byte    %8.0g                 
liver_transpl~l byte    %8.0g                 
udca_count_bl   byte    %8.0g                 
udca_count_fu   byte    %8.0g                 
oca_bl          byte    %8.0g                 
budesonide_co~u byte    %8.0g                 
budesonide_co~l byte    %8.0g                 
fenofibrate_c~u byte    %8.0g                 
fenofibrate_c~l byte    %8.0g                 
gc_count_fu     byte    %8.0g                 
gc_count_bl     byte    %8.0g                 
rituximab_bl    byte    %8.0g                 
severe_diseas~l byte    %8.0g                 
learning_disa~d byte    %8.0g                 
cancer_opensa~d byte    %8.0g                 
cancer_opensa~w byte    %8.0g                 
cancer_opensa~r byte    %8.0g                 
haematopoieti~d byte    %8.0g                 
haematopoiet~10 byte    %8.0g                 
haematopoieti~4 byte    %8.0g                 
haematologica~m byte    %8.0g                 haematological_malignancies_snome
                                                > d
haematologica~1 byte    %8.0g                 haematological_malignancies_icd10
sickle_cell_d~d byte    %8.0g                 
sickle_cell_~10 byte    %8.0g                 
haematopoieti~_ byte    %8.0g                 haematopoietic_stem_cell_snomed_e
                                                > ver
haematopoie~0_e byte    %8.0g                 haematopoietic_stem_cell_icd10_ev
                                                > er
haematopoie~4_e byte    %8.0g                 haematopoietic_stem_cell_opcs4_ev
                                                > er
v71             byte    %8.0g                 haematological_malignancies_snome
                                                > d_ever
v72             byte    %8.0g                 haematological_malignancies_icd10
                                                > _ever
ckd_stage_5_~ed byte    %8.0g                 
ckd_stage_5_~10 byte    %8.0g                 
immunosuppres~d byte    %8.0g                 
oral_steroid_~d byte    %8.0g                 
oral_s~3m_count byte    %8.0g                 
oral_s~2m_count byte    %8.0g                 
immunosuppres~r byte    %8.0g                 
oral_steroid_~r byte    %8.0g                 
immunosupress~d byte    %8.0g                 
immunosupress~w byte    %8.0g                 
hiv_aids_nhsd~d byte    %8.0g                 
hiv_aids_nhs~10 byte    %8.0g                 
multiple_scl~ed byte    %8.0g                 
multiple_scl~10 byte    %8.0g                 
motor_neurone~e byte    %8.0g                 motor_neurone_disease_nhsd_snomed
motor_neuron~10 byte    %8.0g                 
myasthenia_g~ed byte    %8.0g                 
myasthenia_g~10 byte    %8.0g                 
huntingtons_~ed byte    %8.0g                 
huntingtons_~10 byte    %8.0g                 
died_ons_live~y byte    %8.0g                 
died_ons_live~g byte    %8.0g                 
died_ons_covi~y byte    %8.0g                 
died_ons_covi~g byte    %8.0g                 
liver_transpl~e str10   %10s                  
severe_diseas~e str10   %10s                  
haematologica~d byte    %8.0g                 
haematologica~r byte    %8.0g                 
ckd_stage_5_~sd byte    %8.0g                 
hiv_aids_nhsd   byte    %8.0g                 
solid_organ_t~d str10   %10s                  
solid_organ_t~w str10   %10s                  
multiple_scl~sd byte    %8.0g                 
motor_neurone~d byte    %8.0g                 
myasthenia_g~sd byte    %8.0g                 
huntingtons_~sd byte    %8.0g                 
patient_id      int     %8.0g                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. save `tempfile' 
file /tmp/St00015.000001 saved

. 
. /* Time-varying covariates are assessed 6-monthly and at time of exposure swi
> tching.
> As disease severity, covid vaccination and liver transplant will only switch 
> once need to identify
> nearest date after date identified in study definition */ 
. * 120 day file: primary exposure definition 
. use ./output/time_varying_udca_120, clear 

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [11,9999]                    units:  1
         unique values:  1,908                    missing .:  0/2,907

                  mean:   4951.88
              std. dev:   2881.91

           percentiles:        10%       25%       50%       75%       90%
                               869      2525      4998      7446      9010

. merge m:1 patient_id using `tempfile', keepusing(severe_disease_fu_date sever
> e_disease_bl covid_vacc_first_date liver_transplant_fu_date dereg_date died_d
> ate_ons)

    Result                           # of obs.
    -----------------------------------------
    not matched                         1,816
        from master                     1,816  (_merge==1)
        from using                          0  (_merge==2)

    matched                             1,091  (_merge==3)
    -----------------------------------------

. * Should only be required for dummy data 
. keep if _merge==3
(1,816 observations deleted)

. * Only using start date as this is when udca exposure or 6 monthly check occu
> rs
. drop stop

. * Add in rows with each of the 6 monthly assessment dates 
. gen expand=1

. bys patient_id (start): replace expand=6 if _n==_N 
(1000 real changes made)

. expand expand, generate(newv)
(5,000 observations created)

. bys patient_id newv: gen number = _n 

. replace start = date("01/09/2020", "DMY") if newv==1 & number==1
(1,000 real changes made)

. replace start = date("01/03/2021", "DMY") if newv==1 & number==2
(1,000 real changes made)

. replace start = date("01/09/2021", "DMY") if newv==1 & number==3
(1,000 real changes made)

. replace start = date("01/03/2022", "DMY") if newv==1 & number==4
(1,000 real changes made)

. replace start = date("01/09/2022", "DMY") if newv==1 & number==5
(1,000 real changes made)

. 
. * This gives a file where start dates are either exposure switching or 6-mont
> ly assessment dates 
. * These will be used to determine the closest date to time-varying covariate 
> dates identified in study definition 
. sort patient_id start 

. drop newv

. 
. * Determine end of follow-up date
. gen dereg_dateA = date(dereg_date, "YMD")
(3,053 missing values generated)

. format %dD/N/CY dereg_dateA

. drop dereg_date

. gen died_dateA = date(died_date_ons, "YMD")
(3,049 missing values generated)

. format %dD/N/CY died_dateA

. drop died_date_ons

. gen end_study = date("31/12/2022", "DMY")

. egen end_date = rowmin(dereg_dateA end_study died_dateA)

. 
. * Take out assessments after end_date 
. drop if start>end_date
(1,969 observations deleted)

. 
. * Determine number of days between each covariate and dates of UDCA change or
>  6 monthly check date 
. bys patient_id (start): egen last_assess = max(start)

. * Format dates  and identify date nearest after covariate updates 
. foreach var in covid_vacc_first_date severe_disease_fu_date liver_transplant_
> fu_date {
  2.     gen `var'A = date(`var', "YMD")
  3.     format `var'A %dD/N/CY 
  4.     drop `var'
  5.     * time between date of record and change in covariate - positive value
> s are those where record starts after 
.     * covariate change date 
.     gen time_`var' = start - `var'A
  6.     * Set time variable for records prior to change as missing
.     replace time_`var'=. if time_`var'<0
  7.     * Check if any are on index date (1st March) potentially severe diseas
> e - not others
.     di "Number where time-varying update same as assessment date"
  8.     count if time_`var'==0
  9.     di "Number where time-varying update is 1st March 2020"
 10.     count if `var'A==date("01/03/2020", "DMY")
 11.     * Find earliest start date after covariate update
.     * Note: there are some changes that occur after the last available 6 mont
> h assessment or exposure change
.     bys patient_id (time_`var'): gen `var'_updateN = start[1] if `var'A!=. & 
> time_`var'!=.
 12.     * Spread to all rows for patient 
.     bys patient_id: egen `var'_update = max(`var'_updateN)
 13.     format `var'_update %dD/N/CY 
 14.     di "Number where new variable is prior to original variable (should be
>  0)"
 15.     count if `var'_update < `var'A
 16.     di "Number where time varying update is after last assessment date"
 17.     count if `var'A > last_assess & `var'A!=.  & last_assess==start
 18.     di "Number of time-varying changes originally" 
 19.     * Using last_assess==start to count patients rather than rows
.     count if `var'A!=. & last_assess==start 
 20.     di "Number of dates for time-varying update"
 21.     count if `var'_update!=. & last_assess==start & `var'A!=.
 22. }
(382 missing values generated)
(382 missing values generated)
(2,937 real changes made, 2,937 to missing)
Number where time-varying update same as assessment date
  2
Number where time-varying update is 1st March 2020
  0
(3,319 missing values generated)
(1868 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  508
Number of time-varying changes originally
  901
Number of dates for time-varying update
  393
(999 missing values generated)
(999 missing values generated)
(2,154 real changes made, 2,154 to missing)
Number where time-varying update same as assessment date
  2
Number where time-varying update is 1st March 2020
  0
(3,153 missing values generated)
(2218 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  404
Number of time-varying changes originally
  758
Number of dates for time-varying update
  354
(4,020 missing values generated)
(4,020 missing values generated)
(78 real changes made, 78 to missing)
Number where time-varying update same as assessment date
  0
Number where time-varying update is 1st March 2020
  0
(4,098 missing values generated)
(4065 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  12
Number of time-varying changes originally
  23
Number of dates for time-varying update
  11

. * For severe disease only update variable if no severe disease at baseline 
. count if severe_disease_fu_date_update==date("01/03/2020", "DMY") & severe_di
> sease_bl!=1 
  0

. tab severe_disease_bl

severe_dise |
     ase_bl |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,099       50.92       50.92
          1 |      2,023       49.08      100.00
------------+-----------------------------------
      Total |      4,122      100.00

. replace severe_disease_fu_date_update = . if severe_disease_bl==1
(916 real changes made, 916 to missing)

. 
. * Keep only change dates to create time-varying dataset
. keep patient_id covid_vacc_first_date_update severe_disease_fu_date_update li
> ver_transplant_fu_date_update severe_disease_bl end_date

. * Chercking number of patient_id's 
. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [11,9999]                    units:  1
         unique values:  1,000                    missing .:  0/4,122

                  mean:   4859.09
              std. dev:   2809.47

           percentiles:        10%       25%       50%       75%       90%
                               830      2622      4777      7109      8828

. duplicates drop 

Duplicates in terms of all variables

(3,122 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [11,9999]                    units:  1
         unique values:  1,000                    missing .:  0/1,000

                  mean:   4960.93
              std. dev:   2827.87

           percentiles:        10%       25%       50%       75%       90%
                               874    2696.5      5015    7356.5      8946

. count
  1,000

. * Create file for each covariate to merge onto udca exposure file 
. * First covid vaccination and liver transplant as all people will begin at ze
> ro 
. rename liver_transplant_fu_date_update liver_trans_date_update

. foreach var in covid_vacc_first liver_trans {
  2.     preserve
  3.     keep patient_id `var'_date_update end_date
  4.     * Drop updates after the end of follow-up 
.     count if `var'_date>=end_date 
  5.     replace `var'_date = . if `var'_date>=end_date 
  6.     * Flag if variable is updated
.     gen `var'=(`var'_date_update!=.)
  7.     * Create extra row if variable is updated 
.     gen expand = `var'+1
  8.     tab expand
  9.     expand expand, gen(newv)
 10.     * Update variables so row for when zero and row for when updated - if 
> not updated whole time will be zero 
.     gen start = date("01/03/2020", "DMY") if newv==0
 11.     replace start = `var'_date_update if newv==1
 12.     gen stop = `var'_date_update if newv==0
 13.     replace stop = end_date if stop==.
 14.     replace `var'=0 if newv==0
 15.     save ./output/tv_`var'_check, replace
 16.     keep patient_id `var' start stop
 17.     * Check data 
.     count if start==stop 
 18.     * drop where start is same as stop - should not drop any in real data 
.     drop if start==stop 
 19.     count if stop<start
 20.     codebook patient_id
 21.     save ./output/tv_`var', replace
 22.     restore
 23. }
  607
(0 real changes made)

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        607       60.70       60.70
          2 |        393       39.30      100.00
------------+-----------------------------------
      Total |      1,000      100.00
(393 observations created)
(393 missing values generated)
(393 real changes made)
(1,000 missing values generated)
(1,000 real changes made)
(393 real changes made)
(note: file ./output/tv_covid_vacc_first_check.dta not found)
file ./output/tv_covid_vacc_first_check.dta saved
  0
(0 observations deleted)
  0

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [11,9999]                    units:  1
         unique values:  1,000                    missing .:  0/1,393

                  mean:    4908.6
              std. dev:   2837.45

           percentiles:        10%       25%       50%       75%       90%
                               842      2596      4971      7261      8933
(note: file ./output/tv_covid_vacc_first.dta not found)
file ./output/tv_covid_vacc_first.dta saved
  989
(0 real changes made)

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        989       98.90       98.90
          2 |         11        1.10      100.00
------------+-----------------------------------
      Total |      1,000      100.00
(11 observations created)
(11 missing values generated)
(11 real changes made)
(1,000 missing values generated)
(1,000 real changes made)
(11 real changes made)
(note: file ./output/tv_liver_trans_check.dta not found)
file ./output/tv_liver_trans_check.dta saved
  0
(0 observations deleted)
  0

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [11,9999]                    units:  1
         unique values:  1,000                    missing .:  0/1,011

                  mean:   4959.79
              std. dev:   2837.05

           percentiles:        10%       25%       50%       75%       90%
                               872      2692      4992      7375      8959
(note: file ./output/tv_liver_trans.dta not found)
file ./output/tv_liver_trans.dta saved

. 
. * Same for liver disease severity, but variable can start at 1 and remain for
>  whole of follow-up 
. preserve

. keep patient_id severe_disease_fu_date_update end_date severe_disease_bl

. * Drop updates after the end of follow-up 
. replace severe_disease_fu_date_update=. if severe_disease_fu_date_update>=end
> _date 
(0 real changes made)

. * Flag if variable is updated
. gen severe_disease=(severe_disease_fu_date_update!=.)

. tab severe_disease 

severe_dise |
        ase |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        815       81.50       81.50
          1 |        185       18.50      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. replace severe_disease = 0 if severe_disease_bl==1
(0 real changes made)

. * Create extra row if variable is updated 
. gen expand = severe_disease + 1

. tab expand

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        815       81.50       81.50
          2 |        185       18.50      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. expand expand, gen(newv)
(185 observations created)

. tab newv

       newv |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,000       84.39       84.39
          1 |        185       15.61      100.00
------------+-----------------------------------
      Total |      1,185      100.00

. * Update variables so row for when zero and row for when updated - if not upd
> ated whole time will be zero 
. gen start = date("01/03/2020", "DMY") if newv==0
(185 missing values generated)

. replace start = severe_disease_fu_date_update if newv==1
(185 real changes made)

. gen stop = severe_disease_fu_date_update if newv==0 & severe_disease==1
(1,000 missing values generated)

. count if stop!=.
  185

. replace stop = end_date if stop==. 
(1,000 real changes made)

. count if stop==.
  0

. replace severe_disease=0 if newv==0 & severe_disease_bl==0
(185 real changes made)

. replace severe_disease=1 if newv==0 & severe_disease_bl==1
(500 real changes made)

. save ./output/tv_severe_disease_check, replace
(note: file ./output/tv_severe_disease_check.dta not found)
file ./output/tv_severe_disease_check.dta saved

. keep patient_id severe_disease start stop

. * Check data 
. count if start==stop
  0

. * drop if start is same as stop - should not drop any in real data 
. drop if start==stop 
(0 observations deleted)

. count if stop<start
  0

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [11,9999]                    units:  1
         unique values:  1,000                    missing .:  0/1,185

                  mean:   4911.64
              std. dev:   2837.23

           percentiles:        10%       25%       50%       75%       90%
                               837      2607      4971      7295      8853

. save ./output/tv_severe_disease, replace
(note: file ./output/tv_severe_disease.dta not found)
file ./output/tv_severe_disease.dta saved

. restore

. 
. * Make age time-varying i.e. updating on 1st January each year
. use `tempfile', clear 

. * Determine end of follow-up date
. gen dereg_dateA = date(dereg_date, "YMD")
(500 missing values generated)

. format %dD/N/CY dereg_dateA

. drop dereg_date

. gen died_dateA = date(died_date_ons, "YMD")
(500 missing values generated)

. format %dD/N/CY died_dateA

. drop died_date_ons

. * Determine end of follow-up then add rows to update age for each year of fol
> low-up
. gen end_study = date("31/12/2022", "DMY")

. egen end_date = rowmin(dereg_dateA end_study died_dateA)

. keep patient_id age end_date

. gen yr_end = year(end_date)

. * Add rows to update age
. gen expand = 3 if yr_end==2022
(481 missing values generated)

. replace expand = 2 if yr_end==2021
(236 real changes made)

. replace expand = 1 if yr_end==2020
(245 real changes made)

. tab expand, m

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        245       24.50       24.50
          2 |        236       23.60       48.10
          3 |        519       51.90      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. expand expand, gen(newv)
(1,274 observations created)

. tab newv, nolabel

       newv |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,000       43.98       43.98
          1 |      1,274       56.02      100.00
------------+-----------------------------------
      Total |      2,274      100.00

. bys patient_id newv: gen number = _n 

. tab newv number, nolabel

           |        number
      newv |         1          2 |     Total
-----------+----------------------+----------
         0 |     1,000          0 |     1,000 
         1 |       755        519 |     1,274 
-----------+----------------------+----------
     Total |     1,755        519 |     2,274 

. gen start = date("01/03/2020", "DMY") if newv==0
(1,274 missing values generated)

. replace start = date("01/01/2021", "DMY") if newv==1 & number==1
(755 real changes made)

. replace start = date("01/01/2022", "DMY") if newv==1 & number==2
(519 real changes made)

. gen stop = date("01/01/2021", "DMY") if newv==0 
(1,274 missing values generated)

. replace stop = end_date if newv==0 & end_date<stop 
(245 real changes made)

. replace stop = date("01/01/2022", "DMY") if newv==1 & number==1 
(755 real changes made)

. replace stop = end_date if newv==1 & number==1 & end_date<stop
(236 real changes made)

. replace stop = date("31/12/2022", "DMY") if newv==1 & number==2 
(519 real changes made)

. replace stop = end_date if newv==1 & number==2 & end_date<stop
(190 real changes made)

. gen age_tv = age if newv==0
(1,274 missing values generated)

. replace age_tv = age+1 if newv==1 & number==1
(755 real changes made)

. replace age_tv = age+2 if newv==1 & number==2
(519 real changes made)

. keep patient_id start stop age_tv 

. drop if start==stop
(4 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [11,9999]                    units:  1
         unique values:  1,000                    missing .:  0/2,270

                  mean:   4892.88
              std. dev:   2817.34

           percentiles:        10%       25%       50%       75%       90%
                             839.5      2630      4902      7216    8879.5

. save ./output/tv_age, replace 
(note: file ./output/tv_age.dta not found)
file ./output/tv_age.dta saved

. 
. * COVID waves 
. use `tempfile', clear

. * Determine end of follow-up date
. gen dereg_dateA = date(dereg_date, "YMD")
(500 missing values generated)

. format %dD/N/CY dereg_dateA

. drop dereg_date

. gen died_date_onsA = date(died_date_ons, "YMD")
(500 missing values generated)

. format %dD/N/CY died_date_onsA

. drop died_date_ons

. * Determine end of follow-up then add rows to update waves 
. gen end_study = date("31/12/2022", "DMY")

. egen end_date = rowmin(dereg_dateA end_study died_date_onsA)

. gen expand = 1 if end_date <= date("31/08/2020", "DMY")
(844 missing values generated)

. replace expand = 2 if end_date <= date("30/06/2021", "DMY") & expand==.
(217 real changes made)

. replace expand = 3 if end_date <= date("30/11/2021", "DMY") & expand==.
(87 real changes made)

. replace expand = 4 if end_date <= date("31/12/2022", "DMY") & expand==.
(540 real changes made)

. tab expand 

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        156       15.60       15.60
          2 |        217       21.70       37.30
          3 |         87        8.70       46.00
          4 |        540       54.00      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. keep patient_id expand end_date

. expand expand, gen(newv) 
(2,011 observations created)

. tab newv 

       newv |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,000       33.21       33.21
          1 |      2,011       66.79      100.00
------------+-----------------------------------
      Total |      3,011      100.00

. bys patient_id newv: gen number = _n 

. * wave 1 row 
. gen start = date("01/03/2020", "DMY") if newv==0
(2,011 missing values generated)

. gen wave = 1 if newv==0
(2,011 missing values generated)

. gen stop = date("01/09/2020", "DMY") if newv==0 
(2,011 missing values generated)

. replace stop = end_date if end_date<stop & wave==1
(156 real changes made)

. tab expand if stop==end_date & wave==1

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        156      100.00      100.00
------------+-----------------------------------
      Total |        156      100.00

. * wave 2 row
. replace start = date("01/09/2020", "DMY") if newv==1 & number==1
(844 real changes made)

. replace wave = 2 if newv==1 & number==1
(844 real changes made)

. replace stop = date("01/07/2021", "DMY") if newv==1 & number==1
(844 real changes made)

. replace stop = end_date if end_date<stop & wave==2
(217 real changes made)

. * wave 3 row 
. replace start = date("01/07/2021", "DMY") if newv==1 & number==2
(627 real changes made)

. replace wave = 3 if newv==1 & number==2
(627 real changes made)

. replace stop = date("01/12/2021", "DMY") if newv==1 & number==2
(627 real changes made)

. replace stop = end_date if end_date<stop & wave==3
(87 real changes made)

. * wave 4 row 
. replace start = date("01/12/2021", "DMY") if newv==1 & number==3
(540 real changes made)

. replace wave = 4 if newv==1 & number==3
(540 real changes made)

. replace stop = date("31/12/2022", "DMY") if newv==1 & number==3
(540 real changes made)

. replace stop = end_date if end_date<stop & wave==4
(211 real changes made)

. keep patient_id start stop wave

. drop if start==stop 
(4 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [11,9999]                    units:  1
         unique values:  1,000                    missing .:  0/3,007

                  mean:   4886.16
              std. dev:   2814.44

           percentiles:        10%       25%       50%       75%       90%
                               837      2630      4867      7210      8906

. save ./output/tv_waves, replace
(note: file ./output/tv_waves.dta not found)
file ./output/tv_waves.dta saved

. 
. * Create files for outcomes
. use `tempfile', clear

. * Determine end of follow-up date
. foreach var in died_date_ons hosp_covid_primary hosp_covid_any dereg_date {
  2.     gen `var'A = date(`var', "YMD")
  3.     format `var'A %dD/N/CY
  4.     drop `var'
  5.     gen yr_`var' = year(`var'A)
  6.     tab yr_`var'
  7.     replace `var'A=. if yr_`var'==2023
  8. }
(500 missing values generated)
(500 missing values generated)

yr_died_dat |
      e_ons |      Freq.     Percent        Cum.
------------+-----------------------------------
       2020 |        129       25.80       25.80
       2021 |        144       28.80       54.60
       2022 |        136       27.20       81.80
       2023 |         91       18.20      100.00
------------+-----------------------------------
      Total |        500      100.00
(91 real changes made, 91 to missing)
(900 missing values generated)
(900 missing values generated)

yr_hosp_cov |
 id_primary |      Freq.     Percent        Cum.
------------+-----------------------------------
       2020 |         30       30.00       30.00
       2021 |         25       25.00       55.00
       2022 |         23       23.00       78.00
       2023 |         22       22.00      100.00
------------+-----------------------------------
      Total |        100      100.00
(22 real changes made, 22 to missing)
(900 missing values generated)
(900 missing values generated)

yr_hosp_cov |
     id_any |      Freq.     Percent        Cum.
------------+-----------------------------------
       2020 |         22       22.00       22.00
       2021 |         32       32.00       54.00
       2022 |         28       28.00       82.00
       2023 |         18       18.00      100.00
------------+-----------------------------------
      Total |        100      100.00
(18 real changes made, 18 to missing)
(500 missing values generated)
(500 missing values generated)

yr_dereg_da |
         te |      Freq.     Percent        Cum.
------------+-----------------------------------
       2020 |        134       26.80       26.80
       2021 |        141       28.20       55.00
       2022 |        136       27.20       82.20
       2023 |         89       17.80      100.00
------------+-----------------------------------
      Total |        500      100.00
(89 real changes made, 89 to missing)

. gen end_study = date("31/12/2022", "DMY")

. egen end_date = rowmin(dereg_dateA end_study died_date_onsA)

. 
. * Create flag indicating reason for end of follow-up 
. gen end_date_flag = (end_date==dereg_dateA)

. replace end_date_flag = 2 if end_date==died_date_onsA
(344 real changes made)

. replace end_date_flag = 3 if end_date==end_study
(329 real changes made)

. replace died_date_onsA=. if end_date<died_date_onsA
(65 real changes made, 65 to missing)

. replace died_ons_covid_flag_any=0 if end_date<died_date_onsA & died_ons_covid
> _flag_any==1
(332 real changes made)

. replace hosp_covid_anyA=. if end_date<hosp_covid_anyA
(38 real changes made, 38 to missing)

. gen hosp_any_flag = hosp_covid_anyA!=.

. 
. * Composite outcome 
. gen hosp_died_composite = (died_ons_covid_flag_any==1 | hosp_any_flag==1)

. egen hosp_died_dateA = rowmin(died_date_onsA hosp_covid_anyA)
(625 missing values generated)

. replace hosp_died_dateA=. if hosp_died_composite==0
(171 real changes made, 171 to missing)

. 
. * Check how composite is made up 
. tab died_ons_covid_flag_any hosp_any_flag

died_ons_c |
ovid_flag_ |     hosp_any_flag
       any |         0          1 |     Total
-----------+----------------------+----------
         0 |       796         36 |       832 
         1 |       160          8 |       168 
-----------+----------------------+----------
     Total |       956         44 |     1,000 

. di "Number where composite date = death date only"
Number where composite date = death date only

. count if hosp_died_dateA==died_date_onsA & hosp_died_dateA!=. & hosp_died_dat
> eA!=hosp_covid_anyA
  160

. di "Number where composite = hospitalisation date only"
Number where composite = hospitalisation date only

. count if hosp_died_dateA==hosp_covid_anyA & hosp_died_dateA!=. & hosp_died_da
> teA!=died_date_onsA
  44

. di "Number where composite = both death and hospitalisation date 
Number where composite = both death and hospitalisation date

. count if hosp_died_dateA==died_date_onsA & hosp_died_dateA!=. & hosp_died_dat
> eA==hosp_covid_anyA
  0

. 
. * Make file for each outcome: covid death, hospitalisation and composite 
. * Files contain patient ID, start = start study, stop = either end date for p
> atient or date of outcome 
. * and flag for outcome 
. * COVID death - covid code in any position
. preserve 

. keep patient_id end_date died_ons_covid_flag_any died_date_onsA

. gen start = date("01/03/2020", "DMY")

. egen stop = rowmin(died_date_onsA end_date)

. count if died_ons_covid_flag_any ==1 & end_date<died_date_onsA
  0

. replace died_ons_covid_flag_any=0 if end_date<died_date_onsA
(0 real changes made)

. keep patient_id start stop died_ons_covid_flag_any

. rename died_ons_covid_flag_any died_covid_any_flag

. save ./output/tv_outcome_died_covid_any, replace 
(note: file ./output/tv_outcome_died_covid_any.dta not found)
file ./output/tv_outcome_died_covid_any.dta saved

. tab died_covid_any_flag, m

died_covid_ |
   any_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        832       83.20       83.20
          1 |        168       16.80      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [11,9999]                    units:  1
         unique values:  1,000                    missing .:  0/1,000

                  mean:   4960.93
              std. dev:   2827.87

           percentiles:        10%       25%       50%       75%       90%
                               874    2696.5      5015    7356.5      8946

. restore 

. 
. * Hospitalisation - covid code in any position
. preserve 

. keep patient_id end_date hosp_any_flag hosp_covid_anyA end_date_flag

. gen start = date("01/03/2020", "DMY")

. egen stop = rowmin(hosp_covid_anyA end_date)

. count if hosp_any_flag ==1 & end_date<hosp_covid_anyA
  0

. tab end_date_flag if hosp_any_flag ==1 & end_date<hosp_covid_anyA
no observations

. replace hosp_any_flag=0 if end_date<hosp_covid_anyA
(0 real changes made)

. keep patient_id start stop hosp_any_flag

. save ./output/tv_outcome_hosp_any, replace 
(note: file ./output/tv_outcome_hosp_any.dta not found)
file ./output/tv_outcome_hosp_any.dta saved

. tab hosp_any_flag, m

hosp_any_fl |
         ag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        956       95.60       95.60
          1 |         44        4.40      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [11,9999]                    units:  1
         unique values:  1,000                    missing .:  0/1,000

                  mean:   4960.93
              std. dev:   2827.87

           percentiles:        10%       25%       50%       75%       90%
                               874    2696.5      5015    7356.5      8946

. count
  1,000

. bys patient_id: egen total_hosp = total(hosp_any_flag)

. tab total_hosp

 total_hosp |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        956       95.60       95.60
          1 |         44        4.40      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. restore 

. 
. * Composite 
. preserve 

. keep patient_id hosp_died* end_date

. gen start = date("01/03/2020", "DMY")

. egen stop = rowmin(hosp_died_dateA end_date)

. count if hosp_died_composite==1 & end_date<hosp_died_dateA
  0

. replace hosp_died_composite=0 if end_date<hosp_died_dateA
(0 real changes made)

. keep patient_id start stop hosp_died_composite

. rename hosp_died_composite composite_any_flag

. save ./output/tv_outcome_composite_any, replace 
(note: file ./output/tv_outcome_composite_any.dta not found)
file ./output/tv_outcome_composite_any.dta saved

. tab composite_any_flag, m

composite_a |
    ny_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        796       79.60       79.60
          1 |        204       20.40      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [11,9999]                    units:  1
         unique values:  1,000                    missing .:  0/1,000

                  mean:   4960.93
              std. dev:   2827.87

           percentiles:        10%       25%       50%       75%       90%
                               874    2696.5      5015    7356.5      8946

. restore 

. 
. * Merge files together for each outcome
. * Composite  
. use ./output/tv_severe_disease, clear 

. tvc_merge start stop using ./output/tv_covid_vacc_first, id(patient_id)

. tvc_merge start stop using ./output/tv_liver_trans, id(patient_id)

. tvc_merge start stop using ./output/time_varying_udca_120, id(patient_id)

. tvc_merge start stop using ./output/tv_age, id(patient_id)

. tvc_merge start stop using ./output/tv_outcome_composite_any, id(patient_id) 
> failure(composite_any_flag)

. * Dummy drug data includes people not in cohort, so drop these - should not b
> e any in real data 
. drop if age_tv==.
(1,816 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [11,9999]                    units:  1
         unique values:  1,000                    missing .:  0/2,971

                  mean:   4869.29
              std. dev:   2833.32

           percentiles:        10%       25%       50%       75%       90%
                               822      2566      4856      7210      8906

. * Check number of outcomes after merge  - there will be missings for rows aft
> er event
. tab composite_any_flag, m

composite_a |
    ny_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,662       89.60       89.60
          1 |        204        6.87       96.47
          . |        105        3.53      100.00
------------+-----------------------------------
      Total |      2,971      100.00

. missings report

Checking missings in all variables:
105 observations with missing values

  +--------------------------------+
  |                      # missing |
  |--------------------------------|
  | composite_any_flag         105 |
  +--------------------------------+

. drop if composite_any_flag==.
(105 observations deleted)

. save ./output/tv_vars_composite_any, replace 
(note: file ./output/tv_vars_composite_any.dta not found)
file ./output/tv_vars_composite_any.dta saved

. 
. * COVID death - covid code in any position
. use ./output/tv_severe_disease, clear 

. tvc_merge start stop using ./output/tv_covid_vacc_first, id(patient_id)

. tvc_merge start stop using ./output/tv_liver_trans, id(patient_id)

. tvc_merge start stop using ./output/time_varying_udca_120, id(patient_id)

. tvc_merge start stop using ./output/tv_age, id(patient_id)

. tvc_merge start stop using ./output/tv_outcome_died_covid_any, id(patient_id)
>  failure(died_covid_any_flag)

. * Dummy drug data includes people not in cohort, so drop these - should not b
> e any in real data 
. drop if age_tv==.
(1,816 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [11,9999]                    units:  1
         unique values:  1,000                    missing .:  0/2,927

                  mean:   4865.83
              std. dev:   2833.26

           percentiles:        10%       25%       50%       75%       90%
                               822      2546      4856      7210      8906

. * Check number of outcomes after merge 
. tab died_covid_any_flag, m

died_covid_ |
   any_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,759       94.26       94.26
          1 |        168        5.74      100.00
------------+-----------------------------------
      Total |      2,927      100.00

. missings report

Checking missings in all variables:
0 observations with missing values

. save ./output/tv_vars_died_covid_any, replace 
(note: file ./output/tv_vars_died_covid_any.dta not found)
file ./output/tv_vars_died_covid_any.dta saved

. 
. * COVID hospitalisation - covid code in any position
. use ./output/tv_severe_disease, clear 

. tvc_merge start stop using ./output/tv_covid_vacc_first, id(patient_id)

. tvc_merge start stop using ./output/tv_liver_trans, id(patient_id)

. tvc_merge start stop using ./output/time_varying_udca_120, id(patient_id)

. tvc_merge start stop using ./output/tv_age, id(patient_id)

. tvc_merge start stop using ./output/tv_outcome_hosp_any, id(patient_id) failu
> re(hosp_any_flag)

. * Check number of outcomes after merge 
. tab hosp_any_flag, m

hosp_any_fl |
         ag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,822       58.95       58.95
          1 |         44        0.92       59.87
          . |      1,921       40.13      100.00
------------+-----------------------------------
      Total |      4,787      100.00

. bys patient_id: egen total_hosp = total(hosp_any_flag)

. tab total_hosp

 total_hosp |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,587       95.82       95.82
          1 |        200        4.18      100.00
------------+-----------------------------------
      Total |      4,787      100.00

. * Dummy drug data includes people not in cohort, so drop these - should not b
> e any in real data 
. drop if age_tv==.
(1,816 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [11,9999]                    units:  1
         unique values:  1,000                    missing .:  0/2,971

                  mean:   4869.29
              std. dev:   2833.32

           percentiles:        10%       25%       50%       75%       90%
                               822      2566      4856      7210      8906

. * Check number of outcomes after merge - there will be missings for rows afte
> r event
. tab hosp_any_flag, m 

hosp_any_fl |
         ag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,822       94.98       94.98
          1 |         44        1.48       96.47
          . |        105        3.53      100.00
------------+-----------------------------------
      Total |      2,971      100.00

. missings report

Checking missings in all variables:
105 observations with missing values

  +---------------------------+
  |                 # missing |
  |---------------------------|
  | hosp_any_flag         105 |
  +---------------------------+

. drop if hosp_any_flag==.
(105 observations deleted)

. save ./output/tv_vars_hosp_any, replace 
(note: file ./output/tv_vars_hosp_any.dta not found)
file ./output/tv_vars_hosp_any.dta saved

. 
. /* Format file with static covariates: sex, region, covid high risk condition
> s, 
> ethnicity, imd, bmi, smoking. */
. 
. ** Need to decide on second line therapies 
. use `tempfile', clear

. describe 

Contains data from /tmp/St00015.000001
  obs:         1,000                          
 vars:           109                          13 Oct 2023 13:55
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
dereg_date      str10   %10s                  
has_pbc_date    int     %8.0g                 
has_psc_date    int     %8.0g                 
fu_liver_tran~d str10   %10s                  
fu_liver_tran~s str10   %10s                  
udca_last_date  str10   %10s                  
udca_first_af~r str10   %10s                  
udca_first_hi~y str10   %10s                  
covid_va~t_date str10   %10s                  
covid_vacc_se~e str10   %10s                  
covid_vacc_th~e str10   %10s                  
covid_vacc_fo~e str10   %10s                  
covid_~fth_date str10   %10s                  
date_most_rec~c str10   %10s                  
severe_disea~ed str10   %10s                  
severe_disea~cd str10   %10s                  
solid_organ_t~m str10   %10s                  solid_organ_transplant_nhsd_snome
                                                > d
solid_organ_n~w str10   %10s                  
solid_organ_t~s byte    %8.0g                 solid_organ_transplant_nhsd_opcs4
transplant_al~4 byte    %8.0g                 
transplant_th~4 str10   %10s                  
transplant_co~p byte    %8.0g                 transplant_conjunctiva_y_code_opc
                                                > s4
transplant_co~4 str10   %10s                  
transplant_st~4 str10   %10s                  
transplant_il.. byte    %8.0g                 transplant_ileum_1_Y_codes_opcs4
transplant_il.. byte    %8.0g                 transplant_ileum_2_Y_codes_opcs4
transpl~1_opcs4 str10   %10s                  
transpl~2_opcs4 str10   %10s                  
hosp_covid_pr~y str10   %10s                  
hosp_covid_any  str10   %10s                  
died_date_ons   str10   %10s                  
age             int     %8.0g                 
sex             str1    %9s                   
stp             str4    %9s                   
region_nhs      str24   %24s                  
has_msoa        byte    %8.0g                 
imd             byte    %8.0g                 
eth             byte    %8.0g                 
ethnicity_sus   byte    %8.0g                 
ethnicity       byte    %8.0g                 
smoking_status  str1    %9s                   
bmi             float   %9.0g                 
has_pbc         byte    %8.0g                 
has_psc         byte    %8.0g                 
liver_transpl~l byte    %8.0g                 
udca_count_bl   byte    %8.0g                 
udca_count_fu   byte    %8.0g                 
oca_bl          byte    %8.0g                 
budesonide_co~u byte    %8.0g                 
budesonide_co~l byte    %8.0g                 
fenofibrate_c~u byte    %8.0g                 
fenofibrate_c~l byte    %8.0g                 
gc_count_fu     byte    %8.0g                 
gc_count_bl     byte    %8.0g                 
rituximab_bl    byte    %8.0g                 
severe_diseas~l byte    %8.0g                 
learning_disa~d byte    %8.0g                 
cancer_opensa~d byte    %8.0g                 
cancer_opensa~w byte    %8.0g                 
cancer_opensa~r byte    %8.0g                 
haematopoieti~d byte    %8.0g                 
haematopoiet~10 byte    %8.0g                 
haematopoieti~4 byte    %8.0g                 
haematologica~m byte    %8.0g                 haematological_malignancies_snome
                                                > d
haematologica~1 byte    %8.0g                 haematological_malignancies_icd10
sickle_cell_d~d byte    %8.0g                 
sickle_cell_~10 byte    %8.0g                 
haematopoieti~_ byte    %8.0g                 haematopoietic_stem_cell_snomed_e
                                                > ver
haematopoie~0_e byte    %8.0g                 haematopoietic_stem_cell_icd10_ev
                                                > er
haematopoie~4_e byte    %8.0g                 haematopoietic_stem_cell_opcs4_ev
                                                > er
v71             byte    %8.0g                 haematological_malignancies_snome
                                                > d_ever
v72             byte    %8.0g                 haematological_malignancies_icd10
                                                > _ever
ckd_stage_5_~ed byte    %8.0g                 
ckd_stage_5_~10 byte    %8.0g                 
immunosuppres~d byte    %8.0g                 
oral_steroid_~d byte    %8.0g                 
oral_s~3m_count byte    %8.0g                 
oral_s~2m_count byte    %8.0g                 
immunosuppres~r byte    %8.0g                 
oral_steroid_~r byte    %8.0g                 
immunosupress~d byte    %8.0g                 
immunosupress~w byte    %8.0g                 
hiv_aids_nhsd~d byte    %8.0g                 
hiv_aids_nhs~10 byte    %8.0g                 
multiple_scl~ed byte    %8.0g                 
multiple_scl~10 byte    %8.0g                 
motor_neurone~e byte    %8.0g                 motor_neurone_disease_nhsd_snomed
motor_neuron~10 byte    %8.0g                 
myasthenia_g~ed byte    %8.0g                 
myasthenia_g~10 byte    %8.0g                 
huntingtons_~ed byte    %8.0g                 
huntingtons_~10 byte    %8.0g                 
died_ons_live~y byte    %8.0g                 
died_ons_live~g byte    %8.0g                 
died_ons_covi~y byte    %8.0g                 
died_ons_covi~g byte    %8.0g                 
liver_transpl~e str10   %10s                  
severe_diseas~e str10   %10s                  
haematologica~d byte    %8.0g                 
haematologica~r byte    %8.0g                 
ckd_stage_5_~sd byte    %8.0g                 
hiv_aids_nhsd   byte    %8.0g                 
solid_organ_t~d str10   %10s                  
solid_organ_t~w str10   %10s                  
multiple_scl~sd byte    %8.0g                 
motor_neurone~d byte    %8.0g                 
myasthenia_g~sd byte    %8.0g                 
huntingtons_~sd byte    %8.0g                 
patient_id      int     %8.0g                 
-------------------------------------------------------------------------------
Sorted by: 

. * Format variables 
. * Sex
. gen male = 1 if sex == "M"
(529 missing values generated)

. replace male = 0 if sex == "F"
(521 real changes made)

. * Ethnicity
. replace ethnicity=6 if ethnicity==0
(46 real changes made)

. label define eth5                       1 "White"                            
>            ///
>                             2 "Mixed"                           ///          
>                                    
>                             3 "Asian"                                   ///
>                             4 "Black"                                   ///
>                             5 "Other"                                   ///
>                             6 "Unknown"

.                     
. 
. label values ethnicity eth5

. safetab ethnicity, m
10

  ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |        148       14.80       14.80
      Mixed |        227       22.70       37.50
      Asian |        198       19.80       57.30
      Black |        202       20.20       77.50
      Other |        179       17.90       95.40
    Unknown |         46        4.60      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. * Create White vs non-White ethnicity variable
. gen eth_bin = (ethnicity!=1)

. replace eth_bin = 2 if ethnicity==6
(46 real changes made)

. label define eth_3 0 "White" 1 "Non-White" 2 "Unknown"

. label values eth_bin eth_3

. tab eth_bin ethnicity, m 

           |                       ethnicity
   eth_bin |     White      Mixed      Asian      Black      Other |     Total
-----------+-------------------------------------------------------+----------
     White |       148          0          0          0          0 |       148 
 Non-White |         0        227        198        202        179 |       806 
   Unknown |         0          0          0          0          0 |        46 
-----------+-------------------------------------------------------+----------
     Total |       148        227        198        202        179 |     1,000 


           | ethnicity
   eth_bin |   Unknown |     Total
-----------+-----------+----------
     White |         0 |       148 
 Non-White |         0 |       806 
   Unknown |        46 |        46 
-----------+-----------+----------
     Total |        46 |     1,000 

. 
. 
. * IMD - should not be missing (i.e. 0) in real data
. replace imd=6 if imd==0
(48 real changes made)

. 
. * BMI categories
. * assume BMI's less than 10 are incorrect and set to missing 
. sum bmi, d 

                             bmi
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,000
25%      15.4891              0       Sum of Wgt.       1,000

50%     25.43214                      Mean           22.40135
                        Largest       Std. Dev.      13.42107
75%     31.69942       50.25244
90%     37.29521       50.35303       Variance       180.1252
95%     41.18578       51.49513       Skewness      -.4851032
99%     47.01512       53.41359       Kurtosis       2.249944

. replace bmi = . if bmi<10
(215 real changes made, 215 to missing)

. egen bmi_cat = cut(bmi), at(0, 1, 18.5, 24.9, 29.9, 39.9, 100) icodes
(215 missing values generated)

. bys bmi_cat: sum bmi

-------------------------------------------------------------------------------
-> bmi_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |         86    15.44256    2.318497   10.12581   18.46173

-------------------------------------------------------------------------------
-> bmi_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        176     22.0555     1.77011   18.53902   24.89156

-------------------------------------------------------------------------------
-> bmi_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        196     27.4264    1.535379   24.91004   29.87786

-------------------------------------------------------------------------------
-> bmi_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        261    33.74903    2.795805   29.92882   39.85234

-------------------------------------------------------------------------------
-> bmi_cat = 5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |         66    43.64735    3.044821   40.09995   53.41359

-------------------------------------------------------------------------------
-> bmi_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |          0


. * assume missing . is healthy range BMI
. replace bmi_cat = 2 if bmi_cat==. 
(215 real changes made)

. label define bmi 1 "Underweight" 2 "Healthy range" 3 "Overweight" 4 "Obese" 5
>  "Morbidly obese"

. label values bmi_cat bmi

. tab bmi_cat 

       bmi_cat |      Freq.     Percent        Cum.
---------------+-----------------------------------
   Underweight |         86        8.60        8.60
 Healthy range |        391       39.10       47.70
    Overweight |        196       19.60       67.30
         Obese |        261       26.10       93.40
Morbidly obese |         66        6.60      100.00
---------------+-----------------------------------
         Total |      1,000      100.00

. 
. * Smoking status - assume missings are non-smokers 
. gen smoking = 0 if smoking_status=="N"
(887 missing values generated)

. replace smoking = 1 if smoking_status=="S"
(198 real changes made)

. replace smoking = 2 if smoking_status=="E"
(138 real changes made)

. replace smoking = 1 if smoking==.
(551 real changes made)

. label define smok 1 "Current smoker" 2 "Ex-smoker" 0 "Never smoked" 

. label values smoking smok

. tab smoking 

       smoking |      Freq.     Percent        Cum.
---------------+-----------------------------------
  Never smoked |        113       11.30       11.30
Current smoker |        749       74.90       86.20
     Ex-smoker |        138       13.80      100.00
---------------+-----------------------------------
         Total |      1,000      100.00

. 
. * High risk covid conditions
. replace oral_steroid_drugs_nhsd=. if oral_steroid_drug_nhsd_3m_count < 2 & or
> al_steroid_drug_nhsd_12m_count < 4
(935 real changes made, 935 to missing)

. gen imid_nhsd=max(oral_steroid_drugs_nhsd, immunosuppresant_drugs_nhsd)

. gen rare_neuro_nhsd = max(multiple_sclerosis_nhsd, motor_neurone_disease_nhsd
> , myasthenia_gravis_nhsd, huntingtons_disease_nhsd)

. gen solid_organ_transplant_bin = solid_organ_transplant_nhsd_new!=""

. gen any_high_risk_condition = max(learning_disability_nhsd_snomed, cancer_ope
> nsafely_snomed_new, haematological_disease_nhsd, ///
> ckd_stage_5_nhsd, imid_nhsd, immunosupression_nhsd_new, hiv_aids_nhsd, solid_
> organ_transplant_bin, rare_neuro_nhsd)

. 
. * Time from most recent vaccination on 1st March 2021
. gen date_most_recent_cov_vacA = date(date_most_recent_cov_vac, "YMD")
(941 missing values generated)

. gen time_vacc = date("01Mar2021", "DMY") - date_most_recent_cov_vacA
(941 missing values generated)

. sum time_vacc, d

                          time_vacc
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            6              1       Obs                  59
25%           21              3       Sum of Wgt.          59

50%           52                      Mean            47.0678
                        Largest       Std. Dev.      26.69681
75%           69             86
90%           83             86       Variance       712.7195
95%           86             88       Skewness      -.3075835
99%           89             89       Kurtosis       1.888884

. xtile time_vacc_cat = time_vacc, nq(4)

. replace time_vacc_cat = 5 if time_vacc_cat == .
(941 real changes made)

. bys time_vacc_cat: sum time_vacc 

-------------------------------------------------------------------------------
-> time_vacc_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   time_vacc |         15    9.933333    7.685484          1         21

-------------------------------------------------------------------------------
-> time_vacc_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   time_vacc |         15        40.4    9.424891         22         52

-------------------------------------------------------------------------------
-> time_vacc_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   time_vacc |         15        61.6    4.532423         54         69

-------------------------------------------------------------------------------
-> time_vacc_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   time_vacc |         14    78.42857    7.292929         71         89

-------------------------------------------------------------------------------
-> time_vacc_cat = 5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   time_vacc |          0


. label define vacc_t 1 "Q1 closest vaccination" 2 "Q2" 3 "Q3" 4 "Q4 furthest v
> accination" 5 "No vaccination" 

. label values time_vacc_cat vacc_t 

. 
. * Exploring death by liver disease 
. gen died_liver_any = died_ons_liver_flag_any==1 & died_ons_covid_flag_any!=1

. gen died_liver_underlying = died_ons_liver_flag_underlying==1 & died_ons_covi
> d_flag_any!=1

. 
. keep patient_id male stp any_high_risk_condition ethnicity imd bmi_cat smokin
> g eth_bin time_vacc_cat has_pbc oca_bl died_liver_any died_liver_underlying

. tempfile basefile

. save `basefile'
file /tmp/St00015.000008 saved

. foreach var in died_covid_any hosp_any composite_any {
  2.     preserve 
  3.     merge 1:m patient_id using ./output/tv_vars_`var' 
  4.     drop _merge 
  5.     save ./output/an_dataset_`var', replace
  6.     restore
  7. }

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,927  (_merge==3)
    -----------------------------------------
(note: file ./output/an_dataset_died_covid_any.dta not found)
file ./output/an_dataset_died_covid_any.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,866  (_merge==3)
    -----------------------------------------
(note: file ./output/an_dataset_hosp_any.dta not found)
file ./output/an_dataset_hosp_any.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,866  (_merge==3)
    -----------------------------------------
(note: file ./output/an_dataset_composite_any.dta not found)
file ./output/an_dataset_composite_any.dta saved

. 
. *****************************************
. * 90 day file: sensitivity analysis 
. use ./output/time_varying_udca_90, clear 

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [11,9999]                    units:  1
         unique values:  1,908                    missing .:  0/2,911

                  mean:   4955.41
              std. dev:    2882.9

           percentiles:        10%       25%       50%       75%       90%
                               872      2525      5007      7451      9010

. merge m:1 patient_id using `tempfile', keepusing(severe_disease_fu_date sever
> e_disease_bl covid_vacc_first_date liver_transplant_fu_date dereg_date died_d
> ate_ons)

    Result                           # of obs.
    -----------------------------------------
    not matched                         1,820
        from master                     1,820  (_merge==1)
        from using                          0  (_merge==2)

    matched                             1,091  (_merge==3)
    -----------------------------------------

. * Should only be required for dummy data 
. keep if _merge==3
(1,820 observations deleted)

. * Only using start date as this is when udca exposure or 6 monthly check occu
> rs
. drop stop

. * Add in rows with each of the 6 monthly assessment dates 
. gen expand=1

. bys patient_id (start): replace expand=6 if _n==_N 
(1000 real changes made)

. expand expand, generate(newv)
(5,000 observations created)

. bys patient_id newv: gen number = _n 

. replace start = date("01/09/2020", "DMY") if newv==1 & number==1
(1,000 real changes made)

. replace start = date("01/03/2021", "DMY") if newv==1 & number==2
(1,000 real changes made)

. replace start = date("01/09/2021", "DMY") if newv==1 & number==3
(1,000 real changes made)

. replace start = date("01/03/2022", "DMY") if newv==1 & number==4
(1,000 real changes made)

. replace start = date("01/09/2022", "DMY") if newv==1 & number==5
(1,000 real changes made)

. 
. * This gives a file where start dates are either exposure switching or 6-mont
> ly assessment dates 
. * These will be used to determine the closest date to time-varying covariate 
> dates identified in study definition 
. sort patient_id start 

. drop newv

. 
. * Determine end of follow-up date
. gen dereg_dateA = date(dereg_date, "YMD")
(3,053 missing values generated)

. format %dD/N/CY dereg_dateA

. drop dereg_date

. gen died_dateA = date(died_date_ons, "YMD")
(3,049 missing values generated)

. format %dD/N/CY died_dateA

. drop died_date_ons

. gen end_study = date("31/12/2022", "DMY")

. egen end_date = rowmin(dereg_dateA end_study died_dateA)

. 
. * Take out assessments after end_date 
. drop if start>end_date
(1,969 observations deleted)

. 
. * Determine number of days between each covariate and dates of UDCA change or
>  6 monthly check date 
. bys patient_id (start): egen last_assess = max(start)

. * Format dates  and identify date nearest after covariate updates 
. foreach var in covid_vacc_first_date severe_disease_fu_date liver_transplant_
> fu_date {
  2.     gen `var'A = date(`var', "YMD")
  3.     format `var'A %dD/N/CY 
  4.     drop `var'
  5.     * time between date of record and change in covariate - positive value
> s are those where record starts after 
.     * covariate change date 
.     gen time_`var' = start - `var'A
  6.     * Set time variable for records prior to change as missing
.     replace time_`var'=. if time_`var'<0
  7.     * Check if any are on index date (1st March) potentially severe diseas
> e - not others
.     di "Number where time-varying update same as assessment date"
  8.     count if time_`var'==0
  9.     di "Number where time-varying update is 1st March 2020"
 10.     count if `var'A==date("01/03/2020", "DMY")
 11.     * Find earliest start date after covariate update
.     * Note: there are some changes that occur after the last available 6 mont
> h assessment or exposure change
.     bys patient_id (time_`var'): gen `var'_updateN = start[1] if `var'A!=. & 
> time_`var'!=.
 12.     * Spread to all rows for patient 
.     bys patient_id: egen `var'_update = max(`var'_updateN)
 13.     format `var'_update %dD/N/CY 
 14.     di "Number where new variable is prior to original variable (should be
>  0)"
 15.     count if `var'_update < `var'A
 16.     di "Number where time varying update is after last assessment date"
 17.     count if `var'A > last_assess & `var'A!=.  & last_assess==start
 18.     di "Number of time-varying changes originally" 
 19.     * Using last_assess==start to count patients rather than rows
.     count if `var'A!=. & last_assess==start 
 20.     di "Number of dates for time-varying update"
 21.     count if `var'_update!=. & last_assess==start & `var'A!=.
 22. }
(382 missing values generated)
(382 missing values generated)
(2,937 real changes made, 2,937 to missing)
Number where time-varying update same as assessment date
  2
Number where time-varying update is 1st March 2020
  0
(3,319 missing values generated)
(1868 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  508
Number of time-varying changes originally
  901
Number of dates for time-varying update
  393
(999 missing values generated)
(999 missing values generated)
(2,154 real changes made, 2,154 to missing)
Number where time-varying update same as assessment date
  2
Number where time-varying update is 1st March 2020
  0
(3,153 missing values generated)
(2218 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  404
Number of time-varying changes originally
  758
Number of dates for time-varying update
  354
(4,020 missing values generated)
(4,020 missing values generated)
(78 real changes made, 78 to missing)
Number where time-varying update same as assessment date
  0
Number where time-varying update is 1st March 2020
  0
(4,098 missing values generated)
(4065 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  12
Number of time-varying changes originally
  23
Number of dates for time-varying update
  11

. * For severe disease only update variable if no severe disease at baseline 
. count if severe_disease_fu_date_update==date("01/03/2020", "DMY") & severe_di
> sease_bl!=1 
  0

. tab severe_disease_bl

severe_dise |
     ase_bl |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,099       50.92       50.92
          1 |      2,023       49.08      100.00
------------+-----------------------------------
      Total |      4,122      100.00

. replace severe_disease_fu_date_update = . if severe_disease_bl==1
(916 real changes made, 916 to missing)

. 
. * Keep only change dates to create time-varying dataset
. keep patient_id covid_vacc_first_date_update severe_disease_fu_date_update li
> ver_transplant_fu_date_update severe_disease_bl end_date

. * Chercking number of patient_id's 
. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [11,9999]                    units:  1
         unique values:  1,000                    missing .:  0/4,122

                  mean:   4859.09
              std. dev:   2809.47

           percentiles:        10%       25%       50%       75%       90%
                               830      2622      4777      7109      8828

. duplicates drop 

Duplicates in terms of all variables

(3,122 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [11,9999]                    units:  1
         unique values:  1,000                    missing .:  0/1,000

                  mean:   4960.93
              std. dev:   2827.87

           percentiles:        10%       25%       50%       75%       90%
                               874    2696.5      5015    7356.5      8946

. count
  1,000

. * Create file for each covariate to merge onto udca exposure file 
. * First covid vaccination and liver transplant as all people will begin at ze
> ro 
. rename liver_transplant_fu_date_update liver_trans_date_update

. foreach var in covid_vacc_first liver_trans {
  2.     preserve
  3.     keep patient_id `var'_date_update end_date
  4.     * Drop updates after the end of follow-up 
.     count if `var'_date>=end_date 
  5.     replace `var'_date = . if `var'_date>=end_date 
  6.     * Flag if variable is updated
.     gen `var'=(`var'_date_update!=.)
  7.     * Create extra row if variable is updated 
.     gen expand = `var'+1
  8.     tab expand
  9.     expand expand, gen(newv)
 10.     * Update variables so row for when zero and row for when updated - if 
> not updated whole time will be zero 
.     gen start = date("01/03/2020", "DMY") if newv==0
 11.     replace start = `var'_date_update if newv==1
 12.     gen stop = `var'_date_update if newv==0
 13.     replace stop = end_date if stop==.
 14.     replace `var'=0 if newv==0
 15.     save ./output/tv_`var'_check, replace
 16.     keep patient_id `var' start stop
 17.     * Check data 
.     count if start==stop 
 18.     * drop where start is same as stop - should not drop any in real data 
.     drop if start==stop 
 19.     count if stop<start
 20.     codebook patient_id
 21.     save ./output/tv_90_`var', replace
 22.     restore
 23. }
  607
(0 real changes made)

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        607       60.70       60.70
          2 |        393       39.30      100.00
------------+-----------------------------------
      Total |      1,000      100.00
(393 observations created)
(393 missing values generated)
(393 real changes made)
(1,000 missing values generated)
(1,000 real changes made)
(393 real changes made)
file ./output/tv_covid_vacc_first_check.dta saved
  0
(0 observations deleted)
  0

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [11,9999]                    units:  1
         unique values:  1,000                    missing .:  0/1,393

                  mean:    4908.6
              std. dev:   2837.45

           percentiles:        10%       25%       50%       75%       90%
                               842      2596      4971      7261      8933
(note: file ./output/tv_90_covid_vacc_first.dta not found)
file ./output/tv_90_covid_vacc_first.dta saved
  989
(0 real changes made)

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        989       98.90       98.90
          2 |         11        1.10      100.00
------------+-----------------------------------
      Total |      1,000      100.00
(11 observations created)
(11 missing values generated)
(11 real changes made)
(1,000 missing values generated)
(1,000 real changes made)
(11 real changes made)
file ./output/tv_liver_trans_check.dta saved
  0
(0 observations deleted)
  0

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [11,9999]                    units:  1
         unique values:  1,000                    missing .:  0/1,011

                  mean:   4959.79
              std. dev:   2837.05

           percentiles:        10%       25%       50%       75%       90%
                               872      2692      4992      7375      8959
(note: file ./output/tv_90_liver_trans.dta not found)
file ./output/tv_90_liver_trans.dta saved

. 
. * Same for liver disease severity, but variable can start at 1 and remain for
>  whole of follow-up 
. preserve

. keep patient_id severe_disease_fu_date_update end_date severe_disease_bl

. * Drop updates after the end of follow-up 
. replace severe_disease_fu_date_update=. if severe_disease_fu_date_update>=end
> _date 
(0 real changes made)

. * Flag if variable is updated
. gen severe_disease=(severe_disease_fu_date_update!=.)

. tab severe_disease 

severe_dise |
        ase |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        815       81.50       81.50
          1 |        185       18.50      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. replace severe_disease = 0 if severe_disease_bl==1
(0 real changes made)

. * Create extra row if variable is updated 
. gen expand = severe_disease + 1

. tab expand

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        815       81.50       81.50
          2 |        185       18.50      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. expand expand, gen(newv)
(185 observations created)

. tab newv

       newv |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,000       84.39       84.39
          1 |        185       15.61      100.00
------------+-----------------------------------
      Total |      1,185      100.00

. * Update variables so row for when zero and row for when updated - if not upd
> ated whole time will be zero 
. gen start = date("01/03/2020", "DMY") if newv==0
(185 missing values generated)

. replace start = severe_disease_fu_date_update if newv==1
(185 real changes made)

. gen stop = severe_disease_fu_date_update if newv==0 & severe_disease==1
(1,000 missing values generated)

. count if stop!=.
  185

. replace stop = end_date if stop==. 
(1,000 real changes made)

. count if stop==.
  0

. replace severe_disease=0 if newv==0 & severe_disease_bl==0
(185 real changes made)

. replace severe_disease=1 if newv==0 & severe_disease_bl==1
(500 real changes made)

. save ./output/tv_severe_disease_check, replace
file ./output/tv_severe_disease_check.dta saved

. keep patient_id severe_disease start stop

. * Check data 
. count if start==stop
  0

. * drop if start is same as stop - should not drop any in real data 
. drop if start==stop 
(0 observations deleted)

. count if stop<start
  0

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [11,9999]                    units:  1
         unique values:  1,000                    missing .:  0/1,185

                  mean:   4911.64
              std. dev:   2837.23

           percentiles:        10%       25%       50%       75%       90%
                               837      2607      4971      7295      8853

. save ./output/tv_90_severe_disease, replace
(note: file ./output/tv_90_severe_disease.dta not found)
file ./output/tv_90_severe_disease.dta saved

. restore

. 
. * Merge files together for each outcome
. * Composite  
. use ./output/tv_90_severe_disease, clear 

. tvc_merge start stop using ./output/tv_90_covid_vacc_first, id(patient_id)

. tvc_merge start stop using ./output/tv_90_liver_trans, id(patient_id)

. tvc_merge start stop using ./output/time_varying_udca_90, id(patient_id)

. tvc_merge start stop using ./output/tv_age, id(patient_id)

. tvc_merge start stop using ./output/tv_outcome_composite_any, id(patient_id) 
> failure(composite_any_flag)

. * Dummy drug data includes people not in cohort, so drop these - should not b
> e any in real data 
. drop if age_tv==.
(1,820 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [11,9999]                    units:  1
         unique values:  1,000                    missing .:  0/2,971

                  mean:   4869.29
              std. dev:   2833.32

           percentiles:        10%       25%       50%       75%       90%
                               822      2566      4856      7210      8906

. * Check number of outcomes after merge  - there will be missings for rows aft
> er event
. tab composite_any_flag, m

composite_a |
    ny_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,662       89.60       89.60
          1 |        204        6.87       96.47
          . |        105        3.53      100.00
------------+-----------------------------------
      Total |      2,971      100.00

. missings report

Checking missings in all variables:
105 observations with missing values

  +--------------------------------+
  |                      # missing |
  |--------------------------------|
  | composite_any_flag         105 |
  +--------------------------------+

. drop if composite_any_flag==.
(105 observations deleted)

. save ./output/tv_vars_90_composite_any, replace 
(note: file ./output/tv_vars_90_composite_any.dta not found)
file ./output/tv_vars_90_composite_any.dta saved

. 
. * COVID death - covid code in any position
. use ./output/tv_90_severe_disease, clear 

. tvc_merge start stop using ./output/tv_90_covid_vacc_first, id(patient_id)

. tvc_merge start stop using ./output/tv_90_liver_trans, id(patient_id)

. tvc_merge start stop using ./output/time_varying_udca_90, id(patient_id)

. tvc_merge start stop using ./output/tv_age, id(patient_id)

. tvc_merge start stop using ./output/tv_outcome_died_covid_any, id(patient_id)
>  failure(died_covid_any_flag)

. * Dummy drug data includes people not in cohort, so drop these - should not b
> e any in real data 
. drop if age_tv==.
(1,820 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [11,9999]                    units:  1
         unique values:  1,000                    missing .:  0/2,927

                  mean:   4865.83
              std. dev:   2833.26

           percentiles:        10%       25%       50%       75%       90%
                               822      2546      4856      7210      8906

. * Check number of outcomes after merge 
. tab died_covid_any_flag, m

died_covid_ |
   any_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,759       94.26       94.26
          1 |        168        5.74      100.00
------------+-----------------------------------
      Total |      2,927      100.00

. missings report

Checking missings in all variables:
0 observations with missing values

. save ./output/tv_vars_90_died_covid_any, replace 
(note: file ./output/tv_vars_90_died_covid_any.dta not found)
file ./output/tv_vars_90_died_covid_any.dta saved

. 
. * COVID hospitalisation - covid code in any position
. use ./output/tv_90_severe_disease, clear 

. tvc_merge start stop using ./output/tv_90_covid_vacc_first, id(patient_id)

. tvc_merge start stop using ./output/tv_90_liver_trans, id(patient_id)

. tvc_merge start stop using ./output/time_varying_udca_90, id(patient_id)

. tvc_merge start stop using ./output/tv_age, id(patient_id)

. tvc_merge start stop using ./output/tv_outcome_hosp_any, id(patient_id) failu
> re(hosp_any_flag)

. * Check number of outcomes after merge 
. tab hosp_any_flag, m

hosp_any_fl |
         ag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,822       58.90       58.90
          1 |         44        0.92       59.82
          . |      1,925       40.18      100.00
------------+-----------------------------------
      Total |      4,791      100.00

. bys patient_id: egen total_hosp = total(hosp_any_flag)

. tab total_hosp

 total_hosp |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,591       95.83       95.83
          1 |        200        4.17      100.00
------------+-----------------------------------
      Total |      4,791      100.00

. * Dummy drug data includes people not in cohort, so drop these - should not b
> e any in real data 
. drop if age_tv==.
(1,820 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [11,9999]                    units:  1
         unique values:  1,000                    missing .:  0/2,971

                  mean:   4869.29
              std. dev:   2833.32

           percentiles:        10%       25%       50%       75%       90%
                               822      2566      4856      7210      8906

. * Check number of outcomes after merge - there will be missings for rows afte
> r event
. tab hosp_any_flag, m 

hosp_any_fl |
         ag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,822       94.98       94.98
          1 |         44        1.48       96.47
          . |        105        3.53      100.00
------------+-----------------------------------
      Total |      2,971      100.00

. missings report

Checking missings in all variables:
105 observations with missing values

  +---------------------------+
  |                 # missing |
  |---------------------------|
  | hosp_any_flag         105 |
  +---------------------------+

. drop if hosp_any_flag==.
(105 observations deleted)

. save ./output/tv_vars_90_hosp_any, replace 
(note: file ./output/tv_vars_90_hosp_any.dta not found)
file ./output/tv_vars_90_hosp_any.dta saved

. 
. use `basefile', clear

. foreach var in died_covid_any hosp_any composite_any {
  2.     preserve 
  3.     merge 1:m patient_id using ./output/tv_vars_90_`var' 
  4.     drop _merge 
  5.     save ./output/an_dataset_90_`var', replace
  6.     restore
  7. }

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,927  (_merge==3)
    -----------------------------------------
(note: file ./output/an_dataset_90_died_covid_any.dta not found)
file ./output/an_dataset_90_died_covid_any.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,866  (_merge==3)
    -----------------------------------------
(note: file ./output/an_dataset_90_hosp_any.dta not found)
file ./output/an_dataset_90_hosp_any.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,866  (_merge==3)
    -----------------------------------------
(note: file ./output/an_dataset_90_composite_any.dta not found)
file ./output/an_dataset_90_composite_any.dta saved

. 
. *** 120 day overlap file: sensitivity analysis 
. use ./output/time_varying_udca_overlap_120, clear 

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [11,9999]                    units:  1
         unique values:  1,908                    missing .:  0/2,907

                  mean:   4951.88
              std. dev:   2881.91

           percentiles:        10%       25%       50%       75%       90%
                               869      2525      4998      7446      9010

. merge m:1 patient_id using `tempfile', keepusing(severe_disease_fu_date sever
> e_disease_bl covid_vacc_first_date liver_transplant_fu_date dereg_date died_d
> ate_ons)

    Result                           # of obs.
    -----------------------------------------
    not matched                         1,816
        from master                     1,816  (_merge==1)
        from using                          0  (_merge==2)

    matched                             1,091  (_merge==3)
    -----------------------------------------

. * Should only be required for dummy data 
. keep if _merge==3
(1,816 observations deleted)

. * Only using start date as this is when udca exposure or 6 monthly check occu
> rs
. drop stop

. * Add in rows with each of the 6 monthly assessment dates 
. gen expand=1

. bys patient_id (start): replace expand=6 if _n==_N 
(1000 real changes made)

. expand expand, generate(newv)
(5,000 observations created)

. bys patient_id newv: gen number = _n 

. replace start = date("01/09/2020", "DMY") if newv==1 & number==1
(1,000 real changes made)

. replace start = date("01/03/2021", "DMY") if newv==1 & number==2
(1,000 real changes made)

. replace start = date("01/09/2021", "DMY") if newv==1 & number==3
(1,000 real changes made)

. replace start = date("01/03/2022", "DMY") if newv==1 & number==4
(1,000 real changes made)

. replace start = date("01/09/2022", "DMY") if newv==1 & number==5
(1,000 real changes made)

. 
. * This gives a file where start dates are either exposure switching or 6-mont
> ly assessment dates 
. * These will be used to determine the closest date to time-varying covariate 
> dates identified in study definition 
. sort patient_id start 

. drop newv

. 
. * Determine end of follow-up date
. gen dereg_dateA = date(dereg_date, "YMD")
(3,053 missing values generated)

. format %dD/N/CY dereg_dateA

. drop dereg_date

. gen died_dateA = date(died_date_ons, "YMD")
(3,049 missing values generated)

. format %dD/N/CY died_dateA

. drop died_date_ons

. gen end_study = date("31/12/2022", "DMY")

. egen end_date = rowmin(dereg_dateA end_study died_dateA)

. 
. * Take out assessments after end_date 
. drop if start>end_date
(1,969 observations deleted)

. 
. * Determine number of days between each covariate and dates of UDCA change or
>  6 monthly check date 
. bys patient_id (start): egen last_assess = max(start)

. * Format dates  and identify date nearest after covariate updates 
. foreach var in covid_vacc_first_date severe_disease_fu_date liver_transplant_
> fu_date {
  2.     gen `var'A = date(`var', "YMD")
  3.     format `var'A %dD/N/CY 
  4.     drop `var'
  5.     * time between date of record and change in covariate - positive value
> s are those where record starts after 
.     * covariate change date 
.     gen time_`var' = start - `var'A
  6.     * Set time variable for records prior to change as missing
.     replace time_`var'=. if time_`var'<0
  7.     * Check if any are on index date (1st March) potentially severe diseas
> e - not others
.     di "Number where time-varying update same as assessment date"
  8.     count if time_`var'==0
  9.     di "Number where time-varying update is 1st March 2020"
 10.     count if `var'A==date("01/03/2020", "DMY")
 11.     * Find earliest start date after covariate update
.     * Note: there are some changes that occur after the last available 6 mont
> h assessment or exposure change
.     bys patient_id (time_`var'): gen `var'_updateN = start[1] if `var'A!=. & 
> time_`var'!=.
 12.     * Spread to all rows for patient 
.     bys patient_id: egen `var'_update = max(`var'_updateN)
 13.     format `var'_update %dD/N/CY 
 14.     di "Number where new variable is prior to original variable (should be
>  0)"
 15.     count if `var'_update < `var'A
 16.     di "Number where time varying update is after last assessment date"
 17.     count if `var'A > last_assess & `var'A!=.  & last_assess==start
 18.     di "Number of time-varying changes originally" 
 19.     * Using last_assess==start to count patients rather than rows
.     count if `var'A!=. & last_assess==start 
 20.     di "Number of dates for time-varying update"
 21.     count if `var'_update!=. & last_assess==start & `var'A!=.
 22. }
(382 missing values generated)
(382 missing values generated)
(2,937 real changes made, 2,937 to missing)
Number where time-varying update same as assessment date
  2
Number where time-varying update is 1st March 2020
  0
(3,319 missing values generated)
(1868 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  508
Number of time-varying changes originally
  901
Number of dates for time-varying update
  393
(999 missing values generated)
(999 missing values generated)
(2,154 real changes made, 2,154 to missing)
Number where time-varying update same as assessment date
  2
Number where time-varying update is 1st March 2020
  0
(3,153 missing values generated)
(2218 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  404
Number of time-varying changes originally
  758
Number of dates for time-varying update
  354
(4,020 missing values generated)
(4,020 missing values generated)
(78 real changes made, 78 to missing)
Number where time-varying update same as assessment date
  0
Number where time-varying update is 1st March 2020
  0
(4,098 missing values generated)
(4065 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  12
Number of time-varying changes originally
  23
Number of dates for time-varying update
  11

. * For severe disease only update variable if no severe disease at baseline 
. count if severe_disease_fu_date_update==date("01/03/2020", "DMY") & severe_di
> sease_bl!=1 
  0

. tab severe_disease_bl

severe_dise |
     ase_bl |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,099       50.92       50.92
          1 |      2,023       49.08      100.00
------------+-----------------------------------
      Total |      4,122      100.00

. replace severe_disease_fu_date_update = . if severe_disease_bl==1
(916 real changes made, 916 to missing)

. 
. * Keep only change dates to create time-varying dataset
. keep patient_id covid_vacc_first_date_update severe_disease_fu_date_update li
> ver_transplant_fu_date_update severe_disease_bl end_date

. * Chercking number of patient_id's 
. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [11,9999]                    units:  1
         unique values:  1,000                    missing .:  0/4,122

                  mean:   4859.09
              std. dev:   2809.47

           percentiles:        10%       25%       50%       75%       90%
                               830      2622      4777      7109      8828

. duplicates drop 

Duplicates in terms of all variables

(3,122 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [11,9999]                    units:  1
         unique values:  1,000                    missing .:  0/1,000

                  mean:   4960.93
              std. dev:   2827.87

           percentiles:        10%       25%       50%       75%       90%
                               874    2696.5      5015    7356.5      8946

. count
  1,000

. * Create file for each covariate to merge onto udca exposure file 
. * First covid vaccination and liver transplant as all people will begin at ze
> ro 
. rename liver_transplant_fu_date_update liver_trans_date_update

. foreach var in covid_vacc_first liver_trans {
  2.     preserve
  3.     keep patient_id `var'_date_update end_date
  4.     * Drop updates after the end of follow-up 
.     count if `var'_date>=end_date 
  5.     replace `var'_date = . if `var'_date>=end_date 
  6.     * Flag if variable is updated
.     gen `var'=(`var'_date_update!=.)
  7.     * Create extra row if variable is updated 
.     gen expand = `var'+1
  8.     tab expand
  9.     expand expand, gen(newv)
 10.     * Update variables so row for when zero and row for when updated - if 
> not updated whole time will be zero 
.     gen start = date("01/03/2020", "DMY") if newv==0
 11.     replace start = `var'_date_update if newv==1
 12.     gen stop = `var'_date_update if newv==0
 13.     replace stop = end_date if stop==.
 14.     replace `var'=0 if newv==0
 15.     save ./output/tv_`var'_check, replace
 16.     keep patient_id `var' start stop
 17.     * Check data 
.     count if start==stop 
 18.     * drop where start is same as stop - should not drop any in real data 
.     drop if start==stop 
 19.     count if stop<start
 20.     codebook patient_id
 21.     save ./output/tv_overlap_120_`var', replace
 22.     restore
 23. }
  607
(0 real changes made)

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        607       60.70       60.70
          2 |        393       39.30      100.00
------------+-----------------------------------
      Total |      1,000      100.00
(393 observations created)
(393 missing values generated)
(393 real changes made)
(1,000 missing values generated)
(1,000 real changes made)
(393 real changes made)
file ./output/tv_covid_vacc_first_check.dta saved
  0
(0 observations deleted)
  0

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [11,9999]                    units:  1
         unique values:  1,000                    missing .:  0/1,393

                  mean:    4908.6
              std. dev:   2837.45

           percentiles:        10%       25%       50%       75%       90%
                               842      2596      4971      7261      8933
(note: file ./output/tv_overlap_120_covid_vacc_first.dta not found)
file ./output/tv_overlap_120_covid_vacc_first.dta saved
  989
(0 real changes made)

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        989       98.90       98.90
          2 |         11        1.10      100.00
------------+-----------------------------------
      Total |      1,000      100.00
(11 observations created)
(11 missing values generated)
(11 real changes made)
(1,000 missing values generated)
(1,000 real changes made)
(11 real changes made)
file ./output/tv_liver_trans_check.dta saved
  0
(0 observations deleted)
  0

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [11,9999]                    units:  1
         unique values:  1,000                    missing .:  0/1,011

                  mean:   4959.79
              std. dev:   2837.05

           percentiles:        10%       25%       50%       75%       90%
                               872      2692      4992      7375      8959
(note: file ./output/tv_overlap_120_liver_trans.dta not found)
file ./output/tv_overlap_120_liver_trans.dta saved

. 
. * Same for liver disease severity, but variable can start at 1 and remain for
>  whole of follow-up 
. preserve

. keep patient_id severe_disease_fu_date_update end_date severe_disease_bl

. * Drop updates after the end of follow-up 
. replace severe_disease_fu_date_update=. if severe_disease_fu_date_update>=end
> _date 
(0 real changes made)

. * Flag if variable is updated
. gen severe_disease=(severe_disease_fu_date_update!=.)

. tab severe_disease 

severe_dise |
        ase |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        815       81.50       81.50
          1 |        185       18.50      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. replace severe_disease = 0 if severe_disease_bl==1
(0 real changes made)

. * Create extra row if variable is updated 
. gen expand = severe_disease + 1

. tab expand

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        815       81.50       81.50
          2 |        185       18.50      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. expand expand, gen(newv)
(185 observations created)

. tab newv

       newv |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,000       84.39       84.39
          1 |        185       15.61      100.00
------------+-----------------------------------
      Total |      1,185      100.00

. * Update variables so row for when zero and row for when updated - if not upd
> ated whole time will be zero 
. gen start = date("01/03/2020", "DMY") if newv==0
(185 missing values generated)

. replace start = severe_disease_fu_date_update if newv==1
(185 real changes made)

. gen stop = severe_disease_fu_date_update if newv==0 & severe_disease==1
(1,000 missing values generated)

. count if stop!=.
  185

. replace stop = end_date if stop==. 
(1,000 real changes made)

. count if stop==.
  0

. replace severe_disease=0 if newv==0 & severe_disease_bl==0
(185 real changes made)

. replace severe_disease=1 if newv==0 & severe_disease_bl==1
(500 real changes made)

. save ./output/tv_severe_disease_check, replace
file ./output/tv_severe_disease_check.dta saved

. keep patient_id severe_disease start stop

. * Check data 
. count if start==stop
  0

. * drop if start is same as stop - should not drop any in real data 
. drop if start==stop 
(0 observations deleted)

. count if stop<start
  0

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [11,9999]                    units:  1
         unique values:  1,000                    missing .:  0/1,185

                  mean:   4911.64
              std. dev:   2837.23

           percentiles:        10%       25%       50%       75%       90%
                               837      2607      4971      7295      8853

. save ./output/tv_overlap_120_severe_disease, replace
(note: file ./output/tv_overlap_120_severe_disease.dta not found)
file ./output/tv_overlap_120_severe_disease.dta saved

. restore

. 
. * Merge files together for each outcome
. * Composite  
. use ./output/tv_overlap_120_severe_disease, clear 

. tvc_merge start stop using ./output/tv_overlap_120_covid_vacc_first, id(patie
> nt_id)

. tvc_merge start stop using ./output/tv_overlap_120_liver_trans, id(patient_id
> )

. tvc_merge start stop using ./output/time_varying_udca_overlap_120, id(patient
> _id)

. tvc_merge start stop using ./output/tv_age, id(patient_id)

. tvc_merge start stop using ./output/tv_outcome_composite_any, id(patient_id) 
> failure(composite_any_flag)

. * Dummy drug data includes people not in cohort, so drop these - should not b
> e any in real data 
. drop if age_tv==.
(1,816 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [11,9999]                    units:  1
         unique values:  1,000                    missing .:  0/2,971

                  mean:   4869.29
              std. dev:   2833.32

           percentiles:        10%       25%       50%       75%       90%
                               822      2566      4856      7210      8906

. * Check number of outcomes after merge  - there will be missings for rows aft
> er event
. tab composite_any_flag, m

composite_a |
    ny_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,662       89.60       89.60
          1 |        204        6.87       96.47
          . |        105        3.53      100.00
------------+-----------------------------------
      Total |      2,971      100.00

. missings report

Checking missings in all variables:
105 observations with missing values

  +--------------------------------+
  |                      # missing |
  |--------------------------------|
  | composite_any_flag         105 |
  +--------------------------------+

. drop if composite_any_flag==.
(105 observations deleted)

. save ./output/tv_vars_overlap_120_composite_any, replace 
(note: file ./output/tv_vars_overlap_120_composite_any.dta not found)
file ./output/tv_vars_overlap_120_composite_any.dta saved

. 
. * COVID death - covid code in any position
. use ./output/tv_overlap_120_severe_disease, clear 

. tvc_merge start stop using ./output/tv_overlap_120_covid_vacc_first, id(patie
> nt_id)

. tvc_merge start stop using ./output/tv_overlap_120_liver_trans, id(patient_id
> )

. tvc_merge start stop using ./output/time_varying_udca_overlap_120, id(patient
> _id)

. tvc_merge start stop using ./output/tv_age, id(patient_id)

. tvc_merge start stop using ./output/tv_outcome_died_covid_any, id(patient_id)
>  failure(died_covid_any_flag)

. * Dummy drug data includes people not in cohort, so drop these - should not b
> e any in real data 
. drop if age_tv==.
(1,816 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [11,9999]                    units:  1
         unique values:  1,000                    missing .:  0/2,927

                  mean:   4865.83
              std. dev:   2833.26

           percentiles:        10%       25%       50%       75%       90%
                               822      2546      4856      7210      8906

. * Check number of outcomes after merge 
. tab died_covid_any_flag, m

died_covid_ |
   any_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,759       94.26       94.26
          1 |        168        5.74      100.00
------------+-----------------------------------
      Total |      2,927      100.00

. missings report

Checking missings in all variables:
0 observations with missing values

. save ./output/tv_vars_overlap_120_died_covid_any, replace 
(note: file ./output/tv_vars_overlap_120_died_covid_any.dta not found)
file ./output/tv_vars_overlap_120_died_covid_any.dta saved

. 
. * COVID hospitalisation - covid code in any position
. use ./output/tv_overlap_120_severe_disease, clear 

. tvc_merge start stop using ./output/tv_overlap_120_covid_vacc_first, id(patie
> nt_id)

. tvc_merge start stop using ./output/tv_overlap_120_liver_trans, id(patient_id
> )

. tvc_merge start stop using ./output/time_varying_udca_overlap_120, id(patient
> _id)

. tvc_merge start stop using ./output/tv_age, id(patient_id)

. tvc_merge start stop using ./output/tv_outcome_hosp_any, id(patient_id) failu
> re(hosp_any_flag)

. * Check number of outcomes after merge 
. tab hosp_any_flag, m

hosp_any_fl |
         ag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,822       58.95       58.95
          1 |         44        0.92       59.87
          . |      1,921       40.13      100.00
------------+-----------------------------------
      Total |      4,787      100.00

. bys patient_id: egen total_hosp = total(hosp_any_flag)

. tab total_hosp

 total_hosp |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,587       95.82       95.82
          1 |        200        4.18      100.00
------------+-----------------------------------
      Total |      4,787      100.00

. * Dummy drug data includes people not in cohort, so drop these - should not b
> e any in real data 
. drop if age_tv==.
(1,816 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [11,9999]                    units:  1
         unique values:  1,000                    missing .:  0/2,971

                  mean:   4869.29
              std. dev:   2833.32

           percentiles:        10%       25%       50%       75%       90%
                               822      2566      4856      7210      8906

. * Check number of outcomes after merge - there will be missings for rows afte
> r event
. tab hosp_any_flag, m 

hosp_any_fl |
         ag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,822       94.98       94.98
          1 |         44        1.48       96.47
          . |        105        3.53      100.00
------------+-----------------------------------
      Total |      2,971      100.00

. missings report

Checking missings in all variables:
105 observations with missing values

  +---------------------------+
  |                 # missing |
  |---------------------------|
  | hosp_any_flag         105 |
  +---------------------------+

. drop if hosp_any_flag==.
(105 observations deleted)

. save ./output/tv_vars_overlap_120_hosp_any, replace 
(note: file ./output/tv_vars_overlap_120_hosp_any.dta not found)
file ./output/tv_vars_overlap_120_hosp_any.dta saved

. 
. use `basefile', clear

. foreach var in died_covid_any hosp_any composite_any {
  2.     preserve 
  3.     merge 1:m patient_id using ./output/tv_vars_overlap_120_`var' 
  4.     drop _merge 
  5.     save ./output/an_dataset_overlap_120_`var', replace
  6.     restore
  7. }

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,927  (_merge==3)
    -----------------------------------------
(note: file ./output/an_dataset_overlap_120_died_covid_any.dta not found)
file ./output/an_dataset_overlap_120_died_covid_any.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,866  (_merge==3)
    -----------------------------------------
(note: file ./output/an_dataset_overlap_120_hosp_any.dta not found)
file ./output/an_dataset_overlap_120_hosp_any.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,866  (_merge==3)
    -----------------------------------------
(note: file ./output/an_dataset_overlap_120_composite_any.dta not found)
file ./output/an_dataset_overlap_120_composite_any.dta saved

. 
. *** vaccination file: sensitivity analysis 
. ** Creating file where count of vaccinations updates over time
. use ./output/time_varying_udca_120, clear 

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [11,9999]                    units:  1
         unique values:  1,908                    missing .:  0/2,907

                  mean:   4951.88
              std. dev:   2881.91

           percentiles:        10%       25%       50%       75%       90%
                               869      2525      4998      7446      9010

. merge m:1 patient_id using `tempfile', keepusing(covid_vacc* dereg_date died_
> date_ons date_most_recent_cov_vac)

    Result                           # of obs.
    -----------------------------------------
    not matched                         1,816
        from master                     1,816  (_merge==1)
        from using                          0  (_merge==2)

    matched                             1,091  (_merge==3)
    -----------------------------------------

. * Should only be required for dummy data 
. keep if _merge==3
(1,816 observations deleted)

. * Only using start date as this is when udca exposure or 6 monthly check occu
> rs
. drop stop

. * Add in rows with each of the 6 monthly assessment dates 
. gen expand=1

. bys patient_id (start): replace expand=6 if _n==_N 
(1000 real changes made)

. expand expand, generate(newv)
(5,000 observations created)

. bys patient_id newv: gen number = _n 

. replace start = date("01/09/2020", "DMY") if newv==1 & number==1
(1,000 real changes made)

. replace start = date("01/03/2021", "DMY") if newv==1 & number==2
(1,000 real changes made)

. replace start = date("01/09/2021", "DMY") if newv==1 & number==3
(1,000 real changes made)

. replace start = date("01/03/2022", "DMY") if newv==1 & number==4
(1,000 real changes made)

. replace start = date("01/09/2022", "DMY") if newv==1 & number==5
(1,000 real changes made)

. 
. * This gives a file where start dates are either exposure switching or 6-mont
> ly assessment dates 
. * These will be used to determine the closest date to time-varying covariate 
> dates identified in study definition 
. sort patient_id start 

. drop newv

. 
. * Determine end of follow-up date
. gen dereg_dateA = date(dereg_date, "YMD")
(3,053 missing values generated)

. format %dD/N/CY dereg_dateA

. drop dereg_date

. gen died_dateA = date(died_date_ons, "YMD")
(3,049 missing values generated)

. format %dD/N/CY died_dateA

. drop died_date_ons

. gen end_study = date("31/12/2022", "DMY")

. egen end_date = rowmin(dereg_dateA end_study died_dateA)

. 
. * Take out assessments after end_date 
. drop if start>end_date
(1,969 observations deleted)

. 
. * Determine number of days between each covariate and dates of UDCA change or
>  6 monthly check date 
. bys patient_id (start): egen last_assess = max(start)

. * Format dates  and identify date nearest after covariate updates 
. foreach var in covid_vacc_first_date covid_vacc_second_date covid_vacc_third_
> date covid_vacc_fourth_date covid_vacc_fifth_date {
  2.     gen `var'A = date(`var', "YMD")
  3.     format `var'A %dD/N/CY 
  4.     drop `var'
  5.     * time between date of record and change in covariate - positive value
> s are those where record starts after 
.     * covariate change date 
.     gen time_`var' = start - `var'A
  6.     * Set time variable for records prior to change as missing
.     replace time_`var'=. if time_`var'<0
  7.     * Check if any are on index date (1st March) potentially severe diseas
> e - not others
.     di "Number where time-varying update same as assessment date"
  8.     count if time_`var'==0
  9.     di "Number where time-varying update is 1st March 2020"
 10.     count if `var'A==date("01/03/2020", "DMY")
 11.     * Find earliest start date after covariate update
.     * Note: there are some changes that occur after the last available 6 mont
> h assessment or exposure change
.     bys patient_id (time_`var'): gen `var'_updateN = start[1] if `var'A!=. & 
> time_`var'!=.
 12.     * Spread to all rows for patient 
.     bys patient_id: egen `var'_update = max(`var'_updateN)
 13.     format `var'_update %dD/N/CY 
 14.     di "Number where new variable is prior to original variable (should be
>  0)"
 15.     count if `var'_update < `var'A
 16.     di "Number where time varying update is after last assessment date"
 17.     count if `var'A > last_assess & `var'A!=.  & last_assess==start
 18.     di "Number of time-varying changes originally" 
 19.     * Using last_assess==start to count patients rather than rows
.     count if `var'A!=. & last_assess==start 
 20.     di "Number of dates for time-varying update"
 21.     count if `var'_update!=. & last_assess==start & `var'A!=.
 22. }
(382 missing values generated)
(382 missing values generated)
(2,937 real changes made, 2,937 to missing)
Number where time-varying update same as assessment date
  2
Number where time-varying update is 1st March 2020
  0
(3,319 missing values generated)
(1868 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  508
Number of time-varying changes originally
  901
Number of dates for time-varying update
  393
(815 missing values generated)
(815 missing values generated)
(2,630 real changes made, 2,630 to missing)
Number where time-varying update same as assessment date
  3
Number where time-varying update is 1st March 2020
  0
(3,445 missing values generated)
(2186 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  460
Number of time-varying changes originally
  801
Number of dates for time-varying update
  341
(3,739 missing values generated)
(3,739 missing values generated)
(340 real changes made, 340 to missing)
Number where time-varying update same as assessment date
  0
Number where time-varying update is 1st March 2020
  0
(4,079 missing values generated)
(3941 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  70
Number of time-varying changes originally
  100
Number of dates for time-varying update
  30
(2,017 missing values generated)
(2,017 missing values generated)
(30 real changes made, 30 to missing)
Number where time-varying update same as assessment date
  0
Number where time-varying update is 1st March 2020
  0
(2,047 missing values generated)
(2041 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  8
Number of time-varying changes originally
  500
Number of dates for time-varying update
  492
(2,033 missing values generated)
(2,033 missing values generated)
(53 real changes made, 53 to missing)
Number where time-varying update same as assessment date
  0
Number where time-varying update is 1st March 2020
  0
(2,086 missing values generated)
(2067 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  7
Number of time-varying changes originally
  500
Number of dates for time-varying update
  493

. 
. * Keep only change dates to create time-varying dataset
. keep patient_id covid_vacc_first_date_update covid_vacc_second_date_update co
> vid_vacc_third_date_update covid_vacc_fourth_date_update covid_vacc_fifth_dat
> e_update end_date date_most_recent_cov_vac

. * Chercking number of patient_id's 
. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [11,9999]                    units:  1
         unique values:  1,000                    missing .:  0/4,122

                  mean:   4859.09
              std. dev:   2809.47

           percentiles:        10%       25%       50%       75%       90%
                               830      2622      4777      7109      8828

. duplicates drop 

Duplicates in terms of all variables

(3,122 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [11,9999]                    units:  1
         unique values:  1,000                    missing .:  0/1,000

                  mean:   4960.93
              std. dev:   2827.87

           percentiles:        10%       25%       50%       75%       90%
                               874    2696.5      5015    7356.5      8946

. count
  1,000

. * Create dataset where rows are updated when person is vaccinated/re-vaccinat
> ed  
. foreach var in covid_vacc_first covid_vacc_second covid_vacc_third covid_vacc
> _fourth covid_vacc_fifth {
  2.     count if `var'_date_update>=end_date & `var'_date_update!=.
  3.     replace `var'_date_update = . if `var'_date_update>=end_date
  4.     * Create flag for each vaccination date 
.     gen `var'_flag = (`var'_date_update!=.)
  5.     * Create flag for if date is prior to 1st March 2021
.     gen `var'_prior = `var'_date_update <= date("01Mar2021", "DMY")
  6.     tab `var'_prior, m
  7. }
  0
(0 real changes made)

covid_vacc_ |
first_prior |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        925       92.50       92.50
          1 |         75        7.50      100.00
------------+-----------------------------------
      Total |      1,000      100.00
  1
(1 real change made, 1 to missing)

covid_vacc_ |
second_prio |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        945       94.50       94.50
          1 |         55        5.50      100.00
------------+-----------------------------------
      Total |      1,000      100.00
  0
(0 real changes made)

covid_vacc_ |
third_prior |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,000      100.00      100.00
------------+-----------------------------------
      Total |      1,000      100.00
  0
(0 real changes made)

covid_vacc_ |
fourth_prio |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        508       50.80       50.80
          1 |        492       49.20      100.00
------------+-----------------------------------
      Total |      1,000      100.00
  0
(0 real changes made)

covid_vacc_ |
fifth_prior |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        511       51.10       51.10
          1 |        489       48.90      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. * Check not date where prior vaccination is missing 
. count if covid_vacc_first_flag==0 & covid_vacc_second_flag==1
  105

. count if covid_vacc_second_flag==0 & covid_vacc_third_flag==1
  11

. count if covid_vacc_third_flag==0 & covid_vacc_fourth_flag==1
  479

. count if covid_vacc_fourth_flag==0 & covid_vacc_fifth_flag==1
  245

. 
. * Determine total number of vaccinations 
. egen total_vaccs = rowtotal(covid_vacc_first_flag covid_vacc_second_flag covi
> d_vacc_third_flag covid_vacc_fourth_flag covid_vacc_fifth_flag)

. tab total_vaccs

total_vaccs |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        137       13.70       13.70
          1 |        299       29.90       43.60
          2 |        304       30.40       74.00
          3 |        202       20.20       94.20
          4 |         55        5.50       99.70
          5 |          3        0.30      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. egen total_vaccs_prior = rowtotal(covid_vacc_first_prior covid_vacc_second_pr
> ior covid_vacc_third_prior covid_vacc_fourth_prior covid_vacc_fifth_prior)

. gen date_most_recent_cov_vacA = date(date_most_recent_cov_vac, "YMD")
(941 missing values generated)

. count if total_vaccs_prior!=0 & date_most_recent_cov_vacA==.
  736

. count if total_vaccs_prior==0 & date_most_recent_cov_vacA!=.
  21

. * Create time varying vaccination count variable 
. gen vacc_count_tv = 0

. * expand row up to total number of vaccinations 
. gen expand = total_vaccs + 1

. tab expand 

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        137       13.70       13.70
          2 |        299       29.90       43.60
          3 |        304       30.40       74.00
          4 |        202       20.20       94.20
          5 |         55        5.50       99.70
          6 |          3        0.30      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. expand expand, gen(newv)
(1,748 observations created)

. bys patient_id newv: gen number = _n 

. * Update variables so row for when zero and row for each vaccination - if not
>  updated whole time will be zero 
. gen start = date("01/03/2020", "DMY") if newv==0
(1,748 missing values generated)

. replace start = covid_vacc_first_date_update if newv==1 & number == 1
(393 real changes made)

. gen stop = covid_vacc_first_date_update if newv==0 & covid_vacc_first_date_up
> date!=.
(2,355 missing values generated)

. replace stop = end_date if stop==. & expand==1
(137 real changes made)

. replace stop = covid_vacc_second_date_update if newv==1 & number==1
(340 real changes made)

. replace vacc_count_tv = 1 if newv==1 & number==1
(863 real changes made)

. * Second vaccination 
. replace start = covid_vacc_second_date_update if newv==1 & number == 2
(321 real changes made)

. replace stop = covid_vacc_third_date_update if newv==1 & number==2 & covid_va
> cc_third_date_update!=.
(30 real changes made)

. replace stop = end_date if newv==1 & number==2 & covid_vacc_third_date_update
> ==.
(534 real changes made)

. replace vacc_count_tv = 2 if newv==1 & number==2
(564 real changes made)

. * Third vaccination 
. replace start = covid_vacc_third_date_update if newv==1 & number == 3
(25 real changes made)

. replace stop = covid_vacc_fourth_date_update if newv==1 & number==3 & covid_v
> acc_fourth_date_update!=.
(197 real changes made)

. replace stop = end_date if newv==1 & number==3 & covid_vacc_fourth_date_updat
> e==.
(63 real changes made)

. replace vacc_count_tv = 3 if newv==1 & number==3
(260 real changes made)

. * Fourth vaccination 
. replace start = covid_vacc_fourth_date_update if newv==1 & number == 4
(55 real changes made)

. replace stop = covid_vacc_fifth_date_update if newv==1 & number==4 & covid_va
> cc_fifth_date_update!=.
(58 real changes made)

. replace stop = end_date if newv==1 & number==4 & covid_vacc_fifth_date_update
> ==.
(0 real changes made)

. replace vacc_count_tv = 4 if newv==1 & number==4
(58 real changes made)

. * Fifth vaccination 
. replace start = covid_vacc_fifth_date_update if newv==1 & number == 5
(3 real changes made)

. replace stop = end_date if newv==1 & number==5
(3 real changes made)

. replace vacc_count_tv = 5 if newv==1 & number==5
(3 real changes made)

. save ./output/tv_120_total_vaccs_check, replace
(note: file ./output/tv_120_total_vaccs_check.dta not found)
file ./output/tv_120_total_vaccs_check.dta saved

. keep patient_id vacc_count_tv start stop

. * Check data 
. count if start==stop 
  487

. * drop where start is same as stop - should not drop any in real data 
. drop if start==stop 
(487 observations deleted)

. count if stop<start
  681

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [11,9999]                    units:  1
         unique values:  1,000                    missing .:  0/2,261

                  mean:   4871.39
              std. dev:      2845

           percentiles:        10%       25%       50%       75%       90%
                               835      2566      4812      7210      8924

. save ./output/tv_120_total_vaccs, replace
(note: file ./output/tv_120_total_vaccs.dta not found)
file ./output/tv_120_total_vaccs.dta saved

. 
. 
. * Merge files together for each outcome
. * Composite  
. use ./output/tv_severe_disease, clear 

. tvc_merge start stop using ./output/tv_covid_vacc_first, id(patient_id)

. tvc_merge start stop using ./output/tv_120_total_vaccs, id(patient_id)

. tvc_merge start stop using ./output/tv_liver_trans, id(patient_id)

. tvc_merge start stop using ./output/time_varying_udca_120, id(patient_id)

. tvc_merge start stop using ./output/tv_age, id(patient_id)

. tvc_merge start stop using ./output/tv_outcome_composite_any, id(patient_id) 
> failure(composite_any_flag)

. * Dummy drug data includes people not in cohort, so drop these - should not b
> e any in real data 
. drop if age_tv==.
(1,816 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [11,9999]                    units:  1
         unique values:  1,000                    missing .:  0/3,256

                  mean:   4857.13
              std. dev:   2834.76

           percentiles:        10%       25%       50%       75%       90%
                               822      2546      4819      7182      8853

. * Check number of outcomes after merge  - there will be missings for rows aft
> er event
. tab composite_any_flag, m

composite_a |
    ny_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,935       90.14       90.14
          1 |        204        6.27       96.41
          . |        117        3.59      100.00
------------+-----------------------------------
      Total |      3,256      100.00

. missings report

Checking missings in all variables:
117 observations with missing values

  +--------------------------------+
  |                      # missing |
  |--------------------------------|
  | composite_any_flag         117 |
  +--------------------------------+

. drop if composite_any_flag==.
(117 observations deleted)

. save ./output/tv_vars_120_vacc_composite_any, replace 
(note: file ./output/tv_vars_120_vacc_composite_any.dta not found)
file ./output/tv_vars_120_vacc_composite_any.dta saved

. 
. * COVID death - covid code in any position
. use ./output/tv_severe_disease, clear 

. tvc_merge start stop using ./output/tv_covid_vacc_first, id(patient_id)

. tvc_merge start stop using ./output/tv_120_total_vaccs, id(patient_id)

. tvc_merge start stop using ./output/tv_liver_trans, id(patient_id)

. tvc_merge start stop using ./output/time_varying_udca_120, id(patient_id)

. tvc_merge start stop using ./output/tv_age, id(patient_id)

. tvc_merge start stop using ./output/tv_outcome_died_covid_any, id(patient_id)
>  failure(died_covid_any_flag)

. * Dummy drug data includes people not in cohort, so drop these - should not b
> e any in real data 
. drop if age_tv==.
(1,816 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [11,9999]                    units:  1
         unique values:  1,000                    missing .:  0/3,213

                  mean:   4854.92
              std. dev:   2834.97

           percentiles:        10%       25%       50%       75%       90%
                               830      2542      4819      7182      8853

. * Check number of outcomes after merge 
. tab died_covid_any_flag, m

died_covid_ |
   any_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,045       94.77       94.77
          1 |        168        5.23      100.00
------------+-----------------------------------
      Total |      3,213      100.00

. missings report

Checking missings in all variables:
0 observations with missing values

. save ./output/tv_vars_120_vacc_died_covid_any, replace 
(note: file ./output/tv_vars_120_vacc_died_covid_any.dta not found)
file ./output/tv_vars_120_vacc_died_covid_any.dta saved

. 
. * COVID hospitalisation - covid code in any position
. use ./output/tv_severe_disease, clear 

. tvc_merge start stop using ./output/tv_covid_vacc_first, id(patient_id)

. tvc_merge start stop using ./output/tv_120_total_vaccs, id(patient_id)

. tvc_merge start stop using ./output/tv_liver_trans, id(patient_id)

. tvc_merge start stop using ./output/time_varying_udca_120, id(patient_id)

. tvc_merge start stop using ./output/tv_age, id(patient_id)

. tvc_merge start stop using ./output/tv_outcome_hosp_any, id(patient_id) failu
> re(hosp_any_flag)

. * Check number of outcomes after merge 
. tab hosp_any_flag, m

hosp_any_fl |
         ag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,095       61.02       61.02
          1 |         44        0.87       61.89
          . |      1,933       38.11      100.00
------------+-----------------------------------
      Total |      5,072      100.00

. bys patient_id: egen total_hosp = total(hosp_any_flag)

. tab total_hosp

 total_hosp |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,852       95.66       95.66
          1 |        220        4.34      100.00
------------+-----------------------------------
      Total |      5,072      100.00

. * Dummy drug data includes people not in cohort, so drop these - should not b
> e any in real data 
. drop if age_tv==.
(1,816 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [11,9999]                    units:  1
         unique values:  1,000                    missing .:  0/3,256

                  mean:   4857.13
              std. dev:   2834.76

           percentiles:        10%       25%       50%       75%       90%
                               822      2546      4819      7182      8853

. * Check number of outcomes after merge - there will be missings for rows afte
> r event
. tab hosp_any_flag, m 

hosp_any_fl |
         ag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,095       95.06       95.06
          1 |         44        1.35       96.41
          . |        117        3.59      100.00
------------+-----------------------------------
      Total |      3,256      100.00

. missings report

Checking missings in all variables:
117 observations with missing values

  +---------------------------+
  |                 # missing |
  |---------------------------|
  | hosp_any_flag         117 |
  +---------------------------+

. drop if hosp_any_flag==.
(117 observations deleted)

. save ./output/tv_vars_120_vacc_hosp_any, replace 
(note: file ./output/tv_vars_120_vacc_hosp_any.dta not found)
file ./output/tv_vars_120_vacc_hosp_any.dta saved

. 
. use `basefile', clear

. foreach var in died_covid_any hosp_any composite_any {
  2.     preserve 
  3.     merge 1:m patient_id using ./output/tv_vars_120_vacc_`var' 
  4.     drop _merge 
  5.     save ./output/an_dataset_120_vacc_`var', replace
  6.     restore
  7. }

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             3,213  (_merge==3)
    -----------------------------------------
(note: file ./output/an_dataset_120_vacc_died_covid_any.dta not found)
file ./output/an_dataset_120_vacc_died_covid_any.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             3,139  (_merge==3)
    -----------------------------------------
(note: file ./output/an_dataset_120_vacc_hosp_any.dta not found)
file ./output/an_dataset_120_vacc_hosp_any.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             3,139  (_merge==3)
    -----------------------------------------
(note: file ./output/an_dataset_120_vacc_composite_any.dta not found)
file ./output/an_dataset_120_vacc_composite_any.dta saved

. 
. * Sensitivity analysis - March 2021 cohort - vaccinations
. 
. import delimited using ./output/input_vacc.csv, clear 
(109 vars, 1,000 obs)

. describe

Contains data
  obs:         1,000                          
 vars:           109                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
dereg_date      str10   %10s                  
has_pbc_date    int     %8.0g                 
has_psc_date    int     %8.0g                 
fu_liver_tran~d str10   %10s                  
fu_liver_tran~s str10   %10s                  
udca_last_date  byte    %8.0g                 
udca_first_af~r str10   %10s                  
udca_first_hi~y str10   %10s                  
covid_va~t_date str10   %10s                  
covid_vacc_se~e str10   %10s                  
covid_vacc_th~e str10   %10s                  
covid_vacc_fo~e str10   %10s                  
covid_~fth_date str10   %10s                  
date_most_rec~c str10   %10s                  
severe_disea~ed str10   %10s                  
severe_disea~cd str10   %10s                  
solid_organ_t~m str10   %10s                  solid_organ_transplant_nhsd_snome
                                                > d
solid_organ_n~w str10   %10s                  
solid_organ_t~s byte    %8.0g                 solid_organ_transplant_nhsd_opcs4
transplant_al~4 byte    %8.0g                 
transplant_th~4 str10   %10s                  
transplant_co~p byte    %8.0g                 transplant_conjunctiva_y_code_opc
                                                > s4
transplant_co~4 str10   %10s                  
transplant_st~4 str10   %10s                  
transplant_il.. byte    %8.0g                 transplant_ileum_1_Y_codes_opcs4
transplant_il.. byte    %8.0g                 transplant_ileum_2_Y_codes_opcs4
transpl~1_opcs4 str10   %10s                  
transpl~2_opcs4 str10   %10s                  
hosp_covid_pr~y str10   %10s                  
hosp_covid_any  str10   %10s                  
died_date_ons   str10   %10s                  
age             byte    %8.0g                 
sex             str1    %9s                   
stp             str4    %9s                   
region_nhs      str24   %24s                  
has_msoa        byte    %8.0g                 
imd             byte    %8.0g                 
eth             byte    %8.0g                 
ethnicity_sus   byte    %8.0g                 
ethnicity       byte    %8.0g                 
smoking_status  str1    %9s                   
bmi             float   %9.0g                 
has_pbc         byte    %8.0g                 
has_psc         byte    %8.0g                 
liver_transpl~l byte    %8.0g                 
udca_count_bl   byte    %8.0g                 
udca_count_fu   byte    %8.0g                 
oca_bl          byte    %8.0g                 
budesonide_co~u byte    %8.0g                 
budesonide_co~l byte    %8.0g                 
fenofibrate_c~u byte    %8.0g                 
fenofibrate_c~l byte    %8.0g                 
gc_count_fu     byte    %8.0g                 
gc_count_bl     byte    %8.0g                 
rituximab_bl    byte    %8.0g                 
severe_diseas~l byte    %8.0g                 
learning_disa~d byte    %8.0g                 
cancer_opensa~d byte    %8.0g                 
cancer_opensa~w byte    %8.0g                 
cancer_opensa~r byte    %8.0g                 
haematopoieti~d byte    %8.0g                 
haematopoiet~10 byte    %8.0g                 
haematopoieti~4 byte    %8.0g                 
haematologica~m byte    %8.0g                 haematological_malignancies_snome
                                                > d
haematologica~1 byte    %8.0g                 haematological_malignancies_icd10
sickle_cell_d~d byte    %8.0g                 
sickle_cell_~10 byte    %8.0g                 
haematopoieti~_ byte    %8.0g                 haematopoietic_stem_cell_snomed_e
                                                > ver
haematopoie~0_e byte    %8.0g                 haematopoietic_stem_cell_icd10_ev
                                                > er
haematopoie~4_e byte    %8.0g                 haematopoietic_stem_cell_opcs4_ev
                                                > er
v71             byte    %8.0g                 haematological_malignancies_snome
                                                > d_ever
v72             byte    %8.0g                 haematological_malignancies_icd10
                                                > _ever
ckd_stage_5_~ed byte    %8.0g                 
ckd_stage_5_~10 byte    %8.0g                 
immunosuppres~d byte    %8.0g                 
oral_steroid_~d byte    %8.0g                 
oral_s~3m_count byte    %8.0g                 
oral_s~2m_count byte    %8.0g                 
immunosuppres~r byte    %8.0g                 
oral_steroid_~r byte    %8.0g                 
immunosupress~d byte    %8.0g                 
immunosupress~w byte    %8.0g                 
hiv_aids_nhsd~d byte    %8.0g                 
hiv_aids_nhs~10 byte    %8.0g                 
multiple_scl~ed byte    %8.0g                 
multiple_scl~10 byte    %8.0g                 
motor_neurone~e byte    %8.0g                 motor_neurone_disease_nhsd_snomed
motor_neuron~10 byte    %8.0g                 
myasthenia_g~ed byte    %8.0g                 
myasthenia_g~10 byte    %8.0g                 
huntingtons_~ed byte    %8.0g                 
huntingtons_~10 byte    %8.0g                 
died_ons_live~y byte    %8.0g                 
died_ons_live~g byte    %8.0g                 
died_ons_covi~y byte    %8.0g                 
died_ons_covi~g byte    %8.0g                 
liver_transpl~e str10   %10s                  
severe_diseas~e str10   %10s                  
haematologica~d byte    %8.0g                 
haematologica~r byte    %8.0g                 
ckd_stage_5_~sd byte    %8.0g                 
hiv_aids_nhsd   byte    %8.0g                 
solid_organ_t~d str10   %10s                  
solid_organ_t~w str10   %10s                  
multiple_scl~sd byte    %8.0g                 
motor_neurone~d byte    %8.0g                 
myasthenia_g~sd byte    %8.0g                 
huntingtons_~sd byte    %8.0g                 
patient_id      int     %8.0g                 
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. save `tempfile', replace 
file /tmp/St00015.000001 saved

. 
. /* Time-varying covariates are assessed 6-monthly and at time of exposure swi
> tching.
> As disease severity, covid vaccination and liver transplant will only switch 
> once need to identify
> nearest date after date identified in study definition */ 
. * 120 day file: primary exposure definition 
. use ./output/time_varying_udca_vacc, clear 

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [1,9998]                     units:  1
         unique values:  1,910                    missing .:  0/1,910

                  mean:   5027.45
              std. dev:   2917.38

           percentiles:        10%       25%       50%       75%       90%
                             931.5      2520    5019.5      7584      9073

. merge m:1 patient_id using `tempfile', keepusing(severe_disease_fu_date sever
> e_disease_bl covid_vacc_first_date liver_transplant_fu_date dereg_date died_d
> ate_ons)

    Result                           # of obs.
    -----------------------------------------
    not matched                           910
        from master                       910  (_merge==1)
        from using                          0  (_merge==2)

    matched                             1,000  (_merge==3)
    -----------------------------------------

. * Should only be required for dummy data 
. keep if _merge==3
(910 observations deleted)

. * Only using start date as this is when udca exposure or 6 monthly check occu
> rs
. drop stop

. * Add in rows with each of the 6 monthly assessment dates 
. gen expand=1

. bys patient_id (start): replace expand=4 if _n==_N 
(1000 real changes made)

. expand expand, generate(newv)
(3,000 observations created)

. bys patient_id newv: gen number = _n 

. replace start = date("01/09/2021", "DMY") if newv==1 & number==1
(1,000 real changes made)

. replace start = date("01/03/2022", "DMY") if newv==1 & number==2
(1,000 real changes made)

. replace start = date("01/09/2022", "DMY") if newv==1 & number==3
(1,000 real changes made)

. 
. * This gives a file where start dates are either exposure switching or 6-mont
> ly assessment dates 
. * These will be used to determine the closest date to time-varying covariate 
> dates identified in study definition 
. sort patient_id start 

. drop newv

. 
. * Determine end of follow-up date
. gen dereg_dateA = date(dereg_date, "YMD")
(2,000 missing values generated)

. format %dD/N/CY dereg_dateA

. drop dereg_date

. gen died_dateA = date(died_date_ons, "YMD")
(2,564 missing values generated)

. format %dD/N/CY died_dateA

. drop died_date_ons

. gen end_study = date("31/12/2022", "DMY")

. egen end_date = rowmin(dereg_dateA end_study died_dateA)

. 
. * Take out assessments after end_date 
. drop if start>end_date
(901 observations deleted)

. 
. * Determine number of days between each covariate and dates of UDCA change or
>  6 monthly check date 
. bys patient_id (start): egen last_assess = max(start)

. * Format dates  and identify date nearest after covariate updates 
. foreach var in covid_vacc_first_date severe_disease_fu_date liver_transplant_
> fu_date {
  2.     gen `var'A = date(`var', "YMD")
  3.     format `var'A %dD/N/CY 
  4.     drop `var'
  5.     * time between date of record and change in covariate - positive value
> s are those where record starts after 
.     * covariate change date 
.     gen time_`var' = start - `var'A
  6.     * Set time variable for records prior to change as missing
.     replace time_`var'=. if time_`var'<0
  7.     * Check if any are on index date (1st March) potentially severe diseas
> e - not others
.     di "Number where time-varying update same as assessment date"
  8.     count if time_`var'==0
  9.     di "Number where time-varying update is 1st March 2021"
 10.     count if `var'A==date("01/03/2021", "DMY")
 11.     * Find earliest start date after covariate update
.     * Note: there are some changes that occur after the last available 6 mont
> h assessment or exposure change
.     bys patient_id (time_`var'): gen `var'_updateN = start[1] if `var'A!=. & 
> time_`var'!=.
 12.     * Spread to all rows for patient 
.     bys patient_id: egen `var'_update = max(`var'_updateN)
 13.     format `var'_update %dD/N/CY 
 14.     di "Number where new variable is prior to original variable (should be
>  0)"
 15.     count if `var'_update < `var'A
 16.     di "Number where time varying update is after last assessment date"
 17.     count if `var'A > last_assess & `var'A!=.  & last_assess==start
 18.     di "Number of time-varying changes originally" 
 19.     * Using last_assess==start to count patients rather than rows
.     count if `var'A!=. & last_assess==start 
 20.     di "Number of dates for time-varying update"
 21.     count if `var'_update!=. & last_assess==start & `var'A!=.
 22. }
(304 missing values generated)
(304 missing values generated)
(1,664 real changes made, 1,664 to missing)
Number where time-varying update same as assessment date
  5
Number where time-varying update is 1st March 2021
  3
(1,968 missing values generated)
(1108 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  356
Number of time-varying changes originally
  901
Number of dates for time-varying update
  545
(1,257 missing values generated)
(1,257 missing values generated)
(1,354 real changes made, 1,354 to missing)
Number where time-varying update same as assessment date
  7
Number where time-varying update is 1st March 2021
  9
(2,611 missing values generated)
(2159 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  342
Number of time-varying changes originally
  593
Number of dates for time-varying update
  251
(3,031 missing values generated)
(3,031 missing values generated)
(50 real changes made, 50 to missing)
Number where time-varying update same as assessment date
  0
Number where time-varying update is 1st March 2021
  0
(3,081 missing values generated)
(3061 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  13
Number of time-varying changes originally
  23
Number of dates for time-varying update
  10

. * For severe disease only update variable if no severe disease at baseline 
. count if severe_disease_fu_date_update==date("01/03/2021", "DMY") & severe_di
> sease_bl!=1 
  0

. tab severe_disease_bl

severe_dise |
     ase_bl |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,522       49.11       49.11
          1 |      1,577       50.89      100.00
------------+-----------------------------------
      Total |      3,099      100.00

. replace severe_disease_fu_date_update = . if severe_disease_bl==1
(483 real changes made, 483 to missing)

. 
. * Keep only change dates to create time-varying dataset
. keep patient_id covid_vacc_first_date_update severe_disease_fu_date_update li
> ver_transplant_fu_date_update severe_disease_bl end_date

. * Chercking number of patient_id's 
. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [7,9998]                     units:  1
         unique values:  1,000                    missing .:  0/3,099

                  mean:      5058
              std. dev:   2955.92

           percentiles:        10%       25%       50%       75%       90%
                               903      2398      5125      7654      9168

. duplicates drop 

Duplicates in terms of all variables

(2,099 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [7,9998]                     units:  1
         unique values:  1,000                    missing .:  0/1,000

                  mean:   5070.64
              std. dev:   2959.15

           percentiles:        10%       25%       50%       75%       90%
                               937    2406.5    5141.5    7655.5    9230.5

. count
  1,000

. * Create file for each covariate to merge onto udca exposure file 
. * First covid vaccination and liver transplant as all people will begin at ze
> ro 
. rename liver_transplant_fu_date_update liver_trans_date_update

. foreach var in covid_vacc_first liver_trans {
  2.     preserve
  3.     keep patient_id `var'_date_update end_date
  4.     * Drop updates after the end of follow-up 
.     count if `var'_date>=end_date 
  5.     replace `var'_date = . if `var'_date>=end_date 
  6.     * Flag if variable is updated
.     gen `var'=(`var'_date_update!=.)
  7.     * Create extra row if variable is updated 
.     gen expand = `var'+1
  8.     tab expand
  9.     expand expand, gen(newv)
 10.     * Update variables so row for when zero and row for when updated - if 
> not updated whole time will be zero 
.     gen start = date("01/03/2020", "DMY") if newv==0
 11.     replace start = `var'_date_update if newv==1
 12.     gen stop = `var'_date_update if newv==0
 13.     replace stop = end_date if stop==.
 14.     replace `var'=0 if newv==0
 15.     save ./output/tv_`var'_check, replace
 16.     keep patient_id `var' start stop
 17.     * Check data 
.     count if start==stop 
 18.     * drop where start is same as stop - should not drop any in real data 
.     drop if start==stop 
 19.     count if stop<start
 20.     codebook patient_id
 21.     save ./output/tv_`var'_vacc, replace
 22.     restore
 23. }
  455
(0 real changes made)

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        455       45.50       45.50
          2 |        545       54.50      100.00
------------+-----------------------------------
      Total |      1,000      100.00
(545 observations created)
(545 missing values generated)
(545 real changes made)
(1,000 missing values generated)
(1,000 real changes made)
(545 real changes made)
file ./output/tv_covid_vacc_first_check.dta saved
  0
(0 observations deleted)
  0

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [7,9998]                     units:  1
         unique values:  1,000                    missing .:  0/1,545

                  mean:   5074.45
              std. dev:   2955.87

           percentiles:        10%       25%       50%       75%       90%
                               932      2417      5125      7670      9230
(note: file ./output/tv_covid_vacc_first_vacc.dta not found)
file ./output/tv_covid_vacc_first_vacc.dta saved
  990
(0 real changes made)

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        990       99.00       99.00
          2 |         10        1.00      100.00
------------+-----------------------------------
      Total |      1,000      100.00
(10 observations created)
(10 missing values generated)
(10 real changes made)
(1,000 missing values generated)
(1,000 real changes made)
(10 real changes made)
file ./output/tv_liver_trans_check.dta saved
  0
(0 observations deleted)
  0

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [7,9998]                     units:  1
         unique values:  1,000                    missing .:  0/1,010

                  mean:   5081.63
              std. dev:   2956.35

           percentiles:        10%       25%       50%       75%       90%
                               949      2417    5170.5      7670    9222.5
(note: file ./output/tv_liver_trans_vacc.dta not found)
file ./output/tv_liver_trans_vacc.dta saved

. 
. * Same for liver disease severity, but variable can start at 1 and remain for
>  whole of follow-up 
. preserve

. keep patient_id severe_disease_fu_date_update end_date severe_disease_bl

. * Drop updates after the end of follow-up 
. replace severe_disease_fu_date_update=. if severe_disease_fu_date_update>=end
> _date 
(0 real changes made)

. * Flag if variable is updated
. gen severe_disease=(severe_disease_fu_date_update!=.)

. tab severe_disease 

severe_dise |
        ase |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        877       87.70       87.70
          1 |        123       12.30      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. replace severe_disease = 0 if severe_disease_bl==1
(0 real changes made)

. * Create extra row if variable is updated 
. gen expand = severe_disease + 1

. tab expand

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        877       87.70       87.70
          2 |        123       12.30      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. expand expand, gen(newv)
(123 observations created)

. tab newv

       newv |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,000       89.05       89.05
          1 |        123       10.95      100.00
------------+-----------------------------------
      Total |      1,123      100.00

. * Update variables so row for when zero and row for when updated - if not upd
> ated whole time will be zero 
. gen start = date("01/03/2021", "DMY") if newv==0
(123 missing values generated)

. replace start = severe_disease_fu_date_update if newv==1
(123 real changes made)

. gen stop = severe_disease_fu_date_update if newv==0 & severe_disease==1
(1,000 missing values generated)

. count if stop!=.
  123

. replace stop = end_date if stop==. 
(1,000 real changes made)

. count if stop==.
  0

. replace severe_disease=0 if newv==0 & severe_disease_bl==0
(123 real changes made)

. replace severe_disease=1 if newv==0 & severe_disease_bl==1
(500 real changes made)

. save ./output/tv_severe_disease_check, replace
file ./output/tv_severe_disease_check.dta saved

. keep patient_id severe_disease start stop

. * Check data 
. count if start==stop
  0

. * drop if start is same as stop - should not drop any in real data 
. drop if start==stop 
(0 observations deleted)

. count if stop<start
  0

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [7,9998]                     units:  1
         unique values:  1,000                    missing .:  0/1,123

                  mean:   5013.57
              std. dev:   2956.36

           percentiles:        10%       25%       50%       75%       90%
                               932      2352      5081      7597      9202

. save ./output/tv_severe_disease_vacc, replace
(note: file ./output/tv_severe_disease_vacc.dta not found)
file ./output/tv_severe_disease_vacc.dta saved

. restore

. 
. * Time-varying vaccination count
. use ./output/time_varying_udca_vacc, clear 

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [1,9998]                     units:  1
         unique values:  1,910                    missing .:  0/1,910

                  mean:   5027.45
              std. dev:   2917.38

           percentiles:        10%       25%       50%       75%       90%
                             931.5      2520    5019.5      7584      9073

. merge m:1 patient_id using `tempfile', keepusing(covid_vacc* dereg_date died_
> date_ons date_most_recent_cov_vac)

    Result                           # of obs.
    -----------------------------------------
    not matched                           910
        from master                       910  (_merge==1)
        from using                          0  (_merge==2)

    matched                             1,000  (_merge==3)
    -----------------------------------------

. * Should only be required for dummy data 
. keep if _merge==3
(910 observations deleted)

. * Only using start date as this is when udca exposure or 6 monthly check occu
> rs
. drop stop

. * Add in rows with each of the 6 monthly assessment dates 
. gen expand=1

. bys patient_id (start): replace expand=4 if _n==_N 
(1000 real changes made)

. expand expand, generate(newv)
(3,000 observations created)

. bys patient_id newv: gen number = _n 

. replace start = date("01/09/2021", "DMY") if newv==1 & number==1
(1,000 real changes made)

. replace start = date("01/03/2022", "DMY") if newv==1 & number==2
(1,000 real changes made)

. replace start = date("01/09/2022", "DMY") if newv==1 & number==3
(1,000 real changes made)

. 
. * This gives a file where start dates are either exposure switching or 6-mont
> ly assessment dates 
. * These will be used to determine the closest date to time-varying covariate 
> dates identified in study definition 
. sort patient_id start 

. drop newv

. 
. * Determine end of follow-up date
. gen dereg_dateA = date(dereg_date, "YMD")
(2,000 missing values generated)

. format %dD/N/CY dereg_dateA

. drop dereg_date

. gen died_dateA = date(died_date_ons, "YMD")
(2,564 missing values generated)

. format %dD/N/CY died_dateA

. drop died_date_ons

. gen end_study = date("31/12/2022", "DMY")

. egen end_date = rowmin(dereg_dateA end_study died_dateA)

. 
. * Take out assessments after end_date 
. drop if start>end_date
(901 observations deleted)

. * Determine number of days between each covariate and dates of UDCA change or
>  6 monthly check date 
. bys patient_id (start): egen last_assess = max(start)

. * Format dates  and identify date nearest after covariate updates 
. foreach var in covid_vacc_first_date covid_vacc_second_date covid_vacc_third_
> date covid_vacc_fourth_date covid_vacc_fifth_date {
  2.     gen `var'A = date(`var', "YMD")
  3.     format `var'A %dD/N/CY 
  4.     drop `var'
  5.     * time between date of record and change in covariate - positive value
> s are those where record starts after 
.     * covariate change date 
.     gen time_`var' = start - `var'A
  6.     * Set time variable for records prior to change as missing
.     replace time_`var'=. if time_`var'<=0
  7.     * Check if any are on index date (1st March) 
.     di "Number where time-varying update same as assessment date"
  8.     count if time_`var'==0
  9.     di "Number where time-varying update is 1st March 2021"
 10.     count if `var'A==date("01/03/2021", "DMY")
 11.     * Find earliest start date after covariate update
.     * Note: there are some changes that occur after the last available 6 mont
> h assessment or exposure change
.     bys patient_id (time_`var'): gen `var'_updateN = start[1] if `var'A!=. & 
> time_`var'!=.
 12.     * Spread to all rows for patient 
.     bys patient_id: egen `var'_update = max(`var'_updateN)
 13.     format `var'_update %dD/N/CY 
 14.     di "Number where new variable is prior to original variable (should be
>  0)"
 15.     count if `var'_update < `var'A
 16.     di "Number where time varying update is after last assessment date"
 17.     count if `var'A > last_assess & `var'A!=.  & last_assess==start
 18.     di "Number of time-varying changes originally" 
 19.     * Using last_assess==start to count patients rather than rows
.     count if `var'A!=. & last_assess==start 
 20.     di "Number of dates for time-varying update"
 21.     count if `var'_update!=. & last_assess==start & `var'A!=.
 22. }
(304 missing values generated)
(304 missing values generated)
(1,669 real changes made, 1,669 to missing)
Number where time-varying update same as assessment date
  0
Number where time-varying update is 1st March 2021
  3
(1,973 missing values generated)
(1108 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  356
Number of time-varying changes originally
  901
Number of dates for time-varying update
  545
(609 missing values generated)
(609 missing values generated)
(1,518 real changes made, 1,518 to missing)
Number where time-varying update same as assessment date
  0
Number where time-varying update is 1st March 2021
  8
(2,127 missing values generated)
(1314 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  307
Number of time-varying changes originally
  801
Number of dates for time-varying update
  492
(2,782 missing values generated)
(2,782 missing values generated)
(250 real changes made, 250 to missing)
Number where time-varying update same as assessment date
  0
Number where time-varying update is 1st March 2021
  0
(3,032 missing values generated)
(2927 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  57
Number of time-varying changes originally
  100
Number of dates for time-varying update
  43
(2,785 missing values generated)
(2,785 missing values generated)
(275 real changes made, 275 to missing)
Number where time-varying update same as assessment date
  0
Number where time-varying update is 1st March 2021
  0
(3,060 missing values generated)
(2943 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  60
Number of time-varying changes originally
  100
Number of dates for time-varying update
  39
(2,798 missing values generated)
(2,798 missing values generated)
(301 real changes made, 301 to missing)
Number where time-varying update same as assessment date
  0
Number where time-varying update is 1st March 2021
  0
(3,099 missing values generated)
(3099 missing values generated)
Number where new variable is prior to original variable (should be 0)
  0
Number where time varying update is after last assessment date
  100
Number of time-varying changes originally
  100
Number of dates for time-varying update
  0

. 
. * Keep only change dates to create time-varying dataset
. keep patient_id start covid_vacc_first_date_update covid_vacc_second_date_upd
> ate covid_vacc_third_date_update covid_vacc_fourth_date_update covid_vacc_fif
> th_date_update end_date 

. * Checking number of patient_id's 
. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [7,9998]                     units:  1
         unique values:  1,000                    missing .:  0/3,099

                  mean:      5058
              std. dev:   2955.92

           percentiles:        10%       25%       50%       75%       90%
                               903      2398      5125      7654      9168

. duplicates drop 

Duplicates in terms of all variables

(0 observations are duplicates)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [7,9998]                     units:  1
         unique values:  1,000                    missing .:  0/3,099

                  mean:      5058
              std. dev:   2955.92

           percentiles:        10%       25%       50%       75%       90%
                               903      2398      5125      7654      9168

. count
  3,099

. 
. foreach var in covid_vacc_first covid_vacc_second covid_vacc_third covid_vacc
> _fourth covid_vacc_fifth { 
  2.     gen `var'_prior_start = (`var'_date_update <= start) 
  3. }

. * Determine number of vaccinations at each assessment point 
. egen vacc_count_tv = rowtotal(covid_vacc_first_prior_start covid_vacc_second_
> prior_start covid_vacc_third_prior_start covid_vacc_fourth_prior_start covid_
> vacc_fifth_prior_start)

. * Determine if no change in number of vaccinations since last assessment 
. bys patient_id (start): gen no_change = vacc_count_tv==vacc_count_tv[_n-1]

. * Drop records if no change 
. drop if no_change==1 
(1,271 observations deleted)

. drop no_change 

. bys patient_id (start): gen stop = start[_n+1]
(1,000 missing values generated)

. replace stop = end_date if stop==.
(1,000 real changes made)

. 
. /* Create dataset where rows are updated when person is vaccinated/re-vaccina
> ted  
> foreach var in covid_vacc_first covid_vacc_second covid_vacc_third covid_vacc
> _fourth covid_vacc_fifth {
>     count if `var'_date_update>=end_date & `var'_date_update!=.
>     replace `var'_date_update = . if `var'_date_update>=end_date
>     * Create flag for each vaccination date 
>     gen `var'_flag = (`var'_date_update!=.)
>     * Create flag for if date is prior to 1st March 2021
>     gen `var'_prior = `var'_dateA <= date("01Mar2021", "DMY")
>     tab `var'_prior, m
> }
> * Check not date where prior vaccination is missing 
> count if covid_vacc_first_flag==0 & covid_vacc_second_flag==1
> count if covid_vacc_second_flag==0 & covid_vacc_third_flag==1
> count if covid_vacc_third_flag==0 & covid_vacc_fourth_flag==1
> count if covid_vacc_fourth_flag==0 & covid_vacc_fifth_flag==1
> 
> * Check where more than one vaccine during a period
> count if covid_vacc_first_date_update==covid_vacc_second_date_update & covid_
> vacc_first_date_update!=.
> count if covid_vacc_second_date_update==covid_vacc_third_date_update & covid_
> vacc_second_date_update!=.
> count if covid_vacc_third_date_update==covid_vacc_fourth_date_update & covid_
> vacc_third_date_update!=.
> count if covid_vacc_fourth_date_update==covid_vacc_fifth_date_update & covid_
> vacc_fourth_date_update!=.
> 
> * Where multiple vaccinations in same period need to set earliest one to miss
> ing 
> replace covid_vacc_first_date_update=. if covid_vacc_first_date_update==covid
> _vacc_second_date_update & covid_vacc_first_date_update!=. 
> replace covid_vacc_second_date_update=. if covid_vacc_second_date_update==cov
> id_vacc_third_date_update & covid_vacc_second_date_update!=. 
> replace covid_vacc_third_date_update=. if covid_vacc_third_date_update==covid
> _vacc_fourth_date_update & covid_vacc_third_date_update!=.
> replace covid_vacc_fourth_date_update=. if covid_vacc_fourth_date_update==cov
> id_vacc_fifth_date_update & covid_vacc_fourth_date_update!=.
> 
> * Generate count if number of changes at each vacc 
> gen change_1 = covid_vacc_first_flag 
> gen change_2 = covid_vacc_first_flag + covid_vacc_second_flag
> gen change_3 = covid_vacc_first_flag + covid_vacc_second_flag + covid_vacc_th
> ird_flag
> gen change_4 = covid_vacc_first_flag + covid_vacc_second_flag + covid_vacc_th
> ird_flag + covid_vacc_fourth_flag
> gen change_5 = covid_vacc_first_flag + covid_vacc_second_flag + covid_vacc_th
> ird_flag + covid_vacc_fourth_flag + covid_vacc_fifth_flag
> forvalues i=1/5 {
>     tab change_`i'
>     }
> 
> 
> * Determine total number of vaccinations 
> egen total_vaccs = rowtotal(covid_vacc_first_flag covid_vacc_second_flag covi
> d_vacc_third_flag covid_vacc_fourth_flag covid_vacc_fifth_flag)
> tab total_vaccs
> egen total_vaccs_prior = rowtotal(covid_vacc_first_prior covid_vacc_second_pr
> ior covid_vacc_third_prior covid_vacc_fourth_prior covid_vacc_fifth_prior)
> tab total_vaccs_prior, m 
> gen date_most_recent_cov_vacA = date(date_most_recent_cov_vac, "YMD")
> count if total_vaccs_prior!=0 & date_most_recent_cov_vacA==.
> count if total_vaccs_prior==0 & date_most_recent_cov_vacA!=.
> 
> * Create time varying vaccination count variable 
> gen vacc_count_tv = total_vaccs_prior
> * expand row up to total number of vaccinations 
> gen expand = total_vaccs + 1
> tab expand 
> expand expand, gen(newv)
> bys patient_id newv: gen number = _n 
> * Update variables so row for when zero or initial number of vaccines and row
>  for each vaccination - if not updated whole time will be zero 
> * First row is either no to 1, one to 2 or 2 to 3 unless there are multiple v
> accines on the same period
> gen start = date("01/03/2020", "DMY") if newv==0
> gen stop = covid_vacc_first_date_update if newv==0 & change_1==1
> replace stop = covid_vacc_second_date_update if newv==0 & change_2==1 & chang
> e_1==0
> replace stop = covid_vacc_third_date_update if newv==0 & change_3==1 & change
> _2==0
> replace stop = covid_vacc_fourth_date_update if newv==0 & change_4==1 & chang
> e_3==0
> replace stop = covid_vacc_fifth_date_update if newv==0 & change_5==1 & change
> _4==0
> replace stop = end_date if total_vaccs==0
> * Second update - update vacc_count_tv at end
> replace start = covid_vacc_first_date_update if newv==1 & number == 1 & chang
> e_1==1
> replace start = covid_vacc_second_date_update if newv==1 & number == 1 & chan
> ge_2==1 & change_1==0
> replace start = covid_vacc_third_date_update if newv==1 & number == 1 & chang
> e_3==1 & change_2==0
> replace start = covid_vacc_fourth_date_update if newv==1 & number == 1 & chan
> ge_4==1 & change_3==0
> replace start = covid_vacc_fifth_date_update if newv==1 & number == 1 & chang
> e_5==1 & change_4==0
> 
> replace stop = covid_vacc_second_date_update if newv==1 & number == 1 & chang
> e_2==2
> replace stop = covid_vacc_third_date_update if newv==1 & number == 1 & change
> _3==2 & change_2==1
> replace stop= covid_vacc_fourth_date_update if newv==1 & number == 1 & change
> _4==2 & change_3==1
> replace stop = covid_vacc_fifth_date_update if newv==1 & number == 1 & change
> _5==2 & change_4==1
> replace stop = end_date if stop==. & newv==1 & number == 1
> 
> * Third update 
> replace start = covid_vacc_second_date_update if newv==1 & number == 2 & chan
> ge_2==2
> replace start = covid_vacc_third_date_update if newv==1 & number == 2 & chang
> e_3==2 & change_2==1
> replace start = covid_vacc_fourth_date_update if newv==1 & number == 2 & chan
> ge_4==2 & change_3==1
> replace start = covid_vacc_fifth_date_update if newv==1 & number == 2 & chang
> e_5==2 & change_4==1
> 
> replace stop = covid_vacc_third_date_update if newv==1 & number == 2 & change
> _3==3 & change_2==2
> replace stop= covid_vacc_fourth_date_update if newv==1 & number == 2 & change
> _4==3 & change_3==2
> replace stop = covid_vacc_fifth_date_update if newv==1 & number == 2 & change
> _5==3 & change_4==2
> replace stop = end_date if stop==. & newv==1 & number == 2
> 
> * Fourth update 
> replace start = covid_vacc_third_date_update if newv==1 & number == 3 & chang
> e_3==3 & change_2==2
> replace start= covid_vacc_fourth_date_update if newv==1 & number == 3 & chang
> e_4==3 & change_3==2
> replace start = covid_vacc_fifth_date_update if newv==1 & number == 3 & chang
> e_5==3 & change_4==2
> 
> replace stop= covid_vacc_fourth_date_update if newv==1 & number == 3 & change
> _4==4 & change_3==3
> replace stop = covid_vacc_fifth_date_update if newv==1 & number == 3 & change
> _5==4 & change_4==3
> replace stop = end_date if stop==. & newv==1 & number == 3
> 
> * Fifth update 
> replace start = covid_vacc_fourth_date_update if newv==1 & number == 3 & chan
> ge_4==4 & change_3==3
> replace start = covid_vacc_fifth_date_update if newv==1 & number == 3 & chang
> e_5==4 & change_4==3
> 
> replace stop = covid_vacc_fifth_date_update if newv==1 & number == 4 & change
> _5==5 & change_4==4
> replace stop = end_date if stop==. & newv==1 & number == 4
> 
> replace vacc_count_tv = 1 if stop==covid_vacc_first_date_update
> replace vacc_count_tv = 2 if stop==covid_vacc_second_date_update
> replace vacc_count_tv = 3 if stop==covid_vacc_third_date_update
> replace vacc_count_tv = 4 if stop==covid_vacc_fourth_date_update
> replace vacc_count_tv = 5 if stop==covid_vacc_fifth_date_update
> */
. * Checks
. count if start==.
  0

. count if stop==.
  0

. bys patient_id (start): gen stop_error = start < stop[_n-1] & patient_id==pat
> ient_id[_n-1]

. tab stop_error 

 stop_error |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,828      100.00      100.00
------------+-----------------------------------
      Total |      1,828      100.00

. bys patient_id (start): gen tv_vacc_error = vacc_count_tv<vacc_count_tv[_n-1]
>  

. save ./output/tv_total_vaccs_check, replace
(note: file ./output/tv_total_vaccs_check.dta not found)
file ./output/tv_total_vaccs_check.dta saved

. keep patient_id vacc_count_tv start stop

. * Check data 
. count if start==stop 
  0

. * drop where start is same as stop - should not drop any in real data 
. drop if start==stop 
(0 observations deleted)

. count if stop<start
  0

. count if start==. 
  0

. count if stop==1
  0

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [7,9998]                     units:  1
         unique values:  1,000                    missing .:  0/1,828

                  mean:   5056.37
              std. dev:   2952.56

           percentiles:        10%       25%       50%       75%       90%
                               919    2392.5    5141.5      7653      9168

. save ./output/tv_total_vaccs, replace
(note: file ./output/tv_total_vaccs.dta not found)
file ./output/tv_total_vaccs.dta saved

. 
. * Make age time-varying i.e. updating on 1st January each year
. use `tempfile', clear 

. * Determine end of follow-up date
. gen dereg_dateA = date(dereg_date, "YMD")
(500 missing values generated)

. format %dD/N/CY dereg_dateA

. drop dereg_date

. gen died_dateA = date(died_date_ons, "YMD")
(641 missing values generated)

. format %dD/N/CY died_dateA

. drop died_date_ons

. * Determine end of follow-up then add rows to update age for each year of fol
> low-up
. gen end_study = date("31/12/2022", "DMY")

. egen end_date = rowmin(dereg_dateA end_study died_dateA)

. keep patient_id age end_date

. gen yr_end = year(end_date)

. * Add rows to update age
. gen expand = 2 if yr_end==2022
(259 missing values generated)

. replace expand = 1 if yr_end==2021
(259 real changes made)

. tab expand, m

     expand |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        259       25.90       25.90
          2 |        741       74.10      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. expand expand, gen(newv)
(741 observations created)

. tab newv, nolabel

       newv |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,000       57.44       57.44
          1 |        741       42.56      100.00
------------+-----------------------------------
      Total |      1,741      100.00

. gen start = date("01/03/2021", "DMY") if newv==0
(741 missing values generated)

. replace start = date("01/01/2022", "DMY") if newv==1 
(741 real changes made)

. gen stop = date("01/01/2022", "DMY") if newv==0 
(741 missing values generated)

. replace stop = end_date if newv==0 & end_date<stop 
(259 real changes made)

. replace stop = date("31/12/2022", "DMY") if newv==1
(741 real changes made)

. replace stop = end_date if newv==1 & end_date<stop
(267 real changes made)

. gen age_tv = age if newv==0
(741 missing values generated)

. replace age_tv = age+1 if newv==1 
(741 real changes made)

. keep patient_id start stop age_tv 

. drop if start==stop
(0 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [7,9998]                     units:  1
         unique values:  1,000                    missing .:  0/1,741

                  mean:   5051.47
              std. dev:   2965.92

           percentiles:        10%       25%       50%       75%       90%
                               903      2391      5091      7654      9202

. save ./output/tv_age_vacc, replace 
(note: file ./output/tv_age_vacc.dta not found)
file ./output/tv_age_vacc.dta saved

. 
. 
. * Create files for outcomes
. use `tempfile', clear

. * Determine end of follow-up date
. foreach var in died_date_ons hosp_covid_primary hosp_covid_any dereg_date {
  2.     gen `var'A = date(`var', "YMD")
  3.     format `var'A %dD/N/CY
  4.     drop `var'
  5.     gen yr_`var' = year(`var'A)
  6.     tab yr_`var'
  7.     replace `var'A=. if yr_`var'==2023
  8. }
(641 missing values generated)
(641 missing values generated)

yr_died_dat |
      e_ons |      Freq.     Percent        Cum.
------------+-----------------------------------
       2021 |        113       31.48       31.48
       2022 |        146       40.67       72.14
       2023 |        100       27.86      100.00
------------+-----------------------------------
      Total |        359      100.00
(100 real changes made, 100 to missing)
(929 missing values generated)
(929 missing values generated)

yr_hosp_cov |
 id_primary |      Freq.     Percent        Cum.
------------+-----------------------------------
       2021 |         26       36.62       36.62
       2022 |         26       36.62       73.24
       2023 |         19       26.76      100.00
------------+-----------------------------------
      Total |         71      100.00
(19 real changes made, 19 to missing)
(926 missing values generated)
(926 missing values generated)

yr_hosp_cov |
     id_any |      Freq.     Percent        Cum.
------------+-----------------------------------
       2021 |         22       29.73       29.73
       2022 |         24       32.43       62.16
       2023 |         28       37.84      100.00
------------+-----------------------------------
      Total |         74      100.00
(28 real changes made, 28 to missing)
(500 missing values generated)
(500 missing values generated)

yr_dereg_da |
         te |      Freq.     Percent        Cum.
------------+-----------------------------------
       2021 |        162       32.40       32.40
       2022 |        193       38.60       71.00
       2023 |        145       29.00      100.00
------------+-----------------------------------
      Total |        500      100.00
(145 real changes made, 145 to missing)

. gen end_study = date("31/12/2022", "DMY")

. egen end_date = rowmin(dereg_dateA end_study died_date_onsA)

. 
. * Create flag indicating reason for end of follow-up 
. gen end_date_flag = (end_date==dereg_dateA)

. replace end_date_flag = 2 if end_date==died_date_onsA
(214 real changes made)

. replace end_date_flag = 3 if end_date==end_study
(474 real changes made)

. replace died_date_onsA=. if end_date<died_date_onsA
(45 real changes made, 45 to missing)

. replace died_ons_covid_flag_any=0 if end_date<died_date_onsA & died_ons_covid
> _flag_any==1
(382 real changes made)

. replace hosp_covid_anyA=. if end_date<hosp_covid_anyA
(11 real changes made, 11 to missing)

. gen hosp_any_flag = hosp_covid_anyA!=.

. 
. * Composite outcome 
. gen hosp_died_composite = (died_ons_covid_flag_any==1 | hosp_any_flag==1)

. egen hosp_died_dateA = rowmin(died_date_onsA hosp_covid_anyA)
(757 missing values generated)

. replace hosp_died_dateA=. if hosp_died_composite==0
(94 real changes made, 94 to missing)

. 
. * Check how composite is made up 
. tab died_ons_covid_flag_any hosp_any_flag

died_ons_c |
ovid_flag_ |     hosp_any_flag
       any |         0          1 |     Total
-----------+----------------------+----------
         0 |       851         31 |       882 
         1 |       114          4 |       118 
-----------+----------------------+----------
     Total |       965         35 |     1,000 

. di "Number where composite date = death date only"
Number where composite date = death date only

. count if hosp_died_dateA==died_date_onsA & hosp_died_dateA!=. & hosp_died_dat
> eA!=hosp_covid_anyA
  114

. di "Number where composite = hospitalisation date only"
Number where composite = hospitalisation date only

. count if hosp_died_dateA==hosp_covid_anyA & hosp_died_dateA!=. & hosp_died_da
> teA!=died_date_onsA
  35

. di "Number where composite = both death and hospitalisation date 
Number where composite = both death and hospitalisation date

. count if hosp_died_dateA==died_date_onsA & hosp_died_dateA!=. & hosp_died_dat
> eA==hosp_covid_anyA
  0

. 
. * Make file for each outcome: covid death, hospitalisation and composite 
. * Files contain patient ID, start = start study, stop = either end date for p
> atient or date of outcome 
. * and flag for outcome 
. * COVID death - covid code in any position
. preserve 

. keep patient_id end_date died_ons_covid_flag_any died_date_onsA

. gen start = date("01/03/2021", "DMY")

. egen stop = rowmin(died_date_onsA end_date)

. count if died_ons_covid_flag_any ==1 & end_date<died_date_onsA
  0

. replace died_ons_covid_flag_any=0 if end_date<died_date_onsA
(0 real changes made)

. keep patient_id start stop died_ons_covid_flag_any

. rename died_ons_covid_flag_any died_covid_any_flag

. * should be zero in real data
. count if start==stop
  0

. drop if start==stop
(0 observations deleted)

. save ./output/tv_outcome_died_covid_any_vacc, replace 
(note: file ./output/tv_outcome_died_covid_any_vacc.dta not found)
file ./output/tv_outcome_died_covid_any_vacc.dta saved

. tab died_covid_any_flag, m

died_covid_ |
   any_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        882       88.20       88.20
          1 |        118       11.80      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [7,9998]                     units:  1
         unique values:  1,000                    missing .:  0/1,000

                  mean:   5070.64
              std. dev:   2959.15

           percentiles:        10%       25%       50%       75%       90%
                               937    2406.5    5141.5    7655.5    9230.5

. restore 

. 
. * Hospitalisation - covid code in any position
. preserve 

. keep patient_id end_date hosp_any_flag hosp_covid_anyA end_date_flag

. gen start = date("01/03/2021", "DMY")

. egen stop = rowmin(hosp_covid_anyA end_date)

. count if hosp_any_flag ==1 & end_date<hosp_covid_anyA
  0

. tab end_date_flag if hosp_any_flag ==1 & end_date<hosp_covid_anyA
no observations

. replace hosp_any_flag=0 if end_date<hosp_covid_anyA
(0 real changes made)

. keep patient_id start stop hosp_any_flag

. * should be zero in real data
. count if start==stop
  0

. drop if start==stop
(0 observations deleted)

. save ./output/tv_outcome_hosp_any_vacc, replace 
(note: file ./output/tv_outcome_hosp_any_vacc.dta not found)
file ./output/tv_outcome_hosp_any_vacc.dta saved

. tab hosp_any_flag, m

hosp_any_fl |
         ag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        965       96.50       96.50
          1 |         35        3.50      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [7,9998]                     units:  1
         unique values:  1,000                    missing .:  0/1,000

                  mean:   5070.64
              std. dev:   2959.15

           percentiles:        10%       25%       50%       75%       90%
                               937    2406.5    5141.5    7655.5    9230.5

. count
  1,000

. bys patient_id: egen total_hosp = total(hosp_any_flag)

. tab total_hosp

 total_hosp |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        965       96.50       96.50
          1 |         35        3.50      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. restore 

. 
. * Composite 
. preserve 

. keep patient_id hosp_died* end_date

. gen start = date("01/03/2021", "DMY")

. egen stop = rowmin(hosp_died_dateA end_date)

. count if hosp_died_composite==1 & end_date<hosp_died_dateA
  0

. replace hosp_died_composite=0 if end_date<hosp_died_dateA
(0 real changes made)

. keep patient_id start stop hosp_died_composite

. rename hosp_died_composite composite_any_flag

. * should be zero in real data
. count if start==stop
  0

. drop if start==stop
(0 observations deleted)

. save ./output/tv_outcome_composite_any_vacc, replace 
(note: file ./output/tv_outcome_composite_any_vacc.dta not found)
file ./output/tv_outcome_composite_any_vacc.dta saved

. tab composite_any_flag, m

composite_a |
    ny_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        851       85.10       85.10
          1 |        149       14.90      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [7,9998]                     units:  1
         unique values:  1,000                    missing .:  0/1,000

                  mean:   5070.64
              std. dev:   2959.15

           percentiles:        10%       25%       50%       75%       90%
                               937    2406.5    5141.5    7655.5    9230.5

. restore 

. 
. * Merge files together for each outcome
. * Composite  
. use ./output/tv_severe_disease_vacc, clear 

. tvc_merge start stop using ./output/tv_covid_vacc_first_vacc, id(patient_id)

. tvc_merge start stop using ./output/tv_total_vaccs, id(patient_id)

. tvc_merge start stop using ./output/tv_liver_trans_vacc, id(patient_id)

. tvc_merge start stop using ./output/time_varying_udca_vacc, id(patient_id)

. tvc_merge start stop using ./output/tv_age_vacc, id(patient_id)

. tvc_merge start stop using ./output/tv_outcome_composite_any_vacc, id(patient
> _id) failure(composite_any_flag)

. * Dummy drug data includes people not in cohort, so drop these - should not b
> e any in real data 
. drop if age_tv==.
(1,910 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [7,9998]                     units:  1
         unique values:  1,000                    missing .:  0/2,686

                  mean:   5036.75
              std. dev:   2957.09

           percentiles:        10%       25%       50%       75%       90%
                               919      2352      5091      7636      9147

. * Check number of outcomes after merge  - there will be missings for rows aft
> er event
. tab composite_any_flag, m

composite_a |
    ny_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,462       91.66       91.66
          1 |        149        5.55       97.21
          . |         75        2.79      100.00
------------+-----------------------------------
      Total |      2,686      100.00

. missings report

Checking missings in all variables:
75 observations with missing values

  +--------------------------------+
  |                      # missing |
  |--------------------------------|
  | composite_any_flag          75 |
  +--------------------------------+

. drop if composite_any_flag==.
(75 observations deleted)

. save ./output/tv_vars_composite_any_vacc, replace 
(note: file ./output/tv_vars_composite_any_vacc.dta not found)
file ./output/tv_vars_composite_any_vacc.dta saved

. 
. * COVID death - covid code in any position
. use ./output/tv_severe_disease_vacc, clear 

. tvc_merge start stop using ./output/tv_covid_vacc_first_vacc, id(patient_id)

. tvc_merge start stop using ./output/tv_total_vaccs, id(patient_id)

. tvc_merge start stop using ./output/tv_liver_trans_vacc, id(patient_id)

. tvc_merge start stop using ./output/time_varying_udca_vacc, id(patient_id)

. tvc_merge start stop using ./output/tv_age_vacc, id(patient_id)

. tvc_merge start stop using ./output/tv_outcome_died_covid_any_vacc, id(patien
> t_id) failure(died_covid_any_flag)

. * Dummy drug data includes people not in cohort, so drop these - should not b
> e any in real data 
. drop if age_tv==.
(1,910 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [7,9998]                     units:  1
         unique values:  1,000                    missing .:  0/2,651

                  mean:   5035.56
              std. dev:   2956.61

           percentiles:        10%       25%       50%       75%       90%
                               903      2352      5085      7634      9147

. * Check number of outcomes after merge 
. tab died_covid_any_flag, m

died_covid_ |
   any_flag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,533       95.55       95.55
          1 |        118        4.45      100.00
------------+-----------------------------------
      Total |      2,651      100.00

. missings report

Checking missings in all variables:
0 observations with missing values

. save ./output/tv_vars_died_covid_any_vacc, replace 
(note: file ./output/tv_vars_died_covid_any_vacc.dta not found)
file ./output/tv_vars_died_covid_any_vacc.dta saved

. 
. * COVID hospitalisation - covid code in any position
. use ./output/tv_severe_disease_vacc, clear 

. tvc_merge start stop using ./output/tv_covid_vacc_first_vacc, id(patient_id)

. tvc_merge start stop using ./output/tv_total_vaccs, id(patient_id)

. tvc_merge start stop using ./output/tv_liver_trans_vacc, id(patient_id)

. tvc_merge start stop using ./output/time_varying_udca_vacc, id(patient_id)

. tvc_merge start stop using ./output/tv_age_vacc, id(patient_id)

. tvc_merge start stop using ./output/tv_outcome_hosp_any_vacc, id(patient_id) 
> failure(hosp_any_flag)

. * Check number of outcomes after merge 
. tab hosp_any_flag, m

hosp_any_fl |
         ag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,576       56.05       56.05
          1 |         35        0.76       56.81
          . |      1,985       43.19      100.00
------------+-----------------------------------
      Total |      4,596      100.00

. bys patient_id: egen total_hosp = total(hosp_any_flag)

. tab total_hosp

 total_hosp |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,421       96.19       96.19
          1 |        175        3.81      100.00
------------+-----------------------------------
      Total |      4,596      100.00

. * Dummy drug data includes people not in cohort, so drop these - should not b
> e any in real data 
. drop if age_tv==.
(1,910 observations deleted)

. codebook patient_id

-------------------------------------------------------------------------------
patient_id                                                          (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [7,9998]                     units:  1
         unique values:  1,000                    missing .:  0/2,686

                  mean:   5036.75
              std. dev:   2957.09

           percentiles:        10%       25%       50%       75%       90%
                               919      2352      5091      7636      9147

. * Check number of outcomes after merge - there will be missings for rows afte
> r event
. tab hosp_any_flag, m 

hosp_any_fl |
         ag |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,576       95.90       95.90
          1 |         35        1.30       97.21
          . |         75        2.79      100.00
------------+-----------------------------------
      Total |      2,686      100.00

. missings report

Checking missings in all variables:
75 observations with missing values

  +---------------------------+
  |                 # missing |
  |---------------------------|
  | hosp_any_flag          75 |
  +---------------------------+

. drop if hosp_any_flag==.
(75 observations deleted)

. save ./output/tv_vars_hosp_any_vacc, replace 
(note: file ./output/tv_vars_hosp_any_vacc.dta not found)
file ./output/tv_vars_hosp_any_vacc.dta saved

. 
. /* Format file with static covariates: sex, region, covid high risk condition
> s, 
> ethnicity, imd, bmi, smoking. */
. 
. ** Need to decide on second line therapies 
. use `tempfile', clear

. describe 

Contains data from /tmp/St00015.000001
  obs:         1,000                          
 vars:           109                          13 Oct 2023 13:57
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
dereg_date      str10   %10s                  
has_pbc_date    int     %8.0g                 
has_psc_date    int     %8.0g                 
fu_liver_tran~d str10   %10s                  
fu_liver_tran~s str10   %10s                  
udca_last_date  byte    %8.0g                 
udca_first_af~r str10   %10s                  
udca_first_hi~y str10   %10s                  
covid_va~t_date str10   %10s                  
covid_vacc_se~e str10   %10s                  
covid_vacc_th~e str10   %10s                  
covid_vacc_fo~e str10   %10s                  
covid_~fth_date str10   %10s                  
date_most_rec~c str10   %10s                  
severe_disea~ed str10   %10s                  
severe_disea~cd str10   %10s                  
solid_organ_t~m str10   %10s                  solid_organ_transplant_nhsd_snome
                                                > d
solid_organ_n~w str10   %10s                  
solid_organ_t~s byte    %8.0g                 solid_organ_transplant_nhsd_opcs4
transplant_al~4 byte    %8.0g                 
transplant_th~4 str10   %10s                  
transplant_co~p byte    %8.0g                 transplant_conjunctiva_y_code_opc
                                                > s4
transplant_co~4 str10   %10s                  
transplant_st~4 str10   %10s                  
transplant_il.. byte    %8.0g                 transplant_ileum_1_Y_codes_opcs4
transplant_il.. byte    %8.0g                 transplant_ileum_2_Y_codes_opcs4
transpl~1_opcs4 str10   %10s                  
transpl~2_opcs4 str10   %10s                  
hosp_covid_pr~y str10   %10s                  
hosp_covid_any  str10   %10s                  
died_date_ons   str10   %10s                  
age             byte    %8.0g                 
sex             str1    %9s                   
stp             str4    %9s                   
region_nhs      str24   %24s                  
has_msoa        byte    %8.0g                 
imd             byte    %8.0g                 
eth             byte    %8.0g                 
ethnicity_sus   byte    %8.0g                 
ethnicity       byte    %8.0g                 
smoking_status  str1    %9s                   
bmi             float   %9.0g                 
has_pbc         byte    %8.0g                 
has_psc         byte    %8.0g                 
liver_transpl~l byte    %8.0g                 
udca_count_bl   byte    %8.0g                 
udca_count_fu   byte    %8.0g                 
oca_bl          byte    %8.0g                 
budesonide_co~u byte    %8.0g                 
budesonide_co~l byte    %8.0g                 
fenofibrate_c~u byte    %8.0g                 
fenofibrate_c~l byte    %8.0g                 
gc_count_fu     byte    %8.0g                 
gc_count_bl     byte    %8.0g                 
rituximab_bl    byte    %8.0g                 
severe_diseas~l byte    %8.0g                 
learning_disa~d byte    %8.0g                 
cancer_opensa~d byte    %8.0g                 
cancer_opensa~w byte    %8.0g                 
cancer_opensa~r byte    %8.0g                 
haematopoieti~d byte    %8.0g                 
haematopoiet~10 byte    %8.0g                 
haematopoieti~4 byte    %8.0g                 
haematologica~m byte    %8.0g                 haematological_malignancies_snome
                                                > d
haematologica~1 byte    %8.0g                 haematological_malignancies_icd10
sickle_cell_d~d byte    %8.0g                 
sickle_cell_~10 byte    %8.0g                 
haematopoieti~_ byte    %8.0g                 haematopoietic_stem_cell_snomed_e
                                                > ver
haematopoie~0_e byte    %8.0g                 haematopoietic_stem_cell_icd10_ev
                                                > er
haematopoie~4_e byte    %8.0g                 haematopoietic_stem_cell_opcs4_ev
                                                > er
v71             byte    %8.0g                 haematological_malignancies_snome
                                                > d_ever
v72             byte    %8.0g                 haematological_malignancies_icd10
                                                > _ever
ckd_stage_5_~ed byte    %8.0g                 
ckd_stage_5_~10 byte    %8.0g                 
immunosuppres~d byte    %8.0g                 
oral_steroid_~d byte    %8.0g                 
oral_s~3m_count byte    %8.0g                 
oral_s~2m_count byte    %8.0g                 
immunosuppres~r byte    %8.0g                 
oral_steroid_~r byte    %8.0g                 
immunosupress~d byte    %8.0g                 
immunosupress~w byte    %8.0g                 
hiv_aids_nhsd~d byte    %8.0g                 
hiv_aids_nhs~10 byte    %8.0g                 
multiple_scl~ed byte    %8.0g                 
multiple_scl~10 byte    %8.0g                 
motor_neurone~e byte    %8.0g                 motor_neurone_disease_nhsd_snomed
motor_neuron~10 byte    %8.0g                 
myasthenia_g~ed byte    %8.0g                 
myasthenia_g~10 byte    %8.0g                 
huntingtons_~ed byte    %8.0g                 
huntingtons_~10 byte    %8.0g                 
died_ons_live~y byte    %8.0g                 
died_ons_live~g byte    %8.0g                 
died_ons_covi~y byte    %8.0g                 
died_ons_covi~g byte    %8.0g                 
liver_transpl~e str10   %10s                  
severe_diseas~e str10   %10s                  
haematologica~d byte    %8.0g                 
haematologica~r byte    %8.0g                 
ckd_stage_5_~sd byte    %8.0g                 
hiv_aids_nhsd   byte    %8.0g                 
solid_organ_t~d str10   %10s                  
solid_organ_t~w str10   %10s                  
multiple_scl~sd byte    %8.0g                 
motor_neurone~d byte    %8.0g                 
myasthenia_g~sd byte    %8.0g                 
huntingtons_~sd byte    %8.0g                 
patient_id      int     %8.0g                 
-------------------------------------------------------------------------------
Sorted by: 

. * Format variables 
. * Sex
. gen male = 1 if sex == "M"
(544 missing values generated)

. replace male = 0 if sex == "F"
(531 real changes made)

. * Ethnicity
. replace ethnicity=6 if ethnicity==0
(41 real changes made)

. label define eth5                       1 "White"                            
>            ///
>                             2 "Mixed"                           ///          
>                                    
>                             3 "Asian"                                   ///
>                             4 "Black"                                   ///
>                             5 "Other"                                   ///
>                             6 "Unknown"

.                     
. 
. label values ethnicity eth5

. safetab ethnicity, m
10

  ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |        148       14.80       14.80
      Mixed |        180       18.00       32.80
      Asian |        200       20.00       52.80
      Black |        219       21.90       74.70
      Other |        212       21.20       95.90
    Unknown |         41        4.10      100.00
------------+-----------------------------------
      Total |      1,000      100.00

. * Create White vs non-White ethnicity variable
. gen eth_bin = (ethnicity!=1)

. replace eth_bin = 2 if ethnicity==6
(41 real changes made)

. label define eth_3 0 "White" 1 "Non-White" 2 "Unknown"

. label values eth_bin eth_3

. tab eth_bin ethnicity, m 

           |                       ethnicity
   eth_bin |     White      Mixed      Asian      Black      Other |     Total
-----------+-------------------------------------------------------+----------
     White |       148          0          0          0          0 |       148 
 Non-White |         0        180        200        219        212 |       811 
   Unknown |         0          0          0          0          0 |        41 
-----------+-------------------------------------------------------+----------
     Total |       148        180        200        219        212 |     1,000 


           | ethnicity
   eth_bin |   Unknown |     Total
-----------+-----------+----------
     White |         0 |       148 
 Non-White |         0 |       811 
   Unknown |        41 |        41 
-----------+-----------+----------
     Total |        41 |     1,000 

. 
. 
. * IMD - should not be missing (i.e. 0) in real data
. replace imd=6 if imd==0
(54 real changes made)

. 
. * BMI categories
. * assume BMI's less than 10 are incorrect and set to missing 
. sum bmi, d 

                             bmi
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,000
25%     15.32269              0       Sum of Wgt.       1,000

50%     25.21698                      Mean           22.23855
                        Largest       Std. Dev.      13.17616
75%     31.40919       49.45975
90%        37.22       50.03633       Variance       173.6111
95%     40.20988       55.25287       Skewness      -.5297197
99%     45.08481        55.6831       Kurtosis       2.286155

. replace bmi = . if bmi<10
(210 real changes made, 210 to missing)

. egen bmi_cat = cut(bmi), at(0, 1, 18.5, 24.9, 29.9, 39.9, 100) icodes
(210 missing values generated)

. bys bmi_cat: sum bmi

-------------------------------------------------------------------------------
-> bmi_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |         82    15.13333    2.549967   10.32012   18.48942

-------------------------------------------------------------------------------
-> bmi_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        198    22.08599    1.767085    18.5205   24.85654

-------------------------------------------------------------------------------
-> bmi_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        191    27.55734    1.523472   24.92576   29.88753

-------------------------------------------------------------------------------
-> bmi_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        268    33.80841    2.839721   29.95342   39.77732

-------------------------------------------------------------------------------
-> bmi_cat = 5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |         51    43.44489     3.39261   40.04372    55.6831

-------------------------------------------------------------------------------
-> bmi_cat = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |          0


. * assume missing . is healthy range BMI
. replace bmi_cat = 2 if bmi_cat==. 
(210 real changes made)

. label define bmi 1 "Underweight" 2 "Healthy range" 3 "Overweight" 4 "Obese" 5
>  "Morbidly obese"

. label values bmi_cat bmi

. tab bmi_cat 

       bmi_cat |      Freq.     Percent        Cum.
---------------+-----------------------------------
   Underweight |         82        8.20        8.20
 Healthy range |        408       40.80       49.00
    Overweight |        191       19.10       68.10
         Obese |        268       26.80       94.90
Morbidly obese |         51        5.10      100.00
---------------+-----------------------------------
         Total |      1,000      100.00

. 
. * Smoking status - assume missings are non-smokers 
. gen smoking = 0 if smoking_status=="N"
(912 missing values generated)

. replace smoking = 1 if smoking_status=="S"
(208 real changes made)

. replace smoking = 2 if smoking_status=="E"
(162 real changes made)

. replace smoking = 1 if smoking==.
(542 real changes made)

. label define smok 1 "Current smoker" 2 "Ex-smoker" 0 "Never smoked" 

. label values smoking smok

. tab smoking 

       smoking |      Freq.     Percent        Cum.
---------------+-----------------------------------
  Never smoked |         88        8.80        8.80
Current smoker |        750       75.00       83.80
     Ex-smoker |        162       16.20      100.00
---------------+-----------------------------------
         Total |      1,000      100.00

. 
. * High risk covid conditions
. replace oral_steroid_drugs_nhsd=. if oral_steroid_drug_nhsd_3m_count < 2 & or
> al_steroid_drug_nhsd_12m_count < 4
(937 real changes made, 937 to missing)

. gen imid_nhsd=max(oral_steroid_drugs_nhsd, immunosuppresant_drugs_nhsd)

. gen rare_neuro_nhsd = max(multiple_sclerosis_nhsd, motor_neurone_disease_nhsd
> , myasthenia_gravis_nhsd, huntingtons_disease_nhsd)

. gen solid_organ_transplant_bin = solid_organ_transplant_nhsd_new!=""

. gen any_high_risk_condition = max(learning_disability_nhsd_snomed, cancer_ope
> nsafely_snomed_new, haematological_disease_nhsd, ///
> ckd_stage_5_nhsd, imid_nhsd, immunosupression_nhsd_new, hiv_aids_nhsd, solid_
> organ_transplant_bin, rare_neuro_nhsd)

. 
. * Time from most recent vaccination on 1st March 2021
. gen date_most_recent_cov_vacA = date(date_most_recent_cov_vac, "YMD")
(500 missing values generated)

. gen time_vacc = date("01Mar2021", "DMY") - date_most_recent_cov_vacA
(500 missing values generated)

. sum time_vacc, d

                          time_vacc
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            4              1
10%           10              1       Obs                 500
25%           24              1       Sum of Wgt.         500

50%           44                      Mean             44.566
                        Largest       Std. Dev.      25.07011
75%           66             89
90%           79             89       Variance       628.5107
95%           84             89       Skewness      -.0154158
99%         88.5             89       Kurtosis       1.852281

. xtile time_vacc_cat = time_vacc, nq(4)

. replace time_vacc_cat = 5 if time_vacc_cat == .
(500 real changes made)

. bys time_vacc_cat: sum time_vacc 

-------------------------------------------------------------------------------
-> time_vacc_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   time_vacc |        126     11.8254    6.770618          1         24

-------------------------------------------------------------------------------
-> time_vacc_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   time_vacc |        126    34.55556    5.649149         25         44

-------------------------------------------------------------------------------
-> time_vacc_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   time_vacc |        126    55.65873     6.53258         45         66

-------------------------------------------------------------------------------
-> time_vacc_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   time_vacc |        122     77.2623    6.398351         67         89

-------------------------------------------------------------------------------
-> time_vacc_cat = 5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   time_vacc |          0


. label define vacc_t 1 "Q1 closest vaccination" 2 "Q2" 3 "Q3" 4 "Q4 furthest v
> accination" 5 "No vaccination" 

. label values time_vacc_cat vacc_t 

. 
. keep patient_id male stp any_high_risk_condition ethnicity imd bmi_cat smokin
> g eth_bin time_vacc_cat has_pbc oca_bl

. tempfile basefile

. save `basefile', replace
(note: file /tmp/St00015.00000x not found)
file /tmp/St00015.00000x saved

. foreach var in died_covid_any hosp_any composite_any {
  2.     preserve 
  3.     merge 1:m patient_id using ./output/tv_vars_`var'_vacc 
  4.     drop _merge 
  5.     save ./output/an_dataset_`var'_vacc, replace
  6.     restore
  7. }

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,651  (_merge==3)
    -----------------------------------------
(note: file ./output/an_dataset_died_covid_any_vacc.dta not found)
file ./output/an_dataset_died_covid_any_vacc.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,611  (_merge==3)
    -----------------------------------------
(note: file ./output/an_dataset_hosp_any_vacc.dta not found)
file ./output/an_dataset_hosp_any_vacc.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,611  (_merge==3)
    -----------------------------------------
(note: file ./output/an_dataset_composite_any_vacc.dta not found)
file ./output/an_dataset_composite_any_vacc.dta saved

. 
. log close 
      name:  <unnamed>
       log:  /workspace/logs/time_varying.log
  log type:  text
 closed on:  13 Oct 2023, 13:57:47
-------------------------------------------------------------------------------
