
. 
. tempfile tempfile 

. import delimited using ./output/input_pbc.csv
(17 vars, 1,000 obs)

. save `tempfile' 
file /tmp/St00015.000001 saved

. 
. file open tablecontent using ./output/tables/udca_descriptives.txt, write tex
> t replace
(note: file ./output/tables/udca_descriptives.txt not found)

. 
. use ./output/time_varying_udca, clear 

. bys patient_id: gen last = _n==_N 

. 
. * summarise total number of prescriptions during follow-up 
. sum total_no_presc if last==1, d 

                       total_no_presc
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,899
25%            0              0       Sum of Wgt.       1,899

50%           14                      Mean           10.41127
                        Largest       Std. Dev.      10.15179
75%           20             28
90%           23             28       Variance       103.0589
95%           24             29       Skewness       .0426717
99%           26             29       Kurtosis       1.177709

. file write tablecontent _tab ("Number of obervations") _tab ("Mean") _tab ("S
> D") _tab ("Median") _tab ("25th percentile") _tab ("75th percentile") _n 

. file write tablecontent ("Number of prescriptions") _tab %3.1f (r(N)) _tab %3
> .1f (r(mean)) _tab %3.1f (r(sd)) _tab %3.1f (r(p50)) _tab %3.1f (r(p25)) _tab
>  %3.1f (r(p75)) _n 

. 
. * Summarise follow-up 
. sum total_fu if last==1, d

                          total_fu
-------------------------------------------------------------
      Percentiles      Smallest
 1%           30              3
 5%          106              5
10%          222              6       Obs               1,899
25%          632              7       Sum of Wgt.       1,899

50%         1035                      Mean           827.5787
                        Largest       Std. Dev.      328.3941
75%         1035           1035
90%         1035           1035       Variance       107842.7
95%         1035           1035       Skewness      -1.262524
99%         1035           1035       Kurtosis        3.01873

. file write tablecontent ("Total length of follow-up") _tab %3.1f (r(N)) _tab 
> %3.1f (r(mean)) _tab %3.1f (r(sd)) _tab %3.1f (r(p50)) _tab %3.1f (r(p25)) _t
> ab %3.1f (r(p75)) _n 

. 
. * Summarise proportion of time on udca 
. * First generate time for each row 
. gen time = stop - start 

. * Generate total time on & off udca 
. * First calculate time for both on and off within one variable 
. bys patient_id udca: egen time_udca = total(time)

. * From this generate variable with time off udca 
. bys patient_id: egen time_off_udca = max(time_udca) if udca==0
(6460 missing values generated)

. bys patient_id (time_off_udca): replace time_off_udca = time_off_udca[_n-1] i
> f time_off_udca==. & time_off_udca[_n-1]!=.
(6454 real changes made)

. * Update time_udca to only contain time on udca 
. replace time_udca=. if udca==0
(6,645 real changes made, 6,645 to missing)

. bys patient_id: egen time_on_udca = max(time_udca)
(901 missing values generated)

. * Check on and off equals total time of follow-up 
. count if time_on_udca + time_off_udca!=total_fu
  13,105

. 
. sum time_on_udca if last==1, d 

                        time_on_udca
-------------------------------------------------------------
      Percentiles      Smallest
 1%           71             21
 5%          415             21
10%          502             45       Obs                 998
25%          584             51       Sum of Wgt.         998

50%          654                      Mean           635.0611
                        Largest       Std. Dev.      134.7373
75%          720            866
90%          769            866       Variance       18154.13
95%          799            867       Skewness      -1.827994
99%          842            893       Kurtosis        8.04592

. file write tablecontent ("Total time on UDCA") _tab %3.1f (r(N)) _tab %3.1f (
> r(mean)) _tab %3.1f (r(sd)) _tab %3.1f (r(p50)) _tab %3.1f (r(p25)) _tab %3.1
> f (r(p75)) _n 

. 
. sum time_off_udca if last==1, d 

                        time_off_udca
-------------------------------------------------------------
      Percentiles      Smallest
 1%           25              1
 5%           83              3
10%          158              5       Obs               1,893
25%          255              6       Sum of Wgt.       1,893

50%          354                      Mean           464.5198
                        Largest       Std. Dev.      309.3897
75%          624           1035
90%         1035           1035       Variance       95722.01
95%         1035           1035       Skewness       .8370615
99%         1035           1035       Kurtosis       2.382767

. file write tablecontent ("Total time off UDCA") _tab %3.1f (r(N)) _tab %3.1f 
> (r(mean)) _tab %3.1f (r(sd)) _tab %3.1f (r(p50)) _tab %3.1f (r(p25)) _tab %3.
> 1f (r(p75)) _n 

. 
. file close tablecontent

. 
end of do-file

. . file open output using "/tmp/udca_descriptives.do.WpaY.out", write text rep
> lace

. . file write output "success" 

. . file close output

. 
end of do-file


